Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
/*-------------------------------------------------------------------------
 * PIC32MZ1025W104132 processor header
 * Build date : Apr 06 2022
 *
 * Copyright (c) 2022, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution. Publication is not required when this file 
 *         is used in an embedded application.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#pragma once
#ifndef __32MZ1025W104132_H
#define __32MZ1025W104132_H

#if defined (__LANGUAGE_C__) || defined (__LANGUAGE_C_PLUS_PLUS)

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Application-Defined Memory Regions */
#pragma region name="crypto1SCM" origin=0xBF900000 size=0x2000
#pragma region name="crypto1UCM" origin=0x9F902000 size=0x2000
#pragma region name="wcmDataMem" origin=0xBF803000 size=0x2000

#define CFGCON0 CFGCON0
extern volatile uint32_t   CFGCON0 __attribute__((section("sfrs"), address(0xBF800000)));
typedef struct {
  uint32_t TDOEN:1;
  uint32_t :1;
  uint32_t TROEN:1;
  uint32_t JTAGEN:1;
  uint32_t :1;
  uint32_t FCPRI:1;
  uint32_t DMAPRI:1;
  uint32_t EXLPRI:1;
  uint32_t USBSSEN:1;
  uint32_t :1;
  uint32_t PMULOCK:1;
  uint32_t PGLOCK:1;
  uint32_t PMDLOCK:1;
  uint32_t IOLOCK:1;
  uint32_t CFGLOCK:2;
  uint32_t OC_ACLK:1;
  uint32_t IC_ACLK:1;
  uint32_t :2;
  uint32_t CANFDDIV:2;
  uint32_t :1;
  uint32_t PCM:1;
  uint32_t UPLLHWMD:1;
  uint32_t SPLLHWMD:1;
  uint32_t BTPLLHWMD:1;
  uint32_t ETHPLLHWMD:1;
  uint32_t FECCCON:2;
  uint32_t ETHTPSF:1;
  uint32_t EPGMCLK:1;
} __CFGCON0bits_t;
extern volatile __CFGCON0bits_t CFGCON0bits __asm__ ("CFGCON0") __attribute__((section("sfrs"), address(0xBF800000)));
#define CFGCON1 CFGCON1
extern volatile uint32_t   CFGCON1 __attribute__((section("sfrs"), address(0xBF800010)));
typedef struct {
  uint32_t DEBUG:2;
  uint32_t :1;
  uint32_t ICESEL:2;
  uint32_t TRCEN:1;
  uint32_t :2;
  uint32_t FMIIEN:1;
  uint32_t ETHEXEREF:1;
  uint32_t CLASSBDIS:1;
  uint32_t USBIDIO:1;
  uint32_t VBUSIO:1;
  uint32_t HSSPIEN:1;
  uint32_t SMCLR:1;
  uint32_t HSUARTEN:1;
  uint32_t USBDMTRIM:4;
  uint32_t USBDPTRIM:4;
  uint32_t WDTPS:5;
} __CFGCON1bits_t;
extern volatile __CFGCON1bits_t CFGCON1bits __asm__ ("CFGCON1") __attribute__((section("sfrs"), address(0xBF800010)));
#define CFGCON2 CFGCON2
extern volatile uint32_t   CFGCON2 __attribute__((section("sfrs"), address(0xBF800020)));
typedef struct {
  uint32_t :3;
  uint32_t DMTINTV:3;
  uint32_t :2;
  uint32_t POSCMOD:2;
  uint32_t WDTRMCS:2;
  uint32_t SOSCSEL:1;
  uint32_t WAKE2SPD:1;
  uint32_t CKSWEN:1;
  uint32_t FSCMEN:1;
  uint32_t WDTPS:5;
  uint32_t WDTSPGM:1;
  uint32_t WINDIS:1;
  uint32_t WDTEN:1;
  uint32_t WDTWINSZ:2;
  uint32_t DMTCNT:5;
  uint32_t DMTEN:1;
} __CFGCON2bits_t;
extern volatile __CFGCON2bits_t CFGCON2bits __asm__ ("CFGCON2") __attribute__((section("sfrs"), address(0xBF800020)));
#define CFGCON3 CFGCON3
extern volatile uint32_t   CFGCON3 __attribute__((section("sfrs"), address(0xBF800030)));
typedef struct {
  uint32_t ETHPLLPOSTDIV2:6;
  uint32_t SPLLPOSTDIV2:6;
  uint32_t BTPLLPOSTDIV2:6;
} __CFGCON3bits_t;
extern volatile __CFGCON3bits_t CFGCON3bits __asm__ ("CFGCON3") __attribute__((section("sfrs"), address(0xBF800030)));
#define CFGCON4 CFGCON4
extern volatile uint32_t   CFGCON4 __attribute__((section("sfrs"), address(0xBF800040)));
typedef struct {
  uint32_t SOSCCFG:8;
  uint32_t :11;
  uint32_t VBZPBOREN:1;
  uint32_t DSZPBOREN:1;
  uint32_t DSWDTPS:5;
  uint32_t DSWDTOSC:1;
  uint32_t DSWDTEN:1;
  uint32_t DSEN:1;
  uint32_t :1;
  uint32_t SOSCEN:1;
} __CFGCON4bits_t;
extern volatile __CFGCON4bits_t CFGCON4bits __asm__ ("CFGCON4") __attribute__((section("sfrs"), address(0xBF800040)));
#define CFGPG CFGPG
extern volatile uint32_t   CFGPG __attribute__((section("sfrs"), address(0xBF800050)));
typedef struct {
  uint32_t CPUPG:2;
  uint32_t FCPG:2;
  uint32_t DMAPG:2;
  uint32_t ICDJPG:2;
  uint32_t WIFIPG:2;
  uint32_t ADCPG:2;
  uint32_t CAN1PG:2;
  uint32_t CAN2PG:2;
  uint32_t CRY1PG:2;
  uint32_t ETHPG:2;
  uint32_t SQIPG:2;
  uint32_t USBPG:2;
} __CFGPGbits_t;
extern volatile __CFGPGbits_t CFGPGbits __asm__ ("CFGPG") __attribute__((section("sfrs"), address(0xBF800050)));
#define DEVID DEVID
extern volatile uint32_t   DEVID __attribute__((section("sfrs"), address(0xBF800060)));
typedef struct {
  uint32_t DEVID:28;
  uint32_t VER:4;
} __DEVIDbits_t;
extern volatile __DEVIDbits_t DEVIDbits __asm__ ("DEVID") __attribute__((section("sfrs"), address(0xBF800060)));
#define USERID USERID
extern volatile uint32_t   USERID __attribute__((section("sfrs"), address(0xBF800070)));
typedef struct {
  uint32_t USERID:16;
} __USERIDbits_t;
extern volatile __USERIDbits_t USERIDbits __asm__ ("USERID") __attribute__((section("sfrs"), address(0xBF800070)));
#define SYSKEY SYSKEY
extern volatile uint32_t   SYSKEY __attribute__((section("sfrs"), address(0xBF800080)));
typedef struct {
  uint32_t SYSKEY:32;
} __SYSKEYbits_t;
extern volatile __SYSKEYbits_t SYSKEYbits __asm__ ("SYSKEY") __attribute__((section("sfrs"), address(0xBF800080)));
#define PMD1 PMD1
extern volatile uint32_t   PMD1 __attribute__((section("sfrs"), address(0xBF800090)));
typedef struct {
  uint32_t ADCSAR0MD:1;
  uint32_t :6;
  uint32_t ADCSARSHRMD:1;
  uint32_t ADC1MD:1;
  uint32_t :2;
  uint32_t PTGMD:1;
  uint32_t :3;
  uint32_t CVD1MD:1;
  uint32_t RTCC1MD:1;
  uint32_t :2;
  uint32_t DMA1MD:1;
  uint32_t :3;
  uint32_t BA414MD:1;
  uint32_t CRYPT1MD:1;
  uint32_t :1;
  uint32_t RNG1MD:1;
  uint32_t :2;
  uint32_t SQI1MD:1;
} __PMD1bits_t;
extern volatile __PMD1bits_t PMD1bits __asm__ ("PMD1") __attribute__((section("sfrs"), address(0xBF800090)));
#define PMD2 PMD2
extern volatile uint32_t   PMD2 __attribute__((section("sfrs"), address(0xBF8000A0)));
typedef struct {
  uint32_t IC1MD:1;
  uint32_t IC2MD:1;
  uint32_t IC3MD:1;
  uint32_t IC4MD:1;
  uint32_t :4;
  uint32_t OC1MD:1;
  uint32_t OC2MD:1;
  uint32_t OC3MD:1;
  uint32_t OC4MD:1;
  uint32_t :4;
  uint32_t T1MD:1;
  uint32_t T2MD:1;
  uint32_t T3MD:1;
  uint32_t T4MD:1;
  uint32_t T5MD:1;
  uint32_t T6MD:1;
  uint32_t T7MD:1;
  uint32_t :5;
  uint32_t REFO1MD:1;
  uint32_t REFO2MD:1;
  uint32_t REFO3MD:1;
  uint32_t REFO4MD:1;
} __PMD2bits_t;
