Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __DMTPRECLRbits_t DMTPRECLRbits __asm__ ("DMTPRECLR") __attribute__((section("sfrs"), address(0xBF800A10)));
#define DMTCLR DMTCLR
extern volatile uint32_t   DMTCLR __attribute__((section("sfrs"), address(0xBF800A20)));
typedef struct {
  uint32_t STEP2:8;
} __DMTCLRbits_t;
extern volatile __DMTCLRbits_t DMTCLRbits __asm__ ("DMTCLR") __attribute__((section("sfrs"), address(0xBF800A20)));
#define DMTSTAT DMTSTAT
extern volatile uint32_t   DMTSTAT __attribute__((section("sfrs"), address(0xBF800A30)));
typedef union {
  struct {
    uint32_t WINOPN:1;
    uint32_t :4;
    uint32_t DMTEVENT:1;
    uint32_t BAD:2;
  };
  struct {
    uint32_t :6;
    uint32_t BAD2:1;
    uint32_t BAD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __DMTSTATbits_t;
extern volatile __DMTSTATbits_t DMTSTATbits __asm__ ("DMTSTAT") __attribute__((section("sfrs"), address(0xBF800A30)));
#define DMTCNT DMTCNT
extern volatile uint32_t   DMTCNT __attribute__((section("sfrs"), address(0xBF800A40)));
typedef struct {
  uint32_t COUNTER:32;
} __DMTCNTbits_t;
extern volatile __DMTCNTbits_t DMTCNTbits __asm__ ("DMTCNT") __attribute__((section("sfrs"), address(0xBF800A40)));
#define DMTHOLDREG DMTHOLDREG
extern volatile uint32_t   DMTHOLDREG __attribute__((section("sfrs"), address(0xBF800A50)));
typedef struct {
  uint32_t UPRCNT:16;
} __DMTHOLDREGbits_t;
extern volatile __DMTHOLDREGbits_t DMTHOLDREGbits __asm__ ("DMTHOLDREG") __attribute__((section("sfrs"), address(0xBF800A50)));
#define DMTPSCNT DMTPSCNT
extern volatile uint32_t   DMTPSCNT __attribute__((section("sfrs"), address(0xBF800A60)));
typedef struct {
  uint32_t PSCNT:32;
} __DMTPSCNTbits_t;
extern volatile __DMTPSCNTbits_t DMTPSCNTbits __asm__ ("DMTPSCNT") __attribute__((section("sfrs"), address(0xBF800A60)));
#define DMTPSINTV DMTPSINTV
extern volatile uint32_t   DMTPSINTV __attribute__((section("sfrs"), address(0xBF800A70)));
typedef struct {
  uint32_t PSINTV:32;
} __DMTPSINTVbits_t;
extern volatile __DMTPSINTVbits_t DMTPSINTVbits __asm__ ("DMTPSINTV") __attribute__((section("sfrs"), address(0xBF800A70)));
#define OSCCON OSCCON
extern volatile uint32_t   OSCCON __attribute__((section("sfrs"), address(0xBF801200)));
typedef struct {
  uint32_t OSWEN:1;
  uint32_t SOSCEN:1;
  uint32_t UFRCEN:1;
  uint32_t CF:1;
  uint32_t SLPEN:1;
  uint32_t :2;
  uint32_t CLKLOCK:1;
  uint32_t NOSC:4;
  uint32_t COSC:4;
  uint32_t :5;
  uint32_t WAKE2SPD:1;
  uint32_t :1;
  uint32_t DRMEN:1;
  uint32_t FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs"), address(0xBF801200)));
extern volatile uint32_t        OSCCONCLR __attribute__((section("sfrs"),address(0xBF801204)));
extern volatile uint32_t        OSCCONSET __attribute__((section("sfrs"),address(0xBF801208)));
extern volatile uint32_t        OSCCONINV __attribute__((section("sfrs"),address(0xBF80120C)));
#define OSCTUN OSCTUN
extern volatile uint32_t   OSCTUN __attribute__((section("sfrs"), address(0xBF801210)));
typedef struct {
  uint32_t TUN:6;
} __OSCTUNbits_t;
extern volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN") __attribute__((section("sfrs"), address(0xBF801210)));
extern volatile uint32_t        OSCTUNCLR __attribute__((section("sfrs"),address(0xBF801214)));
extern volatile uint32_t        OSCTUNSET __attribute__((section("sfrs"),address(0xBF801218)));
extern volatile uint32_t        OSCTUNINV __attribute__((section("sfrs"),address(0xBF80121C)));
#define SPLLCON SPLLCON
extern volatile uint32_t   SPLLCON __attribute__((section("sfrs"), address(0xBF801220)));
typedef struct {
  uint32_t SPLLBSWSEL:3;
  uint32_t SPLLPWDN:1;
  uint32_t SPLLPOSTDIV1:6;
  uint32_t SPLLFLOCK:1;
  uint32_t SPLLRST:1;
  uint32_t SPLLFBDIV:10;
  uint32_t SPLLREFDIV:6;
  uint32_t :1;
  uint32_t SLOCK:1;
  uint32_t SPLLICLK:1;
  uint32_t SPLL_BYP:1;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits __asm__ ("SPLLCON") __attribute__((section("sfrs"), address(0xBF801220)));
extern volatile uint32_t        SPLLCONCLR __attribute__((section("sfrs"),address(0xBF801224)));
extern volatile uint32_t        SPLLCONSET __attribute__((section("sfrs"),address(0xBF801228)));
extern volatile uint32_t        SPLLCONINV __attribute__((section("sfrs"),address(0xBF80122C)));
#define UPLLCON UPLLCON
extern volatile uint32_t   UPLLCON __attribute__((section("sfrs"), address(0xBF801230)));
typedef struct {
  uint32_t UPLLBSWSEL:3;
  uint32_t UPLLPWDN:1;
  uint32_t UPLLPOSTDIV1:6;
  uint32_t UPLLFLOCK:1;
  uint32_t UPLLRST:1;
  uint32_t UPLLFBDIV:10;
  uint32_t UPLLREFDIV:6;
  uint32_t :1;
  uint32_t ULOCK:1;
  uint32_t :1;
  uint32_t UPLL_BYP:1;
} __UPLLCONbits_t;
extern volatile __UPLLCONbits_t UPLLCONbits __asm__ ("UPLLCON") __attribute__((section("sfrs"), address(0xBF801230)));
extern volatile uint32_t        UPLLCONCLR __attribute__((section("sfrs"),address(0xBF801234)));
extern volatile uint32_t        UPLLCONSET __attribute__((section("sfrs"),address(0xBF801238)));
extern volatile uint32_t        UPLLCONINV __attribute__((section("sfrs"),address(0xBF80123C)));
#define BTPLLCON BTPLLCON
extern volatile uint32_t   BTPLLCON __attribute__((section("sfrs"), address(0xBF801240)));
typedef struct {
  uint32_t BTPLLBSWSEL:3;
  uint32_t BTPLLPWDN:1;
  uint32_t BTPLLPOSTDIV1:6;
  uint32_t BTPLLFLOCK:1;
  uint32_t BTPLLRST:1;
  uint32_t BTPLLFBDIV:10;
  uint32_t BTPLLREFDIV:6;
  uint32_t BTCLKOUTEN:1;
  uint32_t BTLOCK:1;
  uint32_t BTPLLCLK:1;
  uint32_t BTPLL_BYP:1;
} __BTPLLCONbits_t;
extern volatile __BTPLLCONbits_t BTPLLCONbits __asm__ ("BTPLLCON") __attribute__((section("sfrs"), address(0xBF801240)));
extern volatile uint32_t        BTPLLCONCLR __attribute__((section("sfrs"),address(0xBF801244)));
extern volatile uint32_t        BTPLLCONSET __attribute__((section("sfrs"),address(0xBF801248)));
extern volatile uint32_t        BTPLLCONINV __attribute__((section("sfrs"),address(0xBF80124C)));
#define EWPLLCON EWPLLCON
extern volatile uint32_t   EWPLLCON __attribute__((section("sfrs"), address(0xBF801250)));
typedef struct {
  uint32_t EWPLLBSWSEL:3;
  uint32_t EWPLLPWDN:1;
  uint32_t EWPLLPOSTDIV1:6;
  uint32_t EWPLLFLOCK:1;
  uint32_t EWPLLRST:1;
  uint32_t EWPLLFBDIV:10;
  uint32_t EWPLLREFDIV:6;
  uint32_t ETHCLKOUTEN:1;
  uint32_t EWLOCK:1;
  uint32_t EWPLLICLK:1;
  uint32_t EWPLL_BYP:1;
} __EWPLLCONbits_t;
extern volatile __EWPLLCONbits_t EWPLLCONbits __asm__ ("EWPLLCON") __attribute__((section("sfrs"), address(0xBF801250)));
extern volatile uint32_t        EWPLLCONCLR __attribute__((section("sfrs"),address(0xBF801254)));
extern volatile uint32_t        EWPLLCONSET __attribute__((section("sfrs"),address(0xBF801258)));
extern volatile uint32_t        EWPLLCONINV __attribute__((section("sfrs"),address(0xBF80125C)));
#define RCON RCON
extern volatile uint32_t   RCON __attribute__((section("sfrs"), address(0xBF801260)));
typedef struct {
  uint32_t POR:1;
  uint32_t BOR:1;
  uint32_t IDLE:1;
  uint32_t SLEEP:1;
  uint32_t WDTO:1;
  uint32_t DMTO:1;
  uint32_t SWR:1;
  uint32_t EXTR:1;
  uint32_t :1;
  uint32_t CMR:1;
  uint32_t DPSLP:1;
  uint32_t :5;
  uint32_t VBAT:1;
  uint32_t VBPOR:1;
  uint32_t :6;
  uint32_t NVMEOL:1;
  uint32_t NVMLTA:1;
  uint32_t BCFGFAIL:1;
  uint32_t BCFGERR:1;
  uint32_t :2;
  uint32_t PORCORE:1;
  uint32_t PORIO:1;
} __RCONbits_t;
