Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __RCONbits_t RCONbits __asm__ ("RCON") __attribute__((section("sfrs"), address(0xBF801260)));
extern volatile uint32_t        RCONCLR __attribute__((section("sfrs"),address(0xBF801264)));
extern volatile uint32_t        RCONSET __attribute__((section("sfrs"),address(0xBF801268)));
extern volatile uint32_t        RCONINV __attribute__((section("sfrs"),address(0xBF80126C)));
#define RSWRST RSWRST
extern volatile uint32_t   RSWRST __attribute__((section("sfrs"), address(0xBF801270)));
typedef struct {
  uint32_t SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST") __attribute__((section("sfrs"), address(0xBF801270)));
extern volatile uint32_t        RSWRSTCLR __attribute__((section("sfrs"),address(0xBF801274)));
extern volatile uint32_t        RSWRSTSET __attribute__((section("sfrs"),address(0xBF801278)));
extern volatile uint32_t        RSWRSTINV __attribute__((section("sfrs"),address(0xBF80127C)));
#define RNMICON RNMICON
extern volatile uint32_t   RNMICON __attribute__((section("sfrs"), address(0xBF801280)));
typedef struct {
  uint32_t NMICNT:16;
  uint32_t WDTS:1;
  uint32_t CF:1;
  uint32_t LVD:1;
  uint32_t GNMI:1;
  uint32_t :3;
  uint32_t SWNMI:1;
  uint32_t WDTR:1;
  uint32_t DMTO:1;
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits __asm__ ("RNMICON") __attribute__((section("sfrs"), address(0xBF801280)));
extern volatile uint32_t        RNMICONCLR __attribute__((section("sfrs"),address(0xBF801284)));
extern volatile uint32_t        RNMICONSET __attribute__((section("sfrs"),address(0xBF801288)));
extern volatile uint32_t        RNMICONINV __attribute__((section("sfrs"),address(0xBF80128C)));
#define PWRCON PWRCON
extern volatile uint32_t   PWRCON __attribute__((section("sfrs"), address(0xBF801290)));
typedef struct {
  uint32_t VREGS:1;
  uint32_t :3;
  uint32_t VRGSLP:2;
  uint32_t VRGRUN:2;
} __PWRCONbits_t;
extern volatile __PWRCONbits_t PWRCONbits __asm__ ("PWRCON") __attribute__((section("sfrs"), address(0xBF801290)));
extern volatile uint32_t        PWRCONCLR __attribute__((section("sfrs"),address(0xBF801294)));
extern volatile uint32_t        PWRCONSET __attribute__((section("sfrs"),address(0xBF801298)));
extern volatile uint32_t        PWRCONINV __attribute__((section("sfrs"),address(0xBF80129C)));
#define REFO1CON REFO1CON
extern volatile uint32_t   REFO1CON __attribute__((section("sfrs"), address(0xBF8012A0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO1CONbits_t;
extern volatile __REFO1CONbits_t REFO1CONbits __asm__ ("REFO1CON") __attribute__((section("sfrs"), address(0xBF8012A0)));
extern volatile uint32_t        REFO1CONCLR __attribute__((section("sfrs"),address(0xBF8012A4)));
extern volatile uint32_t        REFO1CONSET __attribute__((section("sfrs"),address(0xBF8012A8)));
extern volatile uint32_t        REFO1CONINV __attribute__((section("sfrs"),address(0xBF8012AC)));
#define REFO1TRIM REFO1TRIM
extern volatile uint32_t   REFO1TRIM __attribute__((section("sfrs"), address(0xBF8012B0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO1TRIMbits_t;
extern volatile __REFO1TRIMbits_t REFO1TRIMbits __asm__ ("REFO1TRIM") __attribute__((section("sfrs"), address(0xBF8012B0)));
extern volatile uint32_t        REFO1TRIMCLR __attribute__((section("sfrs"),address(0xBF8012B4)));
extern volatile uint32_t        REFO1TRIMSET __attribute__((section("sfrs"),address(0xBF8012B8)));
extern volatile uint32_t        REFO1TRIMINV __attribute__((section("sfrs"),address(0xBF8012BC)));
#define REFO2CON REFO2CON
extern volatile uint32_t   REFO2CON __attribute__((section("sfrs"), address(0xBF8012C0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO2CONbits_t;
extern volatile __REFO2CONbits_t REFO2CONbits __asm__ ("REFO2CON") __attribute__((section("sfrs"), address(0xBF8012C0)));
extern volatile uint32_t        REFO2CONCLR __attribute__((section("sfrs"),address(0xBF8012C4)));
extern volatile uint32_t        REFO2CONSET __attribute__((section("sfrs"),address(0xBF8012C8)));
extern volatile uint32_t        REFO2CONINV __attribute__((section("sfrs"),address(0xBF8012CC)));
#define REFO2TRIM REFO2TRIM
extern volatile uint32_t   REFO2TRIM __attribute__((section("sfrs"), address(0xBF8012D0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO2TRIMbits_t;
extern volatile __REFO2TRIMbits_t REFO2TRIMbits __asm__ ("REFO2TRIM") __attribute__((section("sfrs"), address(0xBF8012D0)));
extern volatile uint32_t        REFO2TRIMCLR __attribute__((section("sfrs"),address(0xBF8012D4)));
extern volatile uint32_t        REFO2TRIMSET __attribute__((section("sfrs"),address(0xBF8012D8)));
extern volatile uint32_t        REFO2TRIMINV __attribute__((section("sfrs"),address(0xBF8012DC)));
#define REFO3CON REFO3CON
extern volatile uint32_t   REFO3CON __attribute__((section("sfrs"), address(0xBF8012E0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO3CONbits_t;
extern volatile __REFO3CONbits_t REFO3CONbits __asm__ ("REFO3CON") __attribute__((section("sfrs"), address(0xBF8012E0)));
extern volatile uint32_t        REFO3CONCLR __attribute__((section("sfrs"),address(0xBF8012E4)));
extern volatile uint32_t        REFO3CONSET __attribute__((section("sfrs"),address(0xBF8012E8)));
extern volatile uint32_t        REFO3CONINV __attribute__((section("sfrs"),address(0xBF8012EC)));
#define REFO3TRIM REFO3TRIM
extern volatile uint32_t   REFO3TRIM __attribute__((section("sfrs"), address(0xBF8012F0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO3TRIMbits_t;
extern volatile __REFO3TRIMbits_t REFO3TRIMbits __asm__ ("REFO3TRIM") __attribute__((section("sfrs"), address(0xBF8012F0)));
extern volatile uint32_t        REFO3TRIMCLR __attribute__((section("sfrs"),address(0xBF8012F4)));
extern volatile uint32_t        REFO3TRIMSET __attribute__((section("sfrs"),address(0xBF8012F8)));
extern volatile uint32_t        REFO3TRIMINV __attribute__((section("sfrs"),address(0xBF8012FC)));
#define REFO4CON REFO4CON
extern volatile uint32_t   REFO4CON __attribute__((section("sfrs"), address(0xBF801300)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO4CONbits_t;
extern volatile __REFO4CONbits_t REFO4CONbits __asm__ ("REFO4CON") __attribute__((section("sfrs"), address(0xBF801300)));
extern volatile uint32_t        REFO4CONCLR __attribute__((section("sfrs"),address(0xBF801304)));
extern volatile uint32_t        REFO4CONSET __attribute__((section("sfrs"),address(0xBF801308)));
extern volatile uint32_t        REFO4CONINV __attribute__((section("sfrs"),address(0xBF80130C)));
#define REFO4TRIM REFO4TRIM
extern volatile uint32_t   REFO4TRIM __attribute__((section("sfrs"), address(0xBF801310)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO4TRIMbits_t;
extern volatile __REFO4TRIMbits_t REFO4TRIMbits __asm__ ("REFO4TRIM") __attribute__((section("sfrs"), address(0xBF801310)));
extern volatile uint32_t        REFO4TRIMCLR __attribute__((section("sfrs"),address(0xBF801314)));
extern volatile uint32_t        REFO4TRIMSET __attribute__((section("sfrs"),address(0xBF801318)));
extern volatile uint32_t        REFO4TRIMINV __attribute__((section("sfrs"),address(0xBF80131C)));
#define PB1DIV PB1DIV
extern volatile uint32_t   PB1DIV __attribute__((section("sfrs"), address(0xBF801320)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t PB1DIVON:1;
} __PB1DIVbits_t;
extern volatile __PB1DIVbits_t PB1DIVbits __asm__ ("PB1DIV") __attribute__((section("sfrs"), address(0xBF801320)));
extern volatile uint32_t        PB1DIVCLR __attribute__((section("sfrs"),address(0xBF801324)));
extern volatile uint32_t        PB1DIVSET __attribute__((section("sfrs"),address(0xBF801328)));
extern volatile uint32_t        PB1DIVINV __attribute__((section("sfrs"),address(0xBF80132C)));
#define PB2DIV PB2DIV
extern volatile uint32_t   PB2DIV __attribute__((section("sfrs"), address(0xBF801330)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t PB2DIVON:1;
} __PB2DIVbits_t;
extern volatile __PB2DIVbits_t PB2DIVbits __asm__ ("PB2DIV") __attribute__((section("sfrs"), address(0xBF801330)));
extern volatile uint32_t        PB2DIVCLR __attribute__((section("sfrs"),address(0xBF801334)));
extern volatile uint32_t        PB2DIVSET __attribute__((section("sfrs"),address(0xBF801338)));
extern volatile uint32_t        PB2DIVINV __attribute__((section("sfrs"),address(0xBF80133C)));
#define PB3DIV PB3DIV
extern volatile uint32_t   PB3DIV __attribute__((section("sfrs"), address(0xBF801340)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t PB3DIVON:1;
} __PB3DIVbits_t;
extern volatile __PB3DIVbits_t PB3DIVbits __asm__ ("PB3DIV") __attribute__((section("sfrs"), address(0xBF801340)));
extern volatile uint32_t        PB3DIVCLR __attribute__((section("sfrs"),address(0xBF801344)));
extern volatile uint32_t        PB3DIVSET __attribute__((section("sfrs"),address(0xBF801348)));
extern volatile uint32_t        PB3DIVINV __attribute__((section("sfrs"),address(0xBF80134C)));
#define PB4DIV PB4DIV
extern volatile uint32_t   PB4DIV __attribute__((section("sfrs"), address(0xBF801350)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t PB4DIVON:1;
} __PB4DIVbits_t;
extern volatile __PB4DIVbits_t PB4DIVbits __asm__ ("PB4DIV") __attribute__((section("sfrs"), address(0xBF801350)));
extern volatile uint32_t        PB4DIVCLR __attribute__((section("sfrs"),address(0xBF801354)));
extern volatile uint32_t        PB4DIVSET __attribute__((section("sfrs"),address(0xBF801358)));
extern volatile uint32_t        PB4DIVINV __attribute__((section("sfrs"),address(0xBF80135C)));
#define PB5DIV PB5DIV
extern volatile uint32_t   PB5DIV __attribute__((section("sfrs"), address(0xBF801360)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t PB5DIVON:1;
} __PB5DIVbits_t;
extern volatile __PB5DIVbits_t PB5DIVbits __asm__ ("PB5DIV") __attribute__((section("sfrs"), address(0xBF801360)));
extern volatile uint32_t        PB5DIVCLR __attribute__((section("sfrs"),address(0xBF801364)));
extern volatile uint32_t        PB5DIVSET __attribute__((section("sfrs"),address(0xBF801368)));
extern volatile uint32_t        PB5DIVINV __attribute__((section("sfrs"),address(0xBF80136C)));
#define PB6DIV PB6DIV
extern volatile uint32_t   PB6DIV __attribute__((section("sfrs"), address(0xBF801370)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t PB6DIVON:1;
} __PB6DIVbits_t;
extern volatile __PB6DIVbits_t PB6DIVbits __asm__ ("PB6DIV") __attribute__((section("sfrs"), address(0xBF801370)));
extern volatile uint32_t        PB6DIVCLR __attribute__((section("sfrs"),address(0xBF801374)));
extern volatile uint32_t        PB6DIVSET __attribute__((section("sfrs"),address(0xBF801378)));
extern volatile uint32_t        PB6DIVINV __attribute__((section("sfrs"),address(0xBF80137C)));
#define SLEWCON SLEWCON
extern volatile uint32_t   SLEWCON __attribute__((section("sfrs"), address(0xBF801380)));
typedef struct {
  uint32_t BUSY:1;
  uint32_t DNEN:1;
  uint32_t UPEN:1;
  uint32_t :5;
  uint32_t SLWDIV:3;
  uint32_t :5;
  uint32_t SYSDIV:4;
  uint32_t :4;
  uint32_t SLWDLY:4;
} __SLEWCONbits_t;
extern volatile __SLEWCONbits_t SLEWCONbits __asm__ ("SLEWCON") __attribute__((section("sfrs"), address(0xBF801380)));
extern volatile uint32_t        SLEWCONCLR __attribute__((section("sfrs"),address(0xBF801384)));
extern volatile uint32_t        SLEWCONSET __attribute__((section("sfrs"),address(0xBF801388)));
extern volatile uint32_t        SLEWCONINV __attribute__((section("sfrs"),address(0xBF80138C)));
#define CLKSTAT CLKSTAT
extern volatile uint32_t   CLKSTAT __attribute__((section("sfrs"), address(0xBF801390)));
typedef struct {
  uint32_t FRCRDY:1;
  uint32_t SPLLRDY:1;
  uint32_t POSCRDY:1;
  uint32_t UPLLRDY:1;
  uint32_t SOSCRDY:1;
  uint32_t LPRCRDY:1;
  uint32_t BTPLLRDY:1;
  uint32_t ETHPLLRDY:1;
  uint32_t WIFICLKRDY:1;
  uint32_t SPLLALTRDY:1;
  uint32_t PB1CLKRDY:1;
  uint32_t SYSCLKRDY:1;
} __CLKSTATbits_t;
