Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __T5CKRbits_t T5CKRbits __asm__ ("T5CKR") __attribute__((section("sfrs"), address(0xBF801824)));
#define T6CKR T6CKR
extern volatile uint32_t   T6CKR __attribute__((section("sfrs"), address(0xBF801828)));
typedef struct {
  uint32_t T6CKR:4;
} __T6CKRbits_t;
extern volatile __T6CKRbits_t T6CKRbits __asm__ ("T6CKR") __attribute__((section("sfrs"), address(0xBF801828)));
#define T7CKR T7CKR
extern volatile uint32_t   T7CKR __attribute__((section("sfrs"), address(0xBF80182C)));
typedef struct {
  uint32_t T7CKR:4;
} __T7CKRbits_t;
extern volatile __T7CKRbits_t T7CKRbits __asm__ ("T7CKR") __attribute__((section("sfrs"), address(0xBF80182C)));
#define IC1R IC1R
extern volatile uint32_t   IC1R __attribute__((section("sfrs"), address(0xBF801838)));
typedef struct {
  uint32_t IC1R:4;
} __IC1Rbits_t;
extern volatile __IC1Rbits_t IC1Rbits __asm__ ("IC1R") __attribute__((section("sfrs"), address(0xBF801838)));
#define IC2R IC2R
extern volatile uint32_t   IC2R __attribute__((section("sfrs"), address(0xBF80183C)));
typedef struct {
  uint32_t IC2R:4;
} __IC2Rbits_t;
extern volatile __IC2Rbits_t IC2Rbits __asm__ ("IC2R") __attribute__((section("sfrs"), address(0xBF80183C)));
#define IC3R IC3R
extern volatile uint32_t   IC3R __attribute__((section("sfrs"), address(0xBF801840)));
typedef struct {
  uint32_t IC3R:4;
} __IC3Rbits_t;
extern volatile __IC3Rbits_t IC3Rbits __asm__ ("IC3R") __attribute__((section("sfrs"), address(0xBF801840)));
#define IC4R IC4R
extern volatile uint32_t   IC4R __attribute__((section("sfrs"), address(0xBF801844)));
typedef struct {
  uint32_t IC4R:4;
} __IC4Rbits_t;
extern volatile __IC4Rbits_t IC4Rbits __asm__ ("IC4R") __attribute__((section("sfrs"), address(0xBF801844)));
#define OCFAR OCFAR
extern volatile uint32_t   OCFAR __attribute__((section("sfrs"), address(0xBF80185C)));
typedef struct {
  uint32_t OCFAR:4;
} __OCFARbits_t;
extern volatile __OCFARbits_t OCFARbits __asm__ ("OCFAR") __attribute__((section("sfrs"), address(0xBF80185C)));
#define OCFBR OCFBR
extern volatile uint32_t   OCFBR __attribute__((section("sfrs"), address(0xBF801860)));
typedef struct {
  uint32_t OCFBR:4;
} __OCFBRbits_t;
extern volatile __OCFBRbits_t OCFBRbits __asm__ ("OCFBR") __attribute__((section("sfrs"), address(0xBF801860)));
#define OCFCR OCFCR
extern volatile uint32_t   OCFCR __attribute__((section("sfrs"), address(0xBF801864)));
typedef struct {
  uint32_t OCFCR:4;
} __OCFCRbits_t;
extern volatile __OCFCRbits_t OCFCRbits __asm__ ("OCFCR") __attribute__((section("sfrs"), address(0xBF801864)));
#define OCFDR OCFDR
extern volatile uint32_t   OCFDR __attribute__((section("sfrs"), address(0xBF801868)));
typedef struct {
  uint32_t OCFDR:4;
} __OCFDRbits_t;
extern volatile __OCFDRbits_t OCFDRbits __asm__ ("OCFDR") __attribute__((section("sfrs"), address(0xBF801868)));
#define U1RXR U1RXR
extern volatile uint32_t   U1RXR __attribute__((section("sfrs"), address(0xBF80186C)));
typedef struct {
  uint32_t U1RXR:4;
} __U1RXRbits_t;
extern volatile __U1RXRbits_t U1RXRbits __asm__ ("U1RXR") __attribute__((section("sfrs"), address(0xBF80186C)));
#define U1CTSR U1CTSR
extern volatile uint32_t   U1CTSR __attribute__((section("sfrs"), address(0xBF801870)));
typedef struct {
  uint32_t U1CTSR:4;
} __U1CTSRbits_t;
extern volatile __U1CTSRbits_t U1CTSRbits __asm__ ("U1CTSR") __attribute__((section("sfrs"), address(0xBF801870)));
#define U2RXR U2RXR
extern volatile uint32_t   U2RXR __attribute__((section("sfrs"), address(0xBF801874)));
typedef struct {
  uint32_t U2RXR:4;
} __U2RXRbits_t;
extern volatile __U2RXRbits_t U2RXRbits __asm__ ("U2RXR") __attribute__((section("sfrs"), address(0xBF801874)));
#define U2CTSR U2CTSR
extern volatile uint32_t   U2CTSR __attribute__((section("sfrs"), address(0xBF801878)));
typedef struct {
  uint32_t U2CTSR:4;
} __U2CTSRbits_t;
extern volatile __U2CTSRbits_t U2CTSRbits __asm__ ("U2CTSR") __attribute__((section("sfrs"), address(0xBF801878)));
#define U3RXR U3RXR
extern volatile uint32_t   U3RXR __attribute__((section("sfrs"), address(0xBF80187C)));
typedef struct {
  uint32_t U3RXR:4;
} __U3RXRbits_t;
extern volatile __U3RXRbits_t U3RXRbits __asm__ ("U3RXR") __attribute__((section("sfrs"), address(0xBF80187C)));
#define U3CTSR U3CTSR
extern volatile uint32_t   U3CTSR __attribute__((section("sfrs"), address(0xBF801880)));
typedef struct {
  uint32_t U3CTSR:4;
} __U3CTSRbits_t;
extern volatile __U3CTSRbits_t U3CTSRbits __asm__ ("U3CTSR") __attribute__((section("sfrs"), address(0xBF801880)));
#define PTG30R PTG30R
extern volatile uint32_t   PTG30R __attribute__((section("sfrs"), address(0xBF80188C)));
typedef struct {
  uint32_t PTG30R:4;
} __PTG30Rbits_t;
extern volatile __PTG30Rbits_t PTG30Rbits __asm__ ("PTG30R") __attribute__((section("sfrs"), address(0xBF80188C)));
#define PTG31R PTG31R
extern volatile uint32_t   PTG31R __attribute__((section("sfrs"), address(0xBF801890)));
typedef struct {
  uint32_t PTG31R:4;
} __PTG31Rbits_t;
extern volatile __PTG31Rbits_t PTG31Rbits __asm__ ("PTG31R") __attribute__((section("sfrs"), address(0xBF801890)));
#define SDI1R SDI1R
extern volatile uint32_t   SDI1R __attribute__((section("sfrs"), address(0xBF801898)));
typedef struct {
  uint32_t SDI1R:4;
} __SDI1Rbits_t;
extern volatile __SDI1Rbits_t SDI1Rbits __asm__ ("SDI1R") __attribute__((section("sfrs"), address(0xBF801898)));
#define SS1INR SS1INR
extern volatile uint32_t   SS1INR __attribute__((section("sfrs"), address(0xBF80189C)));
typedef struct {
  uint32_t SS1INR:4;
} __SS1INRbits_t;
extern volatile __SS1INRbits_t SS1INRbits __asm__ ("SS1INR") __attribute__((section("sfrs"), address(0xBF80189C)));
#define SDI2R SDI2R
extern volatile uint32_t   SDI2R __attribute__((section("sfrs"), address(0xBF8018A4)));
typedef struct {
  uint32_t SDI2R:4;
} __SDI2Rbits_t;
extern volatile __SDI2Rbits_t SDI2Rbits __asm__ ("SDI2R") __attribute__((section("sfrs"), address(0xBF8018A4)));
#define SS2INR SS2INR
extern volatile uint32_t   SS2INR __attribute__((section("sfrs"), address(0xBF8018A8)));
typedef struct {
  uint32_t SS2INR:4;
} __SS2INRbits_t;
extern volatile __SS2INRbits_t SS2INRbits __asm__ ("SS2INR") __attribute__((section("sfrs"), address(0xBF8018A8)));
#define C1RXR C1RXR
extern volatile uint32_t   C1RXR __attribute__((section("sfrs"), address(0xBF8018C4)));
typedef struct {
  uint32_t C1RXR:4;
} __C1RXRbits_t;
extern volatile __C1RXRbits_t C1RXRbits __asm__ ("C1RXR") __attribute__((section("sfrs"), address(0xBF8018C4)));
#define C2RXR C2RXR
extern volatile uint32_t   C2RXR __attribute__((section("sfrs"), address(0xBF8018C8)));
typedef struct {
  uint32_t C2RXR:4;
} __C2RXRbits_t;
