Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __PTGQUE5bits_t PTGQUE5bits __asm__ ("PTGQUE5") __attribute__((section("sfrs"), address(0xBF801D10)));
extern volatile uint32_t        PTGQUE5CLR __attribute__((section("sfrs"),address(0xBF801D14)));
extern volatile uint32_t        PTGQUE5SET __attribute__((section("sfrs"),address(0xBF801D18)));
extern volatile uint32_t        PTGQUE5INV __attribute__((section("sfrs"),address(0xBF801D1C)));
#define PTGQUE6 PTGQUE6
extern volatile uint32_t   PTGQUE6 __attribute__((section("sfrs"), address(0xBF801D20)));
typedef struct {
  uint32_t STEP24:8;
  uint32_t STEP25:8;
  uint32_t STEP26:8;
  uint32_t STEP27:8;
} __PTGQUE6bits_t;
extern volatile __PTGQUE6bits_t PTGQUE6bits __asm__ ("PTGQUE6") __attribute__((section("sfrs"), address(0xBF801D20)));
extern volatile uint32_t        PTGQUE6CLR __attribute__((section("sfrs"),address(0xBF801D24)));
extern volatile uint32_t        PTGQUE6SET __attribute__((section("sfrs"),address(0xBF801D28)));
extern volatile uint32_t        PTGQUE6INV __attribute__((section("sfrs"),address(0xBF801D2C)));
#define PTGQUE7 PTGQUE7
extern volatile uint32_t   PTGQUE7 __attribute__((section("sfrs"), address(0xBF801D30)));
typedef struct {
  uint32_t STEP28:8;
  uint32_t STEP29:8;
  uint32_t STEP30:8;
  uint32_t STEP31:8;
} __PTGQUE7bits_t;
extern volatile __PTGQUE7bits_t PTGQUE7bits __asm__ ("PTGQUE7") __attribute__((section("sfrs"), address(0xBF801D30)));
extern volatile uint32_t        PTGQUE7CLR __attribute__((section("sfrs"),address(0xBF801D34)));
extern volatile uint32_t        PTGQUE7SET __attribute__((section("sfrs"),address(0xBF801D38)));
extern volatile uint32_t        PTGQUE7INV __attribute__((section("sfrs"),address(0xBF801D3C)));
#define T1CON T1CON
extern volatile uint32_t   T1CON __attribute__((section("sfrs"), address(0xBF802000)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t TSYNC:1;
    uint32_t :1;
    uint32_t TCKPS:2;
    uint32_t :1;
    uint32_t TGATE:1;
    uint32_t TECS:2;
    uint32_t :1;
    uint32_t TWIP:1;
    uint32_t TWDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t :2;
    uint32_t TECS0:1;
    uint32_t TECS1:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T1CONbits_t;
extern volatile __T1CONbits_t T1CONbits __asm__ ("T1CON") __attribute__((section("sfrs"), address(0xBF802000)));
extern volatile uint32_t        T1CONCLR __attribute__((section("sfrs"),address(0xBF802004)));
extern volatile uint32_t        T1CONSET __attribute__((section("sfrs"),address(0xBF802008)));
extern volatile uint32_t        T1CONINV __attribute__((section("sfrs"),address(0xBF80200C)));
#define TMR1 TMR1
extern volatile uint32_t   TMR1 __attribute__((section("sfrs"), address(0xBF802010)));
extern volatile uint32_t        TMR1CLR __attribute__((section("sfrs"),address(0xBF802014)));
extern volatile uint32_t        TMR1SET __attribute__((section("sfrs"),address(0xBF802018)));
extern volatile uint32_t        TMR1INV __attribute__((section("sfrs"),address(0xBF80201C)));
#define PR1 PR1
extern volatile uint32_t   PR1 __attribute__((section("sfrs"), address(0xBF802020)));
extern volatile uint32_t        PR1CLR __attribute__((section("sfrs"),address(0xBF802024)));
extern volatile uint32_t        PR1SET __attribute__((section("sfrs"),address(0xBF802028)));
extern volatile uint32_t        PR1INV __attribute__((section("sfrs"),address(0xBF80202C)));
#define T2CON T2CON
extern volatile uint32_t   T2CON __attribute__((section("sfrs"), address(0xBF802200)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T2CONbits_t;
extern volatile __T2CONbits_t T2CONbits __asm__ ("T2CON") __attribute__((section("sfrs"), address(0xBF802200)));
extern volatile uint32_t        T2CONCLR __attribute__((section("sfrs"),address(0xBF802204)));
extern volatile uint32_t        T2CONSET __attribute__((section("sfrs"),address(0xBF802208)));
extern volatile uint32_t        T2CONINV __attribute__((section("sfrs"),address(0xBF80220C)));
#define TMR2 TMR2
extern volatile uint32_t   TMR2 __attribute__((section("sfrs"), address(0xBF802210)));
extern volatile uint32_t        TMR2CLR __attribute__((section("sfrs"),address(0xBF802214)));
extern volatile uint32_t        TMR2SET __attribute__((section("sfrs"),address(0xBF802218)));
extern volatile uint32_t        TMR2INV __attribute__((section("sfrs"),address(0xBF80221C)));
#define PR2 PR2
extern volatile uint32_t   PR2 __attribute__((section("sfrs"), address(0xBF802220)));
extern volatile uint32_t        PR2CLR __attribute__((section("sfrs"),address(0xBF802224)));
extern volatile uint32_t        PR2SET __attribute__((section("sfrs"),address(0xBF802228)));
extern volatile uint32_t        PR2INV __attribute__((section("sfrs"),address(0xBF80222C)));
#define T3CON T3CON
extern volatile uint32_t   T3CON __attribute__((section("sfrs"), address(0xBF802400)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T3CONbits_t;
extern volatile __T3CONbits_t T3CONbits __asm__ ("T3CON") __attribute__((section("sfrs"), address(0xBF802400)));
extern volatile uint32_t        T3CONCLR __attribute__((section("sfrs"),address(0xBF802404)));
extern volatile uint32_t        T3CONSET __attribute__((section("sfrs"),address(0xBF802408)));
extern volatile uint32_t        T3CONINV __attribute__((section("sfrs"),address(0xBF80240C)));
#define TMR3 TMR3
extern volatile uint32_t   TMR3 __attribute__((section("sfrs"), address(0xBF802410)));
extern volatile uint32_t        TMR3CLR __attribute__((section("sfrs"),address(0xBF802414)));
extern volatile uint32_t        TMR3SET __attribute__((section("sfrs"),address(0xBF802418)));
extern volatile uint32_t        TMR3INV __attribute__((section("sfrs"),address(0xBF80241C)));
#define PR3 PR3
extern volatile uint32_t   PR3 __attribute__((section("sfrs"), address(0xBF802420)));
extern volatile uint32_t        PR3CLR __attribute__((section("sfrs"),address(0xBF802424)));
extern volatile uint32_t        PR3SET __attribute__((section("sfrs"),address(0xBF802428)));
extern volatile uint32_t        PR3INV __attribute__((section("sfrs"),address(0xBF80242C)));
#define T4CON T4CON
extern volatile uint32_t   T4CON __attribute__((section("sfrs"), address(0xBF802600)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T4CONbits_t;
extern volatile __T4CONbits_t T4CONbits __asm__ ("T4CON") __attribute__((section("sfrs"), address(0xBF802600)));
extern volatile uint32_t        T4CONCLR __attribute__((section("sfrs"),address(0xBF802604)));
extern volatile uint32_t        T4CONSET __attribute__((section("sfrs"),address(0xBF802608)));
extern volatile uint32_t        T4CONINV __attribute__((section("sfrs"),address(0xBF80260C)));
#define TMR4 TMR4
extern volatile uint32_t   TMR4 __attribute__((section("sfrs"), address(0xBF802610)));
extern volatile uint32_t        TMR4CLR __attribute__((section("sfrs"),address(0xBF802614)));
extern volatile uint32_t        TMR4SET __attribute__((section("sfrs"),address(0xBF802618)));
extern volatile uint32_t        TMR4INV __attribute__((section("sfrs"),address(0xBF80261C)));
#define PR4 PR4
extern volatile uint32_t   PR4 __attribute__((section("sfrs"), address(0xBF802620)));
extern volatile uint32_t        PR4CLR __attribute__((section("sfrs"),address(0xBF802624)));
extern volatile uint32_t        PR4SET __attribute__((section("sfrs"),address(0xBF802628)));
extern volatile uint32_t        PR4INV __attribute__((section("sfrs"),address(0xBF80262C)));
#define T5CON T5CON
extern volatile uint32_t   T5CON __attribute__((section("sfrs"), address(0xBF802800)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T5CONbits_t;
extern volatile __T5CONbits_t T5CONbits __asm__ ("T5CON") __attribute__((section("sfrs"), address(0xBF802800)));
extern volatile uint32_t        T5CONCLR __attribute__((section("sfrs"),address(0xBF802804)));
extern volatile uint32_t        T5CONSET __attribute__((section("sfrs"),address(0xBF802808)));
extern volatile uint32_t        T5CONINV __attribute__((section("sfrs"),address(0xBF80280C)));
#define TMR5 TMR5
extern volatile uint32_t   TMR5 __attribute__((section("sfrs"), address(0xBF802810)));
extern volatile uint32_t        TMR5CLR __attribute__((section("sfrs"),address(0xBF802814)));
extern volatile uint32_t        TMR5SET __attribute__((section("sfrs"),address(0xBF802818)));
extern volatile uint32_t        TMR5INV __attribute__((section("sfrs"),address(0xBF80281C)));
#define PR5 PR5
extern volatile uint32_t   PR5 __attribute__((section("sfrs"), address(0xBF802820)));
extern volatile uint32_t        PR5CLR __attribute__((section("sfrs"),address(0xBF802824)));
extern volatile uint32_t        PR5SET __attribute__((section("sfrs"),address(0xBF802828)));
extern volatile uint32_t        PR5INV __attribute__((section("sfrs"),address(0xBF80282C)));
#define T6CON T6CON
extern volatile uint32_t   T6CON __attribute__((section("sfrs"), address(0xBF802A00)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T6CONbits_t;
