Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __IPC13bits_t IPC13bits __asm__ ("IPC13") __attribute__((section("sfrs"), address(0xBF810210)));
extern volatile uint32_t        IPC13CLR __attribute__((section("sfrs"),address(0xBF810214)));
extern volatile uint32_t        IPC13SET __attribute__((section("sfrs"),address(0xBF810218)));
extern volatile uint32_t        IPC13INV __attribute__((section("sfrs"),address(0xBF81021C)));
#define IPC14 IPC14
extern volatile uint32_t   IPC14 __attribute__((section("sfrs"), address(0xBF810220)));
typedef struct {
  uint32_t U2EIS:2;
  uint32_t U2EIP:3;
  uint32_t :3;
  uint32_t U2RXIS:2;
  uint32_t U2RXIP:3;
  uint32_t :3;
  uint32_t U2TXIS:2;
  uint32_t U2TXIP:3;
  uint32_t :3;
  uint32_t I2C2BIS:2;
  uint32_t I2C2BIP:3;
} __IPC14bits_t;
extern volatile __IPC14bits_t IPC14bits __asm__ ("IPC14") __attribute__((section("sfrs"), address(0xBF810220)));
extern volatile uint32_t        IPC14CLR __attribute__((section("sfrs"),address(0xBF810224)));
extern volatile uint32_t        IPC14SET __attribute__((section("sfrs"),address(0xBF810228)));
extern volatile uint32_t        IPC14INV __attribute__((section("sfrs"),address(0xBF81022C)));
#define IPC15 IPC15
extern volatile uint32_t   IPC15 __attribute__((section("sfrs"), address(0xBF810230)));
typedef struct {
  uint32_t I2C2SIS:2;
  uint32_t I2C2SIP:3;
  uint32_t :3;
  uint32_t I2C2MIS:2;
  uint32_t I2C2MIP:3;
  uint32_t :3;
  uint32_t U3EIS:2;
  uint32_t U3EIP:3;
  uint32_t :3;
  uint32_t U3RXIS:2;
  uint32_t U3RXIP:3;
} __IPC15bits_t;
extern volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs"), address(0xBF810230)));
extern volatile uint32_t        IPC15CLR __attribute__((section("sfrs"),address(0xBF810234)));
extern volatile uint32_t        IPC15SET __attribute__((section("sfrs"),address(0xBF810238)));
extern volatile uint32_t        IPC15INV __attribute__((section("sfrs"),address(0xBF81023C)));
#define IPC16 IPC16
extern volatile uint32_t   IPC16 __attribute__((section("sfrs"), address(0xBF810240)));
typedef struct {
  uint32_t U3TXIS:2;
  uint32_t U3TXIP:3;
} __IPC16bits_t;
extern volatile __IPC16bits_t IPC16bits __asm__ ("IPC16") __attribute__((section("sfrs"), address(0xBF810240)));
extern volatile uint32_t        IPC16CLR __attribute__((section("sfrs"),address(0xBF810244)));
extern volatile uint32_t        IPC16SET __attribute__((section("sfrs"),address(0xBF810248)));
extern volatile uint32_t        IPC16INV __attribute__((section("sfrs"),address(0xBF81024C)));
#define IPC17 IPC17
extern volatile uint32_t   IPC17 __attribute__((section("sfrs"), address(0xBF810250)));
typedef struct {
  uint32_t DMA0IS:2;
  uint32_t DMA0IP:3;
  uint32_t :3;
  uint32_t DMA1IS:2;
  uint32_t DMA1IP:3;
  uint32_t :3;
  uint32_t DMA2IS:2;
  uint32_t DMA2IP:3;
  uint32_t :3;
  uint32_t DMA3IS:2;
  uint32_t DMA3IP:3;
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs"), address(0xBF810250)));
extern volatile uint32_t        IPC17CLR __attribute__((section("sfrs"),address(0xBF810254)));
extern volatile uint32_t        IPC17SET __attribute__((section("sfrs"),address(0xBF810258)));
extern volatile uint32_t        IPC17INV __attribute__((section("sfrs"),address(0xBF81025C)));
#define IPC18 IPC18
extern volatile uint32_t   IPC18 __attribute__((section("sfrs"), address(0xBF810260)));
typedef struct {
  uint32_t DMA4IS:2;
  uint32_t DMA4IP:3;
  uint32_t :3;
  uint32_t DMA5IS:2;
  uint32_t DMA5IP:3;
  uint32_t :3;
  uint32_t DMA6IS:2;
  uint32_t DMA6IP:3;
  uint32_t :3;
  uint32_t DMA7IS:2;
  uint32_t DMA7IP:3;
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs"), address(0xBF810260)));
extern volatile uint32_t        IPC18CLR __attribute__((section("sfrs"),address(0xBF810264)));
extern volatile uint32_t        IPC18SET __attribute__((section("sfrs"),address(0xBF810268)));
extern volatile uint32_t        IPC18INV __attribute__((section("sfrs"),address(0xBF81026C)));
#define IPC19 IPC19
extern volatile uint32_t   IPC19 __attribute__((section("sfrs"), address(0xBF810270)));
typedef struct {
  uint32_t T6IS:2;
  uint32_t T6IP:3;
} __IPC19bits_t;
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs"), address(0xBF810270)));
extern volatile uint32_t        IPC19CLR __attribute__((section("sfrs"),address(0xBF810274)));
extern volatile uint32_t        IPC19SET __attribute__((section("sfrs"),address(0xBF810278)));
extern volatile uint32_t        IPC19INV __attribute__((section("sfrs"),address(0xBF81027C)));
#define IPC20 IPC20
extern volatile uint32_t   IPC20 __attribute__((section("sfrs"), address(0xBF810280)));
typedef struct {
  uint32_t T7IS:2;
  uint32_t T7IP:3;
  uint32_t :19;
  uint32_t RFSMCIS:2;
  uint32_t RFSMCIP:3;
} __IPC20bits_t;
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs"), address(0xBF810280)));
extern volatile uint32_t        IPC20CLR __attribute__((section("sfrs"),address(0xBF810284)));
extern volatile uint32_t        IPC20SET __attribute__((section("sfrs"),address(0xBF810288)));
extern volatile uint32_t        IPC20INV __attribute__((section("sfrs"),address(0xBF81028C)));
#define IPC21 IPC21
extern volatile uint32_t   IPC21 __attribute__((section("sfrs"), address(0xBF810290)));
typedef struct {
  uint32_t RFMACIS:2;
  uint32_t RFMACIP:3;
  uint32_t :3;
  uint32_t CTREVIS:2;
  uint32_t CTREVIP:3;
  uint32_t :3;
  uint32_t RFTM0IS:2;
  uint32_t RFTM0IP:3;
  uint32_t :3;
  uint32_t RFTM1IS:2;
  uint32_t RFTM1IP:3;
} __IPC21bits_t;
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs"), address(0xBF810290)));
extern volatile uint32_t        IPC21CLR __attribute__((section("sfrs"),address(0xBF810294)));
extern volatile uint32_t        IPC21SET __attribute__((section("sfrs"),address(0xBF810298)));
extern volatile uint32_t        IPC21INV __attribute__((section("sfrs"),address(0xBF81029C)));
#define IPC22 IPC22
extern volatile uint32_t   IPC22 __attribute__((section("sfrs"), address(0xBF8102A0)));
typedef struct {
  uint32_t RFTM2IS:2;
  uint32_t RFTM2IP:3;
  uint32_t :3;
  uint32_t RFTM3IS:2;
  uint32_t RFTM3IP:3;
  uint32_t :3;
  uint32_t CTRTRGIS:2;
  uint32_t CTRTRGIP:3;
  uint32_t :3;
  uint32_t RFWCOEIS:2;
  uint32_t RFWCOEIP:3;
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs"), address(0xBF8102A0)));
extern volatile uint32_t        IPC22CLR __attribute__((section("sfrs"),address(0xBF8102A4)));
extern volatile uint32_t        IPC22SET __attribute__((section("sfrs"),address(0xBF8102A8)));
extern volatile uint32_t        IPC22INV __attribute__((section("sfrs"),address(0xBF8102AC)));
#define IPC23 IPC23
extern volatile uint32_t   IPC23 __attribute__((section("sfrs"), address(0xBF8102B0)));
typedef struct {
  uint32_t AD1IS:2;
  uint32_t AD1IP:3;
  uint32_t :11;
  uint32_t AD1DC1IS:2;
  uint32_t AD1DC1IP:3;
  uint32_t :3;
  uint32_t AD1DC2IS:2;
  uint32_t AD1DC2IP:3;
} __IPC23bits_t;
