Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs"), address(0xBF8102B0)));
extern volatile uint32_t        IPC23CLR __attribute__((section("sfrs"),address(0xBF8102B4)));
extern volatile uint32_t        IPC23SET __attribute__((section("sfrs"),address(0xBF8102B8)));
extern volatile uint32_t        IPC23INV __attribute__((section("sfrs"),address(0xBF8102BC)));
#define IPC24 IPC24
extern volatile uint32_t   IPC24 __attribute__((section("sfrs"), address(0xBF8102C0)));
typedef struct {
  uint32_t AD1DF1IS:2;
  uint32_t AD1DF1IP:3;
  uint32_t :3;
  uint32_t AD1DF2IS:2;
  uint32_t AD1DF2IP:3;
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs"), address(0xBF8102C0)));
extern volatile uint32_t        IPC24CLR __attribute__((section("sfrs"),address(0xBF8102C4)));
extern volatile uint32_t        IPC24SET __attribute__((section("sfrs"),address(0xBF8102C8)));
extern volatile uint32_t        IPC24INV __attribute__((section("sfrs"),address(0xBF8102CC)));
#define IPC25 IPC25
extern volatile uint32_t   IPC25 __attribute__((section("sfrs"), address(0xBF8102D0)));
typedef struct {
  uint32_t AD1DFIIS:2;
  uint32_t AD1DFIIP:3;
  uint32_t :3;
  uint32_t AD1EOSIS:2;
  uint32_t AD1EOSIP:3;
  uint32_t :3;
  uint32_t AD1ARIS:2;
  uint32_t AD1ARIP:3;
  uint32_t :3;
  uint32_t AD1RSIS:2;
  uint32_t AD1RSIP:3;
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs"), address(0xBF8102D0)));
extern volatile uint32_t        IPC25CLR __attribute__((section("sfrs"),address(0xBF8102D4)));
extern volatile uint32_t        IPC25SET __attribute__((section("sfrs"),address(0xBF8102D8)));
extern volatile uint32_t        IPC25INV __attribute__((section("sfrs"),address(0xBF8102DC)));
#define IPC26 IPC26
extern volatile uint32_t   IPC26 __attribute__((section("sfrs"), address(0xBF8102E0)));
typedef struct {
  uint32_t AD1FCIS:2;
  uint32_t AD1FCIP:3;
  uint32_t :11;
  uint32_t AD1I00IS:2;
  uint32_t AD1I00IP:3;
  uint32_t :3;
  uint32_t AD1I01IS:2;
  uint32_t AD1I01IP:3;
} __IPC26bits_t;
extern volatile __IPC26bits_t IPC26bits __asm__ ("IPC26") __attribute__((section("sfrs"), address(0xBF8102E0)));
extern volatile uint32_t        IPC26CLR __attribute__((section("sfrs"),address(0xBF8102E4)));
extern volatile uint32_t        IPC26SET __attribute__((section("sfrs"),address(0xBF8102E8)));
extern volatile uint32_t        IPC26INV __attribute__((section("sfrs"),address(0xBF8102EC)));
#define IPC27 IPC27
extern volatile uint32_t   IPC27 __attribute__((section("sfrs"), address(0xBF8102F0)));
typedef struct {
  uint32_t AD1I02IS:2;
  uint32_t AD1I02IP:3;
  uint32_t :3;
  uint32_t AD1I03IS:2;
  uint32_t AD1I03IP:3;
  uint32_t :3;
  uint32_t AD1I04IS:2;
  uint32_t AD1I04IP:3;
  uint32_t :3;
  uint32_t AD1I05IS:2;
  uint32_t AD1I05IP:3;
} __IPC27bits_t;
extern volatile __IPC27bits_t IPC27bits __asm__ ("IPC27") __attribute__((section("sfrs"), address(0xBF8102F0)));
extern volatile uint32_t        IPC27CLR __attribute__((section("sfrs"),address(0xBF8102F4)));
extern volatile uint32_t        IPC27SET __attribute__((section("sfrs"),address(0xBF8102F8)));
extern volatile uint32_t        IPC27INV __attribute__((section("sfrs"),address(0xBF8102FC)));
#define IPC28 IPC28
extern volatile uint32_t   IPC28 __attribute__((section("sfrs"), address(0xBF810300)));
typedef struct {
  uint32_t AD1I06IS:2;
  uint32_t AD1I06IP:3;
  uint32_t :3;
  uint32_t AD1I07IS:2;
  uint32_t AD1I07IP:3;
  uint32_t :3;
  uint32_t AD1I08IS:2;
  uint32_t AD1I08IP:3;
  uint32_t :3;
  uint32_t AD1I09IS:2;
  uint32_t AD1I09IP:3;
} __IPC28bits_t;
extern volatile __IPC28bits_t IPC28bits __asm__ ("IPC28") __attribute__((section("sfrs"), address(0xBF810300)));
extern volatile uint32_t        IPC28CLR __attribute__((section("sfrs"),address(0xBF810304)));
extern volatile uint32_t        IPC28SET __attribute__((section("sfrs"),address(0xBF810308)));
extern volatile uint32_t        IPC28INV __attribute__((section("sfrs"),address(0xBF81030C)));
#define IPC29 IPC29
extern volatile uint32_t   IPC29 __attribute__((section("sfrs"), address(0xBF810310)));
typedef struct {
  uint32_t AD1I10IS:2;
  uint32_t AD1I10IP:3;
  uint32_t :3;
  uint32_t AD1I11IS:2;
  uint32_t AD1I11IP:3;
  uint32_t :3;
  uint32_t AD1I12IS:2;
  uint32_t AD1I12IP:3;
  uint32_t :3;
  uint32_t AD1I13IS:2;
  uint32_t AD1I13IP:3;
} __IPC29bits_t;
extern volatile __IPC29bits_t IPC29bits __asm__ ("IPC29") __attribute__((section("sfrs"), address(0xBF810310)));
extern volatile uint32_t        IPC29CLR __attribute__((section("sfrs"),address(0xBF810314)));
extern volatile uint32_t        IPC29SET __attribute__((section("sfrs"),address(0xBF810318)));
extern volatile uint32_t        IPC29INV __attribute__((section("sfrs"),address(0xBF81031C)));
#define IPC30 IPC30
extern volatile uint32_t   IPC30 __attribute__((section("sfrs"), address(0xBF810320)));
typedef struct {
  uint32_t AD1I14IS:2;
  uint32_t AD1I14IP:3;
  uint32_t :3;
  uint32_t AD1I15IS:2;
  uint32_t AD1I15IP:3;
  uint32_t :3;
  uint32_t AD1I16IS:2;
  uint32_t AD1I16IP:3;
  uint32_t :3;
  uint32_t AD1I17IS:2;
  uint32_t AD1I17IP:3;
} __IPC30bits_t;
extern volatile __IPC30bits_t IPC30bits __asm__ ("IPC30") __attribute__((section("sfrs"), address(0xBF810320)));
extern volatile uint32_t        IPC30CLR __attribute__((section("sfrs"),address(0xBF810324)));
extern volatile uint32_t        IPC30SET __attribute__((section("sfrs"),address(0xBF810328)));
extern volatile uint32_t        IPC30INV __attribute__((section("sfrs"),address(0xBF81032C)));
#define IPC31 IPC31
extern volatile uint32_t   IPC31 __attribute__((section("sfrs"), address(0xBF810330)));
typedef struct {
  uint32_t AD1I18IS:2;
  uint32_t AD1I18IP:3;
  uint32_t :3;
  uint32_t AD1I19IS:2;
  uint32_t AD1I19IP:3;
  uint32_t :3;
  uint32_t AD1I20IS:2;
  uint32_t AD1I20IP:3;
  uint32_t :3;
  uint32_t AD1I21IS:2;
  uint32_t AD1I21IP:3;
} __IPC31bits_t;
extern volatile __IPC31bits_t IPC31bits __asm__ ("IPC31") __attribute__((section("sfrs"), address(0xBF810330)));
extern volatile uint32_t        IPC31CLR __attribute__((section("sfrs"),address(0xBF810334)));
extern volatile uint32_t        IPC31SET __attribute__((section("sfrs"),address(0xBF810338)));
extern volatile uint32_t        IPC31INV __attribute__((section("sfrs"),address(0xBF81033C)));
#define IPC32 IPC32
extern volatile uint32_t   IPC32 __attribute__((section("sfrs"), address(0xBF810340)));
typedef struct {
  uint32_t AD1I22IS:2;
  uint32_t AD1I22IP:3;
  uint32_t :3;
  uint32_t AD1I23IS:2;
  uint32_t AD1I23IP:3;
} __IPC32bits_t;
extern volatile __IPC32bits_t IPC32bits __asm__ ("IPC32") __attribute__((section("sfrs"), address(0xBF810340)));
extern volatile uint32_t        IPC32CLR __attribute__((section("sfrs"),address(0xBF810344)));
extern volatile uint32_t        IPC32SET __attribute__((section("sfrs"),address(0xBF810348)));
extern volatile uint32_t        IPC32INV __attribute__((section("sfrs"),address(0xBF81034C)));
#define IPC35 IPC35
extern volatile uint32_t   IPC35 __attribute__((section("sfrs"), address(0xBF810370)));
typedef struct {
  uint32_t :16;
  uint32_t CAN1IS:2;
  uint32_t CAN1IP:3;
  uint32_t :3;
  uint32_t CAN2RXIS:2;
  uint32_t CAN2RXIP:3;
} __IPC35bits_t;
extern volatile __IPC35bits_t IPC35bits __asm__ ("IPC35") __attribute__((section("sfrs"), address(0xBF810370)));
extern volatile uint32_t        IPC35CLR __attribute__((section("sfrs"),address(0xBF810374)));
extern volatile uint32_t        IPC35SET __attribute__((section("sfrs"),address(0xBF810378)));
extern volatile uint32_t        IPC35INV __attribute__((section("sfrs"),address(0xBF81037C)));
#define IPC36 IPC36
extern volatile uint32_t   IPC36 __attribute__((section("sfrs"), address(0xBF810380)));
typedef struct {
  uint32_t CAN2TXIS:2;
  uint32_t CAN2TXIP:3;
  uint32_t :3;
  uint32_t CAN2IS:2;
  uint32_t CAN2IP:3;
} __IPC36bits_t;
extern volatile __IPC36bits_t IPC36bits __asm__ ("IPC36") __attribute__((section("sfrs"), address(0xBF810380)));
extern volatile uint32_t        IPC36CLR __attribute__((section("sfrs"),address(0xBF810384)));
extern volatile uint32_t        IPC36SET __attribute__((section("sfrs"),address(0xBF810388)));
extern volatile uint32_t        IPC36INV __attribute__((section("sfrs"),address(0xBF81038C)));
#define IPC37 IPC37
extern volatile uint32_t   IPC37 __attribute__((section("sfrs"), address(0xBF810390)));
typedef struct {
  uint32_t :16;
  uint32_t SQIIS:2;
  uint32_t SQIIP:3;
} __IPC37bits_t;
extern volatile __IPC37bits_t IPC37bits __asm__ ("IPC37") __attribute__((section("sfrs"), address(0xBF810390)));
extern volatile uint32_t        IPC37CLR __attribute__((section("sfrs"),address(0xBF810394)));
extern volatile uint32_t        IPC37SET __attribute__((section("sfrs"),address(0xBF810398)));
extern volatile uint32_t        IPC37INV __attribute__((section("sfrs"),address(0xBF81039C)));
#define IPC38 IPC38
extern volatile uint32_t   IPC38 __attribute__((section("sfrs"), address(0xBF8103A0)));
typedef struct {
  uint32_t PTGSTEPIS:2;
  uint32_t PTGSTEPIP:3;
  uint32_t :3;
  uint32_t PTGWDTIS:2;
  uint32_t PTGWDTIP:3;
  uint32_t :3;
  uint32_t PTGTR0IS:2;
  uint32_t PTGTR0IP:3;
  uint32_t :3;
  uint32_t PTGTR1IS:2;
  uint32_t PTGTR1IP:3;
} __IPC38bits_t;
