Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __IPC38bits_t IPC38bits __asm__ ("IPC38") __attribute__((section("sfrs"), address(0xBF8103A0)));
extern volatile uint32_t        IPC38CLR __attribute__((section("sfrs"),address(0xBF8103A4)));
extern volatile uint32_t        IPC38SET __attribute__((section("sfrs"),address(0xBF8103A8)));
extern volatile uint32_t        IPC38INV __attribute__((section("sfrs"),address(0xBF8103AC)));
#define IPC39 IPC39
extern volatile uint32_t   IPC39 __attribute__((section("sfrs"), address(0xBF8103B0)));
typedef struct {
  uint32_t PTGTR2IS:2;
  uint32_t PTGTR2IP:3;
  uint32_t :3;
  uint32_t PTGTR3IS:2;
  uint32_t PTGTR3IP:3;
} __IPC39bits_t;
extern volatile __IPC39bits_t IPC39bits __asm__ ("IPC39") __attribute__((section("sfrs"), address(0xBF8103B0)));
extern volatile uint32_t        IPC39CLR __attribute__((section("sfrs"),address(0xBF8103B4)));
extern volatile uint32_t        IPC39SET __attribute__((section("sfrs"),address(0xBF8103B8)));
extern volatile uint32_t        IPC39INV __attribute__((section("sfrs"),address(0xBF8103BC)));
#define IPC40 IPC40
extern volatile uint32_t   IPC40 __attribute__((section("sfrs"), address(0xBF8103C0)));
typedef struct {
  uint32_t :16;
  uint32_t MPUPCIS:2;
  uint32_t MPUPCIP:3;
  uint32_t :3;
  uint32_t FDCIS:2;
  uint32_t FDCIP:3;
} __IPC40bits_t;
extern volatile __IPC40bits_t IPC40bits __asm__ ("IPC40") __attribute__((section("sfrs"), address(0xBF8103C0)));
extern volatile uint32_t        IPC40CLR __attribute__((section("sfrs"),address(0xBF8103C4)));
extern volatile uint32_t        IPC40SET __attribute__((section("sfrs"),address(0xBF8103C8)));
extern volatile uint32_t        IPC40INV __attribute__((section("sfrs"),address(0xBF8103CC)));
#define IPC41 IPC41
extern volatile uint32_t   IPC41 __attribute__((section("sfrs"), address(0xBF8103D0)));
typedef struct {
  uint32_t CRPTIS:2;
  uint32_t CRPTIP:3;
  uint32_t :3;
  uint32_t ETHIS:2;
  uint32_t ETHIP:3;
  uint32_t :3;
  uint32_t CRPT1IS:2;
  uint32_t CRPT1IP:3;
  uint32_t :3;
  uint32_t CRPT1EIS:2;
  uint32_t CRPT1EIP:3;
} __IPC41bits_t;
extern volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs"), address(0xBF8103D0)));
extern volatile uint32_t        IPC41CLR __attribute__((section("sfrs"),address(0xBF8103D4)));
extern volatile uint32_t        IPC41SET __attribute__((section("sfrs"),address(0xBF8103D8)));
extern volatile uint32_t        IPC41INV __attribute__((section("sfrs"),address(0xBF8103DC)));
#define IPC42 IPC42
extern volatile uint32_t   IPC42 __attribute__((section("sfrs"), address(0xBF8103E0)));
typedef struct {
  uint32_t CVDIS:2;
  uint32_t CVDIP:3;
} __IPC42bits_t;
extern volatile __IPC42bits_t IPC42bits __asm__ ("IPC42") __attribute__((section("sfrs"), address(0xBF8103E0)));
extern volatile uint32_t        IPC42CLR __attribute__((section("sfrs"),address(0xBF8103E4)));
extern volatile uint32_t        IPC42SET __attribute__((section("sfrs"),address(0xBF8103E8)));
extern volatile uint32_t        IPC42INV __attribute__((section("sfrs"),address(0xBF8103EC)));
#define OFF000 OFF000
extern volatile uint32_t   OFF000 __attribute__((section("sfrs"), address(0xBF810540)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF000bits_t;
extern volatile __OFF000bits_t OFF000bits __asm__ ("OFF000") __attribute__((section("sfrs"), address(0xBF810540)));
#define OFF001 OFF001
extern volatile uint32_t   OFF001 __attribute__((section("sfrs"), address(0xBF810544)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF001bits_t;
extern volatile __OFF001bits_t OFF001bits __asm__ ("OFF001") __attribute__((section("sfrs"), address(0xBF810544)));
#define OFF002 OFF002
extern volatile uint32_t   OFF002 __attribute__((section("sfrs"), address(0xBF810548)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF002bits_t;
extern volatile __OFF002bits_t OFF002bits __asm__ ("OFF002") __attribute__((section("sfrs"), address(0xBF810548)));
#define OFF003 OFF003
extern volatile uint32_t   OFF003 __attribute__((section("sfrs"), address(0xBF81054C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF003bits_t;
extern volatile __OFF003bits_t OFF003bits __asm__ ("OFF003") __attribute__((section("sfrs"), address(0xBF81054C)));
#define OFF004 OFF004
extern volatile uint32_t   OFF004 __attribute__((section("sfrs"), address(0xBF810550)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF004bits_t;
extern volatile __OFF004bits_t OFF004bits __asm__ ("OFF004") __attribute__((section("sfrs"), address(0xBF810550)));
#define OFF005 OFF005
extern volatile uint32_t   OFF005 __attribute__((section("sfrs"), address(0xBF810554)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF005bits_t;
extern volatile __OFF005bits_t OFF005bits __asm__ ("OFF005") __attribute__((section("sfrs"), address(0xBF810554)));
#define OFF006 OFF006
extern volatile uint32_t   OFF006 __attribute__((section("sfrs"), address(0xBF810558)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF006bits_t;
extern volatile __OFF006bits_t OFF006bits __asm__ ("OFF006") __attribute__((section("sfrs"), address(0xBF810558)));
#define OFF007 OFF007
extern volatile uint32_t   OFF007 __attribute__((section("sfrs"), address(0xBF81055C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF007bits_t;
extern volatile __OFF007bits_t OFF007bits __asm__ ("OFF007") __attribute__((section("sfrs"), address(0xBF81055C)));
#define OFF008 OFF008
extern volatile uint32_t   OFF008 __attribute__((section("sfrs"), address(0xBF810560)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF008bits_t;
extern volatile __OFF008bits_t OFF008bits __asm__ ("OFF008") __attribute__((section("sfrs"), address(0xBF810560)));
#define OFF009 OFF009
extern volatile uint32_t   OFF009 __attribute__((section("sfrs"), address(0xBF810564)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF009bits_t;
extern volatile __OFF009bits_t OFF009bits __asm__ ("OFF009") __attribute__((section("sfrs"), address(0xBF810564)));
#define OFF010 OFF010
extern volatile uint32_t   OFF010 __attribute__((section("sfrs"), address(0xBF810568)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF010bits_t;
extern volatile __OFF010bits_t OFF010bits __asm__ ("OFF010") __attribute__((section("sfrs"), address(0xBF810568)));
#define OFF011 OFF011
extern volatile uint32_t   OFF011 __attribute__((section("sfrs"), address(0xBF81056C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF011bits_t;
extern volatile __OFF011bits_t OFF011bits __asm__ ("OFF011") __attribute__((section("sfrs"), address(0xBF81056C)));
#define OFF012 OFF012
extern volatile uint32_t   OFF012 __attribute__((section("sfrs"), address(0xBF810570)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF012bits_t;
extern volatile __OFF012bits_t OFF012bits __asm__ ("OFF012") __attribute__((section("sfrs"), address(0xBF810570)));
#define OFF013 OFF013
extern volatile uint32_t   OFF013 __attribute__((section("sfrs"), address(0xBF810574)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF013bits_t;
extern volatile __OFF013bits_t OFF013bits __asm__ ("OFF013") __attribute__((section("sfrs"), address(0xBF810574)));
#define OFF014 OFF014
extern volatile uint32_t   OFF014 __attribute__((section("sfrs"), address(0xBF810578)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF014bits_t;
extern volatile __OFF014bits_t OFF014bits __asm__ ("OFF014") __attribute__((section("sfrs"), address(0xBF810578)));
#define OFF015 OFF015
extern volatile uint32_t   OFF015 __attribute__((section("sfrs"), address(0xBF81057C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF015bits_t;
extern volatile __OFF015bits_t OFF015bits __asm__ ("OFF015") __attribute__((section("sfrs"), address(0xBF81057C)));
#define OFF016 OFF016
extern volatile uint32_t   OFF016 __attribute__((section("sfrs"), address(0xBF810580)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF016bits_t;
