Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC") __attribute__((section("sfrs"), address(0xBF820270)));
extern volatile uint32_t        CNCONCCLR __attribute__((section("sfrs"),address(0xBF820274)));
extern volatile uint32_t        CNCONCSET __attribute__((section("sfrs"),address(0xBF820278)));
extern volatile uint32_t        CNCONCINV __attribute__((section("sfrs"),address(0xBF82027C)));
#define CNENC CNENC
extern volatile uint32_t   CNENC __attribute__((section("sfrs"), address(0xBF820280)));
typedef union {
  struct {
    uint32_t CNIEC0:1;
    uint32_t CNIEC1:1;
    uint32_t CNIEC2:1;
    uint32_t CNIEC3:1;
    uint32_t CNIEC4:1;
    uint32_t CNIEC5:1;
    uint32_t CNIEC6:1;
    uint32_t CNIEC7:1;
    uint32_t CNIEC8:1;
    uint32_t CNIEC9:1;
    uint32_t CNIEC10:1;
    uint32_t CNIEC11:1;
    uint32_t CNIEC12:1;
    uint32_t CNIEC13:1;
    uint32_t CNIEC14:1;
    uint32_t CNIEC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENCbits_t;
extern volatile __CNENCbits_t CNENCbits __asm__ ("CNENC") __attribute__((section("sfrs"), address(0xBF820280)));
extern volatile uint32_t        CNENCCLR __attribute__((section("sfrs"),address(0xBF820284)));
extern volatile uint32_t        CNENCSET __attribute__((section("sfrs"),address(0xBF820288)));
extern volatile uint32_t        CNENCINV __attribute__((section("sfrs"),address(0xBF82028C)));
#define CNSTATC CNSTATC
extern volatile uint32_t   CNSTATC __attribute__((section("sfrs"), address(0xBF820290)));
typedef union {
  struct {
    uint32_t CNSTATC0:1;
    uint32_t CNSTATC1:1;
    uint32_t CNSTATC2:1;
    uint32_t CNSTATC3:1;
    uint32_t CNSTATC4:1;
    uint32_t CNSTATC5:1;
    uint32_t CNSTATC6:1;
    uint32_t CNSTATC7:1;
    uint32_t CNSTATC8:1;
    uint32_t CNSTATC9:1;
    uint32_t CNSTATC10:1;
    uint32_t CNSTATC11:1;
    uint32_t CNSTATC12:1;
    uint32_t CNSTATC13:1;
    uint32_t CNSTATC14:1;
    uint32_t CNSTATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATCbits_t;
extern volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC") __attribute__((section("sfrs"), address(0xBF820290)));
extern volatile uint32_t        CNSTATCCLR __attribute__((section("sfrs"),address(0xBF820294)));
extern volatile uint32_t        CNSTATCSET __attribute__((section("sfrs"),address(0xBF820298)));
extern volatile uint32_t        CNSTATCINV __attribute__((section("sfrs"),address(0xBF82029C)));
#define CNNEC CNNEC
extern volatile uint32_t   CNNEC __attribute__((section("sfrs"), address(0xBF8202A0)));
typedef struct {
  uint32_t CNNEC0:1;
  uint32_t CNNEC1:1;
  uint32_t CNNEC2:1;
  uint32_t CNNEC3:1;
  uint32_t CNNEC4:1;
  uint32_t CNNEC5:1;
  uint32_t CNNEC6:1;
  uint32_t CNNEC7:1;
  uint32_t CNNEC8:1;
  uint32_t CNNEC9:1;
  uint32_t CNNEC10:1;
  uint32_t CNNEC11:1;
  uint32_t CNNEC12:1;
  uint32_t CNNEC13:1;
  uint32_t CNNEC14:1;
  uint32_t CNNEC15:1;
} __CNNECbits_t;
extern volatile __CNNECbits_t CNNECbits __asm__ ("CNNEC") __attribute__((section("sfrs"), address(0xBF8202A0)));
extern volatile uint32_t        CNNECCLR __attribute__((section("sfrs"),address(0xBF8202A4)));
extern volatile uint32_t        CNNECSET __attribute__((section("sfrs"),address(0xBF8202A8)));
extern volatile uint32_t        CNNECINV __attribute__((section("sfrs"),address(0xBF8202AC)));
#define CNFC CNFC
extern volatile uint32_t   CNFC __attribute__((section("sfrs"), address(0xBF8202B0)));
typedef struct {
  uint32_t CNFC0:1;
  uint32_t CNFC1:1;
  uint32_t CNFC2:1;
  uint32_t CNFC3:1;
  uint32_t CNFC4:1;
  uint32_t CNFC5:1;
  uint32_t CNFC6:1;
  uint32_t CNFC7:1;
  uint32_t CNFC8:1;
  uint32_t CNFC9:1;
  uint32_t CNFC10:1;
  uint32_t CNFC11:1;
  uint32_t CNFC12:1;
  uint32_t CNFC13:1;
  uint32_t CNFC14:1;
  uint32_t CNFC15:1;
} __CNFCbits_t;
extern volatile __CNFCbits_t CNFCbits __asm__ ("CNFC") __attribute__((section("sfrs"), address(0xBF8202B0)));
extern volatile uint32_t        CNFCCLR __attribute__((section("sfrs"),address(0xBF8202B4)));
extern volatile uint32_t        CNFCSET __attribute__((section("sfrs"),address(0xBF8202B8)));
extern volatile uint32_t        CNFCINV __attribute__((section("sfrs"),address(0xBF8202BC)));
#define SRCON0C SRCON0C
extern volatile uint32_t   SRCON0C __attribute__((section("sfrs"), address(0xBF8202C0)));
typedef struct {
  uint32_t SR0C0:1;
  uint32_t SR0C1:1;
  uint32_t SR0C2:1;
  uint32_t SR0C3:1;
  uint32_t SR0C4:1;
  uint32_t SR0C5:1;
  uint32_t :7;
  uint32_t SR0C13:1;
  uint32_t SR0C14:1;
  uint32_t SR0C15:1;
} __SRCON0Cbits_t;
extern volatile __SRCON0Cbits_t SRCON0Cbits __asm__ ("SRCON0C") __attribute__((section("sfrs"), address(0xBF8202C0)));
extern volatile uint32_t        SRCON0CCLR __attribute__((section("sfrs"),address(0xBF8202C4)));
extern volatile uint32_t        SRCON0CSET __attribute__((section("sfrs"),address(0xBF8202C8)));
extern volatile uint32_t        SRCON0CINV __attribute__((section("sfrs"),address(0xBF8202CC)));
#define SRCON1C SRCON1C
extern volatile uint32_t   SRCON1C __attribute__((section("sfrs"), address(0xBF8202D0)));
typedef struct {
  uint32_t SR1C0:1;
  uint32_t SR1C1:1;
  uint32_t SR1C2:1;
  uint32_t SR1C3:1;
  uint32_t SR1C4:1;
  uint32_t SR1C5:1;
  uint32_t :7;
  uint32_t SR1C13:1;
  uint32_t SR1C14:1;
  uint32_t SR1C15:1;
} __SRCON1Cbits_t;
extern volatile __SRCON1Cbits_t SRCON1Cbits __asm__ ("SRCON1C") __attribute__((section("sfrs"), address(0xBF8202D0)));
extern volatile uint32_t        SRCON1CCLR __attribute__((section("sfrs"),address(0xBF8202D4)));
extern volatile uint32_t        SRCON1CSET __attribute__((section("sfrs"),address(0xBF8202D8)));
extern volatile uint32_t        SRCON1CINV __attribute__((section("sfrs"),address(0xBF8202DC)));
#define ANSELK ANSELK
extern volatile uint32_t   ANSELK __attribute__((section("sfrs"), address(0xBF820300)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t ANSK2:1;
    uint32_t ANSK3:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELKbits_t;
extern volatile __ANSELKbits_t ANSELKbits __asm__ ("ANSELK") __attribute__((section("sfrs"), address(0xBF820300)));
extern volatile uint32_t        ANSELKCLR __attribute__((section("sfrs"),address(0xBF820304)));
extern volatile uint32_t        ANSELKSET __attribute__((section("sfrs"),address(0xBF820308)));
extern volatile uint32_t        ANSELKINV __attribute__((section("sfrs"),address(0xBF82030C)));
#define TRISK TRISK
extern volatile uint32_t   TRISK __attribute__((section("sfrs"), address(0xBF820310)));
typedef union {
  struct {
    uint32_t TRISK0:1;
    uint32_t TRISK1:1;
    uint32_t TRISK2:1;
    uint32_t TRISK3:1;
    uint32_t TRISK4:1;
    uint32_t TRISK5:1;
    uint32_t TRISK6:1;
    uint32_t TRISK7:1;
    uint32_t TRISK8:1;
    uint32_t TRISK9:1;
    uint32_t TRISK10:1;
    uint32_t TRISK11:1;
    uint32_t TRISK12:1;
    uint32_t TRISK13:1;
    uint32_t TRISK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISKbits_t;
extern volatile __TRISKbits_t TRISKbits __asm__ ("TRISK") __attribute__((section("sfrs"), address(0xBF820310)));
extern volatile uint32_t        TRISKCLR __attribute__((section("sfrs"),address(0xBF820314)));
extern volatile uint32_t        TRISKSET __attribute__((section("sfrs"),address(0xBF820318)));
extern volatile uint32_t        TRISKINV __attribute__((section("sfrs"),address(0xBF82031C)));
#define PORTK PORTK
extern volatile uint32_t   PORTK __attribute__((section("sfrs"), address(0xBF820320)));
typedef union {
  struct {
    uint32_t RK0:1;
    uint32_t RK1:1;
    uint32_t RK2:1;
    uint32_t RK3:1;
    uint32_t RK4:1;
    uint32_t RK5:1;
    uint32_t RK6:1;
    uint32_t RK7:1;
    uint32_t RK8:1;
    uint32_t RK9:1;
    uint32_t RK10:1;
    uint32_t RK11:1;
    uint32_t RK12:1;
    uint32_t RK13:1;
    uint32_t RK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTKbits_t;
extern volatile __PORTKbits_t PORTKbits __asm__ ("PORTK") __attribute__((section("sfrs"), address(0xBF820320)));
extern volatile uint32_t        PORTKCLR __attribute__((section("sfrs"),address(0xBF820324)));
extern volatile uint32_t        PORTKSET __attribute__((section("sfrs"),address(0xBF820328)));
extern volatile uint32_t        PORTKINV __attribute__((section("sfrs"),address(0xBF82032C)));
#define LATK LATK
extern volatile uint32_t   LATK __attribute__((section("sfrs"), address(0xBF820330)));
typedef union {
  struct {
    uint32_t LATK0:1;
    uint32_t LATK1:1;
    uint32_t LATK2:1;
    uint32_t LATK3:1;
    uint32_t LATK4:1;
    uint32_t LATK5:1;
    uint32_t LATK6:1;
    uint32_t LATK7:1;
    uint32_t LATK8:1;
    uint32_t LATK9:1;
    uint32_t LATK10:1;
    uint32_t LATK11:1;
    uint32_t LATK12:1;
    uint32_t LATK13:1;
    uint32_t LATK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATKbits_t;
