Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __ADCBASEbits_t ADCBASEbits __asm__ ("ADCBASE") __attribute__((section("sfrs"), address(0xBF821300)));
extern volatile uint32_t        ADCBASECLR __attribute__((section("sfrs"),address(0xBF821304)));
extern volatile uint32_t        ADCBASESET __attribute__((section("sfrs"),address(0xBF821308)));
extern volatile uint32_t        ADCBASEINV __attribute__((section("sfrs"),address(0xBF82130C)));
#define ADCDMAST ADCDMAST
extern volatile uint32_t   ADCDMAST __attribute__((section("sfrs"), address(0xBF821310)));
typedef struct {
  uint32_t RAF0:1;
  uint32_t :7;
  uint32_t RAF0IEN:1;
  uint32_t :6;
  uint32_t DMACNTEN:1;
  uint32_t RBF0:1;
  uint32_t :6;
  uint32_t WROVRERR:1;
  uint32_t RBF0IEN:1;
  uint32_t :6;
  uint32_t DMAEN:1;
} __ADCDMASTbits_t;
extern volatile __ADCDMASTbits_t ADCDMASTbits __asm__ ("ADCDMAST") __attribute__((section("sfrs"), address(0xBF821310)));
extern volatile uint32_t        ADCDMASTCLR __attribute__((section("sfrs"),address(0xBF821314)));
extern volatile uint32_t        ADCDMASTSET __attribute__((section("sfrs"),address(0xBF821318)));
extern volatile uint32_t        ADCDMASTINV __attribute__((section("sfrs"),address(0xBF82131C)));
#define ADCCNTB ADCCNTB
extern volatile uint32_t   ADCCNTB __attribute__((section("sfrs"), address(0xBF821320)));
typedef struct {
  uint32_t ADCCNTB:32;
} __ADCCNTBbits_t;
extern volatile __ADCCNTBbits_t ADCCNTBbits __asm__ ("ADCCNTB") __attribute__((section("sfrs"), address(0xBF821320)));
extern volatile uint32_t        ADCCNTBCLR __attribute__((section("sfrs"),address(0xBF821324)));
extern volatile uint32_t        ADCCNTBSET __attribute__((section("sfrs"),address(0xBF821328)));
extern volatile uint32_t        ADCCNTBINV __attribute__((section("sfrs"),address(0xBF82132C)));
#define ADCDMAB ADCDMAB
extern volatile uint32_t   ADCDMAB __attribute__((section("sfrs"), address(0xBF821330)));
typedef struct {
  uint32_t ADDMAB:32;
} __ADCDMABbits_t;
extern volatile __ADCDMABbits_t ADCDMABbits __asm__ ("ADCDMAB") __attribute__((section("sfrs"), address(0xBF821330)));
extern volatile uint32_t        ADCDMABCLR __attribute__((section("sfrs"),address(0xBF821334)));
extern volatile uint32_t        ADCDMABSET __attribute__((section("sfrs"),address(0xBF821338)));
extern volatile uint32_t        ADCDMABINV __attribute__((section("sfrs"),address(0xBF82133C)));
#define ADCTRGSNS ADCTRGSNS
extern volatile uint32_t   ADCTRGSNS __attribute__((section("sfrs"), address(0xBF821340)));
typedef struct {
  uint32_t LVL0:1;
  uint32_t LVL1:1;
  uint32_t LVL2:1;
  uint32_t LVL3:1;
  uint32_t LVL4:1;
  uint32_t LVL5:1;
  uint32_t LVL6:1;
  uint32_t LVL7:1;
} __ADCTRGSNSbits_t;
extern volatile __ADCTRGSNSbits_t ADCTRGSNSbits __asm__ ("ADCTRGSNS") __attribute__((section("sfrs"), address(0xBF821340)));
extern volatile uint32_t        ADCTRGSNSCLR __attribute__((section("sfrs"),address(0xBF821344)));
extern volatile uint32_t        ADCTRGSNSSET __attribute__((section("sfrs"),address(0xBF821348)));
extern volatile uint32_t        ADCTRGSNSINV __attribute__((section("sfrs"),address(0xBF82134C)));
#define ADC0TIME ADC0TIME
extern volatile uint32_t   ADC0TIME __attribute__((section("sfrs"), address(0xBF821350)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t BCHEN0:1;
  uint32_t SELRES:2;
} __ADC0TIMEbits_t;
extern volatile __ADC0TIMEbits_t ADC0TIMEbits __asm__ ("ADC0TIME") __attribute__((section("sfrs"), address(0xBF821350)));
extern volatile uint32_t        ADC0TIMECLR __attribute__((section("sfrs"),address(0xBF821354)));
extern volatile uint32_t        ADC0TIMESET __attribute__((section("sfrs"),address(0xBF821358)));
extern volatile uint32_t        ADC0TIMEINV __attribute__((section("sfrs"),address(0xBF82135C)));
#define ADCANCON ADCANCON
extern volatile uint32_t   ADCANCON __attribute__((section("sfrs"), address(0xBF821400)));
typedef struct {
  uint32_t ANEN0:1;
  uint32_t :6;
  uint32_t ANEN7:1;
  uint32_t WKRDY0:1;
  uint32_t :6;
  uint32_t WKRDY7:1;
  uint32_t WKIEN0:1;
  uint32_t :6;
  uint32_t WKIEN7:1;
  uint32_t WKUPCLKCNT:4;
} __ADCANCONbits_t;
extern volatile __ADCANCONbits_t ADCANCONbits __asm__ ("ADCANCON") __attribute__((section("sfrs"), address(0xBF821400)));
extern volatile uint32_t        ADCANCONCLR __attribute__((section("sfrs"),address(0xBF821404)));
extern volatile uint32_t        ADCANCONSET __attribute__((section("sfrs"),address(0xBF821408)));
extern volatile uint32_t        ADCANCONINV __attribute__((section("sfrs"),address(0xBF82140C)));
#define ADC0CFG ADC0CFG
extern volatile uint32_t   ADC0CFG __attribute__((section("sfrs"), address(0xBF821600)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC0CFGbits_t;
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF821600)));
extern volatile uint32_t        ADC0CFGCLR __attribute__((section("sfrs"),address(0xBF821604)));
extern volatile uint32_t        ADC0CFGSET __attribute__((section("sfrs"),address(0xBF821608)));
extern volatile uint32_t        ADC0CFGINV __attribute__((section("sfrs"),address(0xBF82160C)));
#define ADC7CFG ADC7CFG
extern volatile uint32_t   ADC7CFG __attribute__((section("sfrs"), address(0xBF821670)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC7CFGbits_t;
extern volatile __ADC7CFGbits_t ADC7CFGbits __asm__ ("ADC7CFG") __attribute__((section("sfrs"), address(0xBF821670)));
extern volatile uint32_t        ADC7CFGCLR __attribute__((section("sfrs"),address(0xBF821674)));
extern volatile uint32_t        ADC7CFGSET __attribute__((section("sfrs"),address(0xBF821678)));
extern volatile uint32_t        ADC7CFGINV __attribute__((section("sfrs"),address(0xBF82167C)));
#define ADCSYSCFG0 ADCSYSCFG0
extern volatile uint32_t   ADCSYSCFG0 __attribute__((section("sfrs"), address(0xBF821700)));
typedef struct {
  uint32_t AN0:1;
  uint32_t AN1:1;
  uint32_t AN2:1;
  uint32_t AN3:1;
  uint32_t AN4:1;
  uint32_t AN5:1;
  uint32_t AN6:1;
  uint32_t AN7:1;
  uint32_t AN8:1;
  uint32_t AN9:1;
  uint32_t AN10:1;
  uint32_t AN11:1;
  uint32_t AN12:1;
  uint32_t AN13:1;
  uint32_t AN14:1;
  uint32_t AN15:1;
  uint32_t AN16:1;
  uint32_t AN17:1;
  uint32_t AN18:1;
  uint32_t AN19:1;
} __ADCSYSCFG0bits_t;
extern volatile __ADCSYSCFG0bits_t ADCSYSCFG0bits __asm__ ("ADCSYSCFG0") __attribute__((section("sfrs"), address(0xBF821700)));
extern volatile uint32_t        ADCSYSCFG0CLR __attribute__((section("sfrs"),address(0xBF821704)));
extern volatile uint32_t        ADCSYSCFG0SET __attribute__((section("sfrs"),address(0xBF821708)));
extern volatile uint32_t        ADCSYSCFG0INV __attribute__((section("sfrs"),address(0xBF82170C)));
#define ADCDATA0 ADCDATA0
extern volatile uint32_t   ADCDATA0 __attribute__((section("sfrs"), address(0xBF821A00)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA0bits_t;
extern volatile __ADCDATA0bits_t ADCDATA0bits __asm__ ("ADCDATA0") __attribute__((section("sfrs"), address(0xBF821A00)));
#define ADCDATA1 ADCDATA1
extern volatile uint32_t   ADCDATA1 __attribute__((section("sfrs"), address(0xBF821A10)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA1bits_t;
