Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __C1TRECbits_t C1TRECbits __asm__ ("C1TREC") __attribute__((section("sfrs"), address(0xBF822040)));
extern volatile uint32_t        C1TRECCLR __attribute__((section("sfrs"),address(0xBF822044)));
extern volatile uint32_t        C1TRECSET __attribute__((section("sfrs"),address(0xBF822048)));
extern volatile uint32_t        C1TRECINV __attribute__((section("sfrs"),address(0xBF82204C)));
#define C1FSTAT C1FSTAT
extern volatile uint32_t   C1FSTAT __attribute__((section("sfrs"), address(0xBF822050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
    uint32_t FIFOIP16:1;
    uint32_t FIFOIP17:1;
    uint32_t FIFOIP18:1;
    uint32_t FIFOIP19:1;
    uint32_t FIFOIP20:1;
    uint32_t FIFOIP21:1;
    uint32_t FIFOIP22:1;
    uint32_t FIFOIP23:1;
    uint32_t FIFOIP24:1;
    uint32_t FIFOIP25:1;
    uint32_t FIFOIP26:1;
    uint32_t FIFOIP27:1;
    uint32_t FIFOIP28:1;
    uint32_t FIFOIP29:1;
    uint32_t FIFOIP30:1;
    uint32_t FIFOIP31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FSTATbits_t;
extern volatile __C1FSTATbits_t C1FSTATbits __asm__ ("C1FSTAT") __attribute__((section("sfrs"), address(0xBF822050)));
extern volatile uint32_t        C1FSTATCLR __attribute__((section("sfrs"),address(0xBF822054)));
extern volatile uint32_t        C1FSTATSET __attribute__((section("sfrs"),address(0xBF822058)));
extern volatile uint32_t        C1FSTATINV __attribute__((section("sfrs"),address(0xBF82205C)));
#define C1RXOVF C1RXOVF
extern volatile uint32_t   C1RXOVF __attribute__((section("sfrs"), address(0xBF822060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
    uint32_t RXOVF16:1;
    uint32_t RXOVF17:1;
    uint32_t RXOVF18:1;
    uint32_t RXOVF19:1;
    uint32_t RXOVF20:1;
    uint32_t RXOVF21:1;
    uint32_t RXOVF22:1;
    uint32_t RXOVF23:1;
    uint32_t RXOVF24:1;
    uint32_t RXOVF25:1;
    uint32_t RXOVF26:1;
    uint32_t RXOVF27:1;
    uint32_t RXOVF28:1;
    uint32_t RXOVF29:1;
    uint32_t RXOVF30:1;
    uint32_t RXOVF31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXOVFbits_t;
extern volatile __C1RXOVFbits_t C1RXOVFbits __asm__ ("C1RXOVF") __attribute__((section("sfrs"), address(0xBF822060)));
extern volatile uint32_t        C1RXOVFCLR __attribute__((section("sfrs"),address(0xBF822064)));
extern volatile uint32_t        C1RXOVFSET __attribute__((section("sfrs"),address(0xBF822068)));
extern volatile uint32_t        C1RXOVFINV __attribute__((section("sfrs"),address(0xBF82206C)));
#define C1TMR C1TMR
extern volatile uint32_t   C1TMR __attribute__((section("sfrs"), address(0xBF822070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C1TMRbits_t;
extern volatile __C1TMRbits_t C1TMRbits __asm__ ("C1TMR") __attribute__((section("sfrs"), address(0xBF822070)));
extern volatile uint32_t        C1TMRCLR __attribute__((section("sfrs"),address(0xBF822074)));
extern volatile uint32_t        C1TMRSET __attribute__((section("sfrs"),address(0xBF822078)));
extern volatile uint32_t        C1TMRINV __attribute__((section("sfrs"),address(0xBF82207C)));
#define C1RXM0 C1RXM0
extern volatile uint32_t   C1RXM0 __attribute__((section("sfrs"), address(0xBF822080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM0bits_t;
extern volatile __C1RXM0bits_t C1RXM0bits __asm__ ("C1RXM0") __attribute__((section("sfrs"), address(0xBF822080)));
extern volatile uint32_t        C1RXM0CLR __attribute__((section("sfrs"),address(0xBF822084)));
extern volatile uint32_t        C1RXM0SET __attribute__((section("sfrs"),address(0xBF822088)));
extern volatile uint32_t        C1RXM0INV __attribute__((section("sfrs"),address(0xBF82208C)));
#define C1RXM1 C1RXM1
extern volatile uint32_t   C1RXM1 __attribute__((section("sfrs"), address(0xBF822090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM1bits_t;
extern volatile __C1RXM1bits_t C1RXM1bits __asm__ ("C1RXM1") __attribute__((section("sfrs"), address(0xBF822090)));
extern volatile uint32_t        C1RXM1CLR __attribute__((section("sfrs"),address(0xBF822094)));
extern volatile uint32_t        C1RXM1SET __attribute__((section("sfrs"),address(0xBF822098)));
extern volatile uint32_t        C1RXM1INV __attribute__((section("sfrs"),address(0xBF82209C)));
#define C1RXM2 C1RXM2
extern volatile uint32_t   C1RXM2 __attribute__((section("sfrs"), address(0xBF8220A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM2bits_t;
extern volatile __C1RXM2bits_t C1RXM2bits __asm__ ("C1RXM2") __attribute__((section("sfrs"), address(0xBF8220A0)));
extern volatile uint32_t        C1RXM2CLR __attribute__((section("sfrs"),address(0xBF8220A4)));
extern volatile uint32_t        C1RXM2SET __attribute__((section("sfrs"),address(0xBF8220A8)));
extern volatile uint32_t        C1RXM2INV __attribute__((section("sfrs"),address(0xBF8220AC)));
#define C1FLTCON0 C1FLTCON0
extern volatile uint32_t   C1FLTCON0 __attribute__((section("sfrs"), address(0xBF8220C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON0bits_t;
extern volatile __C1FLTCON0bits_t C1FLTCON0bits __asm__ ("C1FLTCON0") __attribute__((section("sfrs"), address(0xBF8220C0)));
extern volatile uint32_t        C1FLTCON0CLR __attribute__((section("sfrs"),address(0xBF8220C4)));
extern volatile uint32_t        C1FLTCON0SET __attribute__((section("sfrs"),address(0xBF8220C8)));
extern volatile uint32_t        C1FLTCON0INV __attribute__((section("sfrs"),address(0xBF8220CC)));
#define C1FLTCON1 C1FLTCON1
extern volatile uint32_t   C1FLTCON1 __attribute__((section("sfrs"), address(0xBF8220D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON1bits_t;
extern volatile __C1FLTCON1bits_t C1FLTCON1bits __asm__ ("C1FLTCON1") __attribute__((section("sfrs"), address(0xBF8220D0)));
extern volatile uint32_t        C1FLTCON1CLR __attribute__((section("sfrs"),address(0xBF8220D4)));
extern volatile uint32_t        C1FLTCON1SET __attribute__((section("sfrs"),address(0xBF8220D8)));
extern volatile uint32_t        C1FLTCON1INV __attribute__((section("sfrs"),address(0xBF8220DC)));
#define C1FLTCON2 C1FLTCON2
extern volatile uint32_t   C1FLTCON2 __attribute__((section("sfrs"), address(0xBF8220E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON2bits_t;
extern volatile __C1FLTCON2bits_t C1FLTCON2bits __asm__ ("C1FLTCON2") __attribute__((section("sfrs"), address(0xBF8220E0)));
extern volatile uint32_t        C1FLTCON2CLR __attribute__((section("sfrs"),address(0xBF8220E4)));
extern volatile uint32_t        C1FLTCON2SET __attribute__((section("sfrs"),address(0xBF8220E8)));
extern volatile uint32_t        C1FLTCON2INV __attribute__((section("sfrs"),address(0xBF8220EC)));
#define C1FLTCON3 C1FLTCON3
extern volatile uint32_t   C1FLTCON3 __attribute__((section("sfrs"), address(0xBF8220F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON3bits_t;
extern volatile __C1FLTCON3bits_t C1FLTCON3bits __asm__ ("C1FLTCON3") __attribute__((section("sfrs"), address(0xBF8220F0)));
extern volatile uint32_t        C1FLTCON3CLR __attribute__((section("sfrs"),address(0xBF8220F4)));
extern volatile uint32_t        C1FLTCON3SET __attribute__((section("sfrs"),address(0xBF8220F8)));
extern volatile uint32_t        C1FLTCON3INV __attribute__((section("sfrs"),address(0xBF8220FC)));
#define C1RXF0 C1RXF0
extern volatile uint32_t   C1RXF0 __attribute__((section("sfrs"), address(0xBF822140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF0bits_t;
extern volatile __C1RXF0bits_t C1RXF0bits __asm__ ("C1RXF0") __attribute__((section("sfrs"), address(0xBF822140)));
extern volatile uint32_t        C1RXF0CLR __attribute__((section("sfrs"),address(0xBF822144)));
extern volatile uint32_t        C1RXF0SET __attribute__((section("sfrs"),address(0xBF822148)));
extern volatile uint32_t        C1RXF0INV __attribute__((section("sfrs"),address(0xBF82214C)));
#define C1RXF1 C1RXF1
extern volatile uint32_t   C1RXF1 __attribute__((section("sfrs"), address(0xBF822150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF1bits_t;
extern volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs"), address(0xBF822150)));
extern volatile uint32_t        C1RXF1CLR __attribute__((section("sfrs"),address(0xBF822154)));
extern volatile uint32_t        C1RXF1SET __attribute__((section("sfrs"),address(0xBF822158)));
extern volatile uint32_t        C1RXF1INV __attribute__((section("sfrs"),address(0xBF82215C)));
#define C1RXF2 C1RXF2
extern volatile uint32_t   C1RXF2 __attribute__((section("sfrs"), address(0xBF822160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF2bits_t;
