Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __C1FIFOCI1bits_t C1FIFOCI1bits __asm__ ("C1FIFOCI1") __attribute__((section("sfrs"), address(0xBF8223C0)));
extern volatile uint32_t        C1FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF8223C4)));
extern volatile uint32_t        C1FIFOCI1SET __attribute__((section("sfrs"),address(0xBF8223C8)));
extern volatile uint32_t        C1FIFOCI1INV __attribute__((section("sfrs"),address(0xBF8223CC)));
#define C1FIFOCON2 C1FIFOCON2
extern volatile uint32_t   C1FIFOCON2 __attribute__((section("sfrs"), address(0xBF8223D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON2bits_t;
extern volatile __C1FIFOCON2bits_t C1FIFOCON2bits __asm__ ("C1FIFOCON2") __attribute__((section("sfrs"), address(0xBF8223D0)));
extern volatile uint32_t        C1FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8223D4)));
extern volatile uint32_t        C1FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8223D8)));
extern volatile uint32_t        C1FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8223DC)));
#define C1FIFOINT2 C1FIFOINT2
extern volatile uint32_t   C1FIFOINT2 __attribute__((section("sfrs"), address(0xBF8223E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT2bits_t;
extern volatile __C1FIFOINT2bits_t C1FIFOINT2bits __asm__ ("C1FIFOINT2") __attribute__((section("sfrs"), address(0xBF8223E0)));
extern volatile uint32_t        C1FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF8223E4)));
extern volatile uint32_t        C1FIFOINT2SET __attribute__((section("sfrs"),address(0xBF8223E8)));
extern volatile uint32_t        C1FIFOINT2INV __attribute__((section("sfrs"),address(0xBF8223EC)));
#define C1FIFOUA2 C1FIFOUA2
extern volatile uint32_t   C1FIFOUA2 __attribute__((section("sfrs"), address(0xBF8223F0)));
extern volatile uint32_t        C1FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8223F4)));
extern volatile uint32_t        C1FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8223F8)));
extern volatile uint32_t        C1FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8223FC)));
#define C1FIFOCI2 C1FIFOCI2
extern volatile uint32_t   C1FIFOCI2 __attribute__((section("sfrs"), address(0xBF822400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI2bits_t;
extern volatile __C1FIFOCI2bits_t C1FIFOCI2bits __asm__ ("C1FIFOCI2") __attribute__((section("sfrs"), address(0xBF822400)));
extern volatile uint32_t        C1FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF822404)));
extern volatile uint32_t        C1FIFOCI2SET __attribute__((section("sfrs"),address(0xBF822408)));
extern volatile uint32_t        C1FIFOCI2INV __attribute__((section("sfrs"),address(0xBF82240C)));
#define C1FIFOCON3 C1FIFOCON3
extern volatile uint32_t   C1FIFOCON3 __attribute__((section("sfrs"), address(0xBF822410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON3bits_t;
extern volatile __C1FIFOCON3bits_t C1FIFOCON3bits __asm__ ("C1FIFOCON3") __attribute__((section("sfrs"), address(0xBF822410)));
extern volatile uint32_t        C1FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF822414)));
extern volatile uint32_t        C1FIFOCON3SET __attribute__((section("sfrs"),address(0xBF822418)));
extern volatile uint32_t        C1FIFOCON3INV __attribute__((section("sfrs"),address(0xBF82241C)));
#define C1FIFOINT3 C1FIFOINT3
extern volatile uint32_t   C1FIFOINT3 __attribute__((section("sfrs"), address(0xBF822420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT3bits_t;
extern volatile __C1FIFOINT3bits_t C1FIFOINT3bits __asm__ ("C1FIFOINT3") __attribute__((section("sfrs"), address(0xBF822420)));
extern volatile uint32_t        C1FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF822424)));
extern volatile uint32_t        C1FIFOINT3SET __attribute__((section("sfrs"),address(0xBF822428)));
extern volatile uint32_t        C1FIFOINT3INV __attribute__((section("sfrs"),address(0xBF82242C)));
#define C1FIFOUA3 C1FIFOUA3
extern volatile uint32_t   C1FIFOUA3 __attribute__((section("sfrs"), address(0xBF822430)));
extern volatile uint32_t        C1FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF822434)));
extern volatile uint32_t        C1FIFOUA3SET __attribute__((section("sfrs"),address(0xBF822438)));
extern volatile uint32_t        C1FIFOUA3INV __attribute__((section("sfrs"),address(0xBF82243C)));
#define C1FIFOCI3 C1FIFOCI3
extern volatile uint32_t   C1FIFOCI3 __attribute__((section("sfrs"), address(0xBF822440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI3bits_t;
