Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __C1FIFOCI5bits_t C1FIFOCI5bits __asm__ ("C1FIFOCI5") __attribute__((section("sfrs"), address(0xBF8224C0)));
extern volatile uint32_t        C1FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF8224C4)));
extern volatile uint32_t        C1FIFOCI5SET __attribute__((section("sfrs"),address(0xBF8224C8)));
extern volatile uint32_t        C1FIFOCI5INV __attribute__((section("sfrs"),address(0xBF8224CC)));
#define C1FIFOCON6 C1FIFOCON6
extern volatile uint32_t   C1FIFOCON6 __attribute__((section("sfrs"), address(0xBF8224D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON6bits_t;
extern volatile __C1FIFOCON6bits_t C1FIFOCON6bits __asm__ ("C1FIFOCON6") __attribute__((section("sfrs"), address(0xBF8224D0)));
extern volatile uint32_t        C1FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF8224D4)));
extern volatile uint32_t        C1FIFOCON6SET __attribute__((section("sfrs"),address(0xBF8224D8)));
extern volatile uint32_t        C1FIFOCON6INV __attribute__((section("sfrs"),address(0xBF8224DC)));
#define C1FIFOINT6 C1FIFOINT6
extern volatile uint32_t   C1FIFOINT6 __attribute__((section("sfrs"), address(0xBF8224E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT6bits_t;
extern volatile __C1FIFOINT6bits_t C1FIFOINT6bits __asm__ ("C1FIFOINT6") __attribute__((section("sfrs"), address(0xBF8224E0)));
extern volatile uint32_t        C1FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF8224E4)));
extern volatile uint32_t        C1FIFOINT6SET __attribute__((section("sfrs"),address(0xBF8224E8)));
extern volatile uint32_t        C1FIFOINT6INV __attribute__((section("sfrs"),address(0xBF8224EC)));
#define C1FIFOUA6 C1FIFOUA6
extern volatile uint32_t   C1FIFOUA6 __attribute__((section("sfrs"), address(0xBF8224F0)));
extern volatile uint32_t        C1FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF8224F4)));
extern volatile uint32_t        C1FIFOUA6SET __attribute__((section("sfrs"),address(0xBF8224F8)));
extern volatile uint32_t        C1FIFOUA6INV __attribute__((section("sfrs"),address(0xBF8224FC)));
#define C1FIFOCI6 C1FIFOCI6
extern volatile uint32_t   C1FIFOCI6 __attribute__((section("sfrs"), address(0xBF822500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI6bits_t;
extern volatile __C1FIFOCI6bits_t C1FIFOCI6bits __asm__ ("C1FIFOCI6") __attribute__((section("sfrs"), address(0xBF822500)));
extern volatile uint32_t        C1FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF822504)));
extern volatile uint32_t        C1FIFOCI6SET __attribute__((section("sfrs"),address(0xBF822508)));
extern volatile uint32_t        C1FIFOCI6INV __attribute__((section("sfrs"),address(0xBF82250C)));
#define C1FIFOCON7 C1FIFOCON7
extern volatile uint32_t   C1FIFOCON7 __attribute__((section("sfrs"), address(0xBF822510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON7bits_t;
extern volatile __C1FIFOCON7bits_t C1FIFOCON7bits __asm__ ("C1FIFOCON7") __attribute__((section("sfrs"), address(0xBF822510)));
extern volatile uint32_t        C1FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF822514)));
extern volatile uint32_t        C1FIFOCON7SET __attribute__((section("sfrs"),address(0xBF822518)));
extern volatile uint32_t        C1FIFOCON7INV __attribute__((section("sfrs"),address(0xBF82251C)));
#define C1FIFOINT7 C1FIFOINT7
extern volatile uint32_t   C1FIFOINT7 __attribute__((section("sfrs"), address(0xBF822520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT7bits_t;
extern volatile __C1FIFOINT7bits_t C1FIFOINT7bits __asm__ ("C1FIFOINT7") __attribute__((section("sfrs"), address(0xBF822520)));
extern volatile uint32_t        C1FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF822524)));
extern volatile uint32_t        C1FIFOINT7SET __attribute__((section("sfrs"),address(0xBF822528)));
extern volatile uint32_t        C1FIFOINT7INV __attribute__((section("sfrs"),address(0xBF82252C)));
#define C1FIFOUA7 C1FIFOUA7
extern volatile uint32_t   C1FIFOUA7 __attribute__((section("sfrs"), address(0xBF822530)));
extern volatile uint32_t        C1FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF822534)));
extern volatile uint32_t        C1FIFOUA7SET __attribute__((section("sfrs"),address(0xBF822538)));
extern volatile uint32_t        C1FIFOUA7INV __attribute__((section("sfrs"),address(0xBF82253C)));
#define C1FIFOCI7 C1FIFOCI7
extern volatile uint32_t   C1FIFOCI7 __attribute__((section("sfrs"), address(0xBF822540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI7bits_t;
extern volatile __C1FIFOCI7bits_t C1FIFOCI7bits __asm__ ("C1FIFOCI7") __attribute__((section("sfrs"), address(0xBF822540)));
extern volatile uint32_t        C1FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF822544)));
extern volatile uint32_t        C1FIFOCI7SET __attribute__((section("sfrs"),address(0xBF822548)));
extern volatile uint32_t        C1FIFOCI7INV __attribute__((section("sfrs"),address(0xBF82254C)));
#define C1FIFOCON8 C1FIFOCON8
extern volatile uint32_t   C1FIFOCON8 __attribute__((section("sfrs"), address(0xBF822550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON8bits_t;
extern volatile __C1FIFOCON8bits_t C1FIFOCON8bits __asm__ ("C1FIFOCON8") __attribute__((section("sfrs"), address(0xBF822550)));
extern volatile uint32_t        C1FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF822554)));
extern volatile uint32_t        C1FIFOCON8SET __attribute__((section("sfrs"),address(0xBF822558)));
extern volatile uint32_t        C1FIFOCON8INV __attribute__((section("sfrs"),address(0xBF82255C)));
#define C1FIFOINT8 C1FIFOINT8
extern volatile uint32_t   C1FIFOINT8 __attribute__((section("sfrs"), address(0xBF822560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT8bits_t;
