Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __CFD2FIFOUA2bits_t CFD2FIFOUA2bits __asm__ ("CFD2FIFOUA2") __attribute__((section("sfrs"), address(0xBF823070)));
#define CFD2FIFOCON3 CFD2FIFOCON3
extern volatile uint32_t   CFD2FIFOCON3 __attribute__((section("sfrs"), address(0xBF823074)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON3bits_t;
extern volatile __CFD2FIFOCON3bits_t CFD2FIFOCON3bits __asm__ ("CFD2FIFOCON3") __attribute__((section("sfrs"), address(0xBF823074)));
#define CFD2FIFOSTA3 CFD2FIFOSTA3
extern volatile uint32_t   CFD2FIFOSTA3 __attribute__((section("sfrs"), address(0xBF823078)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA3bits_t;
extern volatile __CFD2FIFOSTA3bits_t CFD2FIFOSTA3bits __asm__ ("CFD2FIFOSTA3") __attribute__((section("sfrs"), address(0xBF823078)));
#define CFD2FIFOUA3 CFD2FIFOUA3
extern volatile uint32_t   CFD2FIFOUA3 __attribute__((section("sfrs"), address(0xBF82307C)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA3bits_t;
extern volatile __CFD2FIFOUA3bits_t CFD2FIFOUA3bits __asm__ ("CFD2FIFOUA3") __attribute__((section("sfrs"), address(0xBF82307C)));
#define CFD2FIFOCON4 CFD2FIFOCON4
extern volatile uint32_t   CFD2FIFOCON4 __attribute__((section("sfrs"), address(0xBF823080)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON4bits_t;
extern volatile __CFD2FIFOCON4bits_t CFD2FIFOCON4bits __asm__ ("CFD2FIFOCON4") __attribute__((section("sfrs"), address(0xBF823080)));
#define CFD2FIFOSTA4 CFD2FIFOSTA4
extern volatile uint32_t   CFD2FIFOSTA4 __attribute__((section("sfrs"), address(0xBF823084)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA4bits_t;
extern volatile __CFD2FIFOSTA4bits_t CFD2FIFOSTA4bits __asm__ ("CFD2FIFOSTA4") __attribute__((section("sfrs"), address(0xBF823084)));
#define CFD2FIFOUA4 CFD2FIFOUA4
extern volatile uint32_t   CFD2FIFOUA4 __attribute__((section("sfrs"), address(0xBF823088)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA4bits_t;
extern volatile __CFD2FIFOUA4bits_t CFD2FIFOUA4bits __asm__ ("CFD2FIFOUA4") __attribute__((section("sfrs"), address(0xBF823088)));
#define CFD2FIFOCON5 CFD2FIFOCON5
extern volatile uint32_t   CFD2FIFOCON5 __attribute__((section("sfrs"), address(0xBF82308C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON5bits_t;
extern volatile __CFD2FIFOCON5bits_t CFD2FIFOCON5bits __asm__ ("CFD2FIFOCON5") __attribute__((section("sfrs"), address(0xBF82308C)));
#define CFD2FIFOSTA5 CFD2FIFOSTA5
extern volatile uint32_t   CFD2FIFOSTA5 __attribute__((section("sfrs"), address(0xBF823090)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA5bits_t;
extern volatile __CFD2FIFOSTA5bits_t CFD2FIFOSTA5bits __asm__ ("CFD2FIFOSTA5") __attribute__((section("sfrs"), address(0xBF823090)));
#define CFD2FIFOUA5 CFD2FIFOUA5
extern volatile uint32_t   CFD2FIFOUA5 __attribute__((section("sfrs"), address(0xBF823094)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA5bits_t;
extern volatile __CFD2FIFOUA5bits_t CFD2FIFOUA5bits __asm__ ("CFD2FIFOUA5") __attribute__((section("sfrs"), address(0xBF823094)));
#define CFD2FIFOCON6 CFD2FIFOCON6
extern volatile uint32_t   CFD2FIFOCON6 __attribute__((section("sfrs"), address(0xBF823098)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON6bits_t;
extern volatile __CFD2FIFOCON6bits_t CFD2FIFOCON6bits __asm__ ("CFD2FIFOCON6") __attribute__((section("sfrs"), address(0xBF823098)));
#define CFD2FIFOSTA6 CFD2FIFOSTA6
extern volatile uint32_t   CFD2FIFOSTA6 __attribute__((section("sfrs"), address(0xBF82309C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA6bits_t;
extern volatile __CFD2FIFOSTA6bits_t CFD2FIFOSTA6bits __asm__ ("CFD2FIFOSTA6") __attribute__((section("sfrs"), address(0xBF82309C)));
#define CFD2FIFOUA6 CFD2FIFOUA6
extern volatile uint32_t   CFD2FIFOUA6 __attribute__((section("sfrs"), address(0xBF8230A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA6bits_t;
extern volatile __CFD2FIFOUA6bits_t CFD2FIFOUA6bits __asm__ ("CFD2FIFOUA6") __attribute__((section("sfrs"), address(0xBF8230A0)));
#define CFD2FIFOCON7 CFD2FIFOCON7
extern volatile uint32_t   CFD2FIFOCON7 __attribute__((section("sfrs"), address(0xBF8230A4)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON7bits_t;
