Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __U2BRGbits_t U2BRGbits __asm__ ("U2BRG") __attribute__((section("sfrs"), address(0xBF840840)));
extern volatile uint32_t        U2BRGCLR __attribute__((section("sfrs"),address(0xBF840844)));
extern volatile uint32_t        U2BRGSET __attribute__((section("sfrs"),address(0xBF840848)));
extern volatile uint32_t        U2BRGINV __attribute__((section("sfrs"),address(0xBF84084C)));
#define SPI1CON SPI1CON
extern volatile uint32_t   SPI1CON __attribute__((section("sfrs"), address(0xBF840C00)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1CONbits_t;
extern volatile __SPI1CONbits_t SPI1CONbits __asm__ ("SPI1CON") __attribute__((section("sfrs"), address(0xBF840C00)));
extern volatile uint32_t        SPI1CONCLR __attribute__((section("sfrs"),address(0xBF840C04)));
extern volatile uint32_t        SPI1CONSET __attribute__((section("sfrs"),address(0xBF840C08)));
extern volatile uint32_t        SPI1CONINV __attribute__((section("sfrs"),address(0xBF840C0C)));
#define SPI1STAT SPI1STAT
extern volatile uint32_t   SPI1STAT __attribute__((section("sfrs"), address(0xBF840C10)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1STATbits_t;
extern volatile __SPI1STATbits_t SPI1STATbits __asm__ ("SPI1STAT") __attribute__((section("sfrs"), address(0xBF840C10)));
extern volatile uint32_t        SPI1STATCLR __attribute__((section("sfrs"),address(0xBF840C14)));
extern volatile uint32_t        SPI1STATSET __attribute__((section("sfrs"),address(0xBF840C18)));
extern volatile uint32_t        SPI1STATINV __attribute__((section("sfrs"),address(0xBF840C1C)));
#define SPI1BUF SPI1BUF
extern volatile uint32_t   SPI1BUF __attribute__((section("sfrs"), address(0xBF840C20)));
#define SPI1BRG SPI1BRG
extern volatile uint32_t   SPI1BRG __attribute__((section("sfrs"), address(0xBF840C30)));
extern volatile uint32_t        SPI1BRGCLR __attribute__((section("sfrs"),address(0xBF840C34)));
extern volatile uint32_t        SPI1BRGSET __attribute__((section("sfrs"),address(0xBF840C38)));
extern volatile uint32_t        SPI1BRGINV __attribute__((section("sfrs"),address(0xBF840C3C)));
#define SPI1CON2 SPI1CON2
extern volatile uint32_t   SPI1CON2 __attribute__((section("sfrs"), address(0xBF840C40)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1CON2bits_t;
extern volatile __SPI1CON2bits_t SPI1CON2bits __asm__ ("SPI1CON2") __attribute__((section("sfrs"), address(0xBF840C40)));
extern volatile uint32_t        SPI1CON2CLR __attribute__((section("sfrs"),address(0xBF840C44)));
extern volatile uint32_t        SPI1CON2SET __attribute__((section("sfrs"),address(0xBF840C48)));
extern volatile uint32_t        SPI1CON2INV __attribute__((section("sfrs"),address(0xBF840C4C)));
#define SPI2CON SPI2CON
extern volatile uint32_t   SPI2CON __attribute__((section("sfrs"), address(0xBF840E00)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2CONbits_t;
extern volatile __SPI2CONbits_t SPI2CONbits __asm__ ("SPI2CON") __attribute__((section("sfrs"), address(0xBF840E00)));
extern volatile uint32_t        SPI2CONCLR __attribute__((section("sfrs"),address(0xBF840E04)));
extern volatile uint32_t        SPI2CONSET __attribute__((section("sfrs"),address(0xBF840E08)));
extern volatile uint32_t        SPI2CONINV __attribute__((section("sfrs"),address(0xBF840E0C)));
#define SPI2STAT SPI2STAT
extern volatile uint32_t   SPI2STAT __attribute__((section("sfrs"), address(0xBF840E10)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2STATbits_t;
extern volatile __SPI2STATbits_t SPI2STATbits __asm__ ("SPI2STAT") __attribute__((section("sfrs"), address(0xBF840E10)));
extern volatile uint32_t        SPI2STATCLR __attribute__((section("sfrs"),address(0xBF840E14)));
extern volatile uint32_t        SPI2STATSET __attribute__((section("sfrs"),address(0xBF840E18)));
extern volatile uint32_t        SPI2STATINV __attribute__((section("sfrs"),address(0xBF840E1C)));
#define SPI2BUF SPI2BUF
extern volatile uint32_t   SPI2BUF __attribute__((section("sfrs"), address(0xBF840E20)));
#define SPI2BRG SPI2BRG
extern volatile uint32_t   SPI2BRG __attribute__((section("sfrs"), address(0xBF840E30)));
extern volatile uint32_t        SPI2BRGCLR __attribute__((section("sfrs"),address(0xBF840E34)));
extern volatile uint32_t        SPI2BRGSET __attribute__((section("sfrs"),address(0xBF840E38)));
extern volatile uint32_t        SPI2BRGINV __attribute__((section("sfrs"),address(0xBF840E3C)));
#define SPI2CON2 SPI2CON2
extern volatile uint32_t   SPI2CON2 __attribute__((section("sfrs"), address(0xBF840E40)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2CON2bits_t;
extern volatile __SPI2CON2bits_t SPI2CON2bits __asm__ ("SPI2CON2") __attribute__((section("sfrs"), address(0xBF840E40)));
extern volatile uint32_t        SPI2CON2CLR __attribute__((section("sfrs"),address(0xBF840E44)));
extern volatile uint32_t        SPI2CON2SET __attribute__((section("sfrs"),address(0xBF840E48)));
extern volatile uint32_t        SPI2CON2INV __attribute__((section("sfrs"),address(0xBF840E4C)));
#define IC1CON IC1CON
extern volatile uint32_t   IC1CON __attribute__((section("sfrs"), address(0xBF841000)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC1CONbits_t;
extern volatile __IC1CONbits_t IC1CONbits __asm__ ("IC1CON") __attribute__((section("sfrs"), address(0xBF841000)));
extern volatile uint32_t        IC1CONCLR __attribute__((section("sfrs"),address(0xBF841004)));
extern volatile uint32_t        IC1CONSET __attribute__((section("sfrs"),address(0xBF841008)));
extern volatile uint32_t        IC1CONINV __attribute__((section("sfrs"),address(0xBF84100C)));
#define IC1BUF IC1BUF
extern volatile uint32_t   IC1BUF __attribute__((section("sfrs"), address(0xBF841010)));
#define IC2CON IC2CON
extern volatile uint32_t   IC2CON __attribute__((section("sfrs"), address(0xBF841200)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC2CONbits_t;
extern volatile __IC2CONbits_t IC2CONbits __asm__ ("IC2CON") __attribute__((section("sfrs"), address(0xBF841200)));
extern volatile uint32_t        IC2CONCLR __attribute__((section("sfrs"),address(0xBF841204)));
extern volatile uint32_t        IC2CONSET __attribute__((section("sfrs"),address(0xBF841208)));
extern volatile uint32_t        IC2CONINV __attribute__((section("sfrs"),address(0xBF84120C)));
#define IC2BUF IC2BUF
extern volatile uint32_t   IC2BUF __attribute__((section("sfrs"), address(0xBF841210)));
#define IC3CON IC3CON
extern volatile uint32_t   IC3CON __attribute__((section("sfrs"), address(0xBF841400)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC3CONbits_t;
extern volatile __IC3CONbits_t IC3CONbits __asm__ ("IC3CON") __attribute__((section("sfrs"), address(0xBF841400)));
extern volatile uint32_t        IC3CONCLR __attribute__((section("sfrs"),address(0xBF841404)));
extern volatile uint32_t        IC3CONSET __attribute__((section("sfrs"),address(0xBF841408)));
extern volatile uint32_t        IC3CONINV __attribute__((section("sfrs"),address(0xBF84140C)));
#define IC3BUF IC3BUF
extern volatile uint32_t   IC3BUF __attribute__((section("sfrs"), address(0xBF841410)));
#define IC4CON IC4CON
extern volatile uint32_t   IC4CON __attribute__((section("sfrs"), address(0xBF841600)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC4CONbits_t;
extern volatile __IC4CONbits_t IC4CONbits __asm__ ("IC4CON") __attribute__((section("sfrs"), address(0xBF841600)));
extern volatile uint32_t        IC4CONCLR __attribute__((section("sfrs"),address(0xBF841604)));
extern volatile uint32_t        IC4CONSET __attribute__((section("sfrs"),address(0xBF841608)));
extern volatile uint32_t        IC4CONINV __attribute__((section("sfrs"),address(0xBF84160C)));
#define IC4BUF IC4BUF
extern volatile uint32_t   IC4BUF __attribute__((section("sfrs"), address(0xBF841610)));
#define OC1CON OC1CON
extern volatile uint32_t   OC1CON __attribute__((section("sfrs"), address(0xBF842000)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC1CONbits_t;
extern volatile __OC1CONbits_t OC1CONbits __asm__ ("OC1CON") __attribute__((section("sfrs"), address(0xBF842000)));
extern volatile uint32_t        OC1CONCLR __attribute__((section("sfrs"),address(0xBF842004)));
extern volatile uint32_t        OC1CONSET __attribute__((section("sfrs"),address(0xBF842008)));
extern volatile uint32_t        OC1CONINV __attribute__((section("sfrs"),address(0xBF84200C)));
#define OC1R OC1R
extern volatile uint32_t   OC1R __attribute__((section("sfrs"), address(0xBF842010)));
extern volatile uint32_t        OC1RCLR __attribute__((section("sfrs"),address(0xBF842014)));
extern volatile uint32_t        OC1RSET __attribute__((section("sfrs"),address(0xBF842018)));
extern volatile uint32_t        OC1RINV __attribute__((section("sfrs"),address(0xBF84201C)));
#define OC1RS OC1RS
extern volatile uint32_t   OC1RS __attribute__((section("sfrs"), address(0xBF842020)));
extern volatile uint32_t        OC1RSCLR __attribute__((section("sfrs"),address(0xBF842024)));
extern volatile uint32_t        OC1RSSET __attribute__((section("sfrs"),address(0xBF842028)));
extern volatile uint32_t        OC1RSINV __attribute__((section("sfrs"),address(0xBF84202C)));
#define OC2CON OC2CON
extern volatile uint32_t   OC2CON __attribute__((section("sfrs"), address(0xBF842200)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC2CONbits_t;
extern volatile __OC2CONbits_t OC2CONbits __asm__ ("OC2CON") __attribute__((section("sfrs"), address(0xBF842200)));
extern volatile uint32_t        OC2CONCLR __attribute__((section("sfrs"),address(0xBF842204)));
extern volatile uint32_t        OC2CONSET __attribute__((section("sfrs"),address(0xBF842208)));
extern volatile uint32_t        OC2CONINV __attribute__((section("sfrs"),address(0xBF84220C)));
#define OC2R OC2R
extern volatile uint32_t   OC2R __attribute__((section("sfrs"), address(0xBF842210)));
extern volatile uint32_t        OC2RCLR __attribute__((section("sfrs"),address(0xBF842214)));
extern volatile uint32_t        OC2RSET __attribute__((section("sfrs"),address(0xBF842218)));
extern volatile uint32_t        OC2RINV __attribute__((section("sfrs"),address(0xBF84221C)));
#define OC2RS OC2RS
extern volatile uint32_t   OC2RS __attribute__((section("sfrs"), address(0xBF842220)));
extern volatile uint32_t        OC2RSCLR __attribute__((section("sfrs"),address(0xBF842224)));
extern volatile uint32_t        OC2RSSET __attribute__((section("sfrs"),address(0xBF842228)));
extern volatile uint32_t        OC2RSINV __attribute__((section("sfrs"),address(0xBF84222C)));
#define OC3CON OC3CON
extern volatile uint32_t   OC3CON __attribute__((section("sfrs"), address(0xBF842400)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC3CONbits_t;
extern volatile __OC3CONbits_t OC3CONbits __asm__ ("OC3CON") __attribute__((section("sfrs"), address(0xBF842400)));
extern volatile uint32_t        OC3CONCLR __attribute__((section("sfrs"),address(0xBF842404)));
extern volatile uint32_t        OC3CONSET __attribute__((section("sfrs"),address(0xBF842408)));
extern volatile uint32_t        OC3CONINV __attribute__((section("sfrs"),address(0xBF84240C)));
#define OC3R OC3R
extern volatile uint32_t   OC3R __attribute__((section("sfrs"), address(0xBF842410)));
extern volatile uint32_t        OC3RCLR __attribute__((section("sfrs"),address(0xBF842414)));
extern volatile uint32_t        OC3RSET __attribute__((section("sfrs"),address(0xBF842418)));
extern volatile uint32_t        OC3RINV __attribute__((section("sfrs"),address(0xBF84241C)));
#define OC3RS OC3RS
extern volatile uint32_t   OC3RS __attribute__((section("sfrs"), address(0xBF842420)));
extern volatile uint32_t        OC3RSCLR __attribute__((section("sfrs"),address(0xBF842424)));
extern volatile uint32_t        OC3RSSET __attribute__((section("sfrs"),address(0xBF842428)));
extern volatile uint32_t        OC3RSINV __attribute__((section("sfrs"),address(0xBF84242C)));
#define OC4CON OC4CON
extern volatile uint32_t   OC4CON __attribute__((section("sfrs"), address(0xBF842600)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC4CONbits_t;
extern volatile __OC4CONbits_t OC4CONbits __asm__ ("OC4CON") __attribute__((section("sfrs"), address(0xBF842600)));
extern volatile uint32_t        OC4CONCLR __attribute__((section("sfrs"),address(0xBF842604)));
extern volatile uint32_t        OC4CONSET __attribute__((section("sfrs"),address(0xBF842608)));
extern volatile uint32_t        OC4CONINV __attribute__((section("sfrs"),address(0xBF84260C)));
#define OC4R OC4R
extern volatile uint32_t   OC4R __attribute__((section("sfrs"), address(0xBF842610)));
extern volatile uint32_t        OC4RCLR __attribute__((section("sfrs"),address(0xBF842614)));
extern volatile uint32_t        OC4RSET __attribute__((section("sfrs"),address(0xBF842618)));
extern volatile uint32_t        OC4RINV __attribute__((section("sfrs"),address(0xBF84261C)));
#define OC4RS OC4RS
extern volatile uint32_t   OC4RS __attribute__((section("sfrs"), address(0xBF842620)));
extern volatile uint32_t        OC4RSCLR __attribute__((section("sfrs"),address(0xBF842624)));
extern volatile uint32_t        OC4RSSET __attribute__((section("sfrs"),address(0xBF842628)));
extern volatile uint32_t        OC4RSINV __attribute__((section("sfrs"),address(0xBF84262C)));
#define ETHCON1 ETHCON1
extern volatile uint32_t   ETHCON1 __attribute__((section("sfrs"), address(0xBF843000)));
typedef union {
  struct {
    uint32_t BUFCDEC:1;
    uint32_t :3;
    uint32_t MANFC:1;
    uint32_t :2;
    uint32_t AUTOFC:1;
    uint32_t RXEN:1;
    uint32_t TXRTS:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t PTV:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON1bits_t;
