Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __EMACxSUPPbits_t EMACxSUPPbits __asm__ ("EMACxSUPP") __attribute__((section("sfrs"), address(0xBF843260)));
extern volatile uint32_t        EMAC1SUPPCLR __attribute__((section("sfrs"),address(0xBF843264)));
extern volatile uint32_t        EMACxSUPPCLR __attribute__((section("sfrs"),address(0xBF843264)));
extern volatile uint32_t        EMAC1SUPPSET __attribute__((section("sfrs"),address(0xBF843268)));
extern volatile uint32_t        EMACxSUPPSET __attribute__((section("sfrs"),address(0xBF843268)));
extern volatile uint32_t        EMAC1SUPPINV __attribute__((section("sfrs"),address(0xBF84326C)));
extern volatile uint32_t        EMACxSUPPINV __attribute__((section("sfrs"),address(0xBF84326C)));
#define EMAC1TEST EMAC1TEST
extern volatile uint32_t   EMAC1TEST __attribute__((section("sfrs"), address(0xBF843270)));
typedef union {
  struct {
    uint32_t SHRTQNTA:1;
    uint32_t TESTPAUSE:1;
    uint32_t TESTBP:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1TESTbits_t;
extern volatile __EMAC1TESTbits_t EMAC1TESTbits __asm__ ("EMAC1TEST") __attribute__((section("sfrs"), address(0xBF843270)));
#define EMACxTEST EMACxTEST
extern volatile uint32_t   EMACxTEST __attribute__((section("sfrs"), address(0xBF843270)));
typedef union {
  struct {
    uint32_t SHRTQNTA:1;
    uint32_t TESTPAUSE:1;
    uint32_t TESTBP:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxTESTbits_t;
extern volatile __EMACxTESTbits_t EMACxTESTbits __asm__ ("EMACxTEST") __attribute__((section("sfrs"), address(0xBF843270)));
extern volatile uint32_t        EMAC1TESTCLR __attribute__((section("sfrs"),address(0xBF843274)));
extern volatile uint32_t        EMACxTESTCLR __attribute__((section("sfrs"),address(0xBF843274)));
extern volatile uint32_t        EMAC1TESTSET __attribute__((section("sfrs"),address(0xBF843278)));
extern volatile uint32_t        EMACxTESTSET __attribute__((section("sfrs"),address(0xBF843278)));
extern volatile uint32_t        EMAC1TESTINV __attribute__((section("sfrs"),address(0xBF84327C)));
extern volatile uint32_t        EMACxTESTINV __attribute__((section("sfrs"),address(0xBF84327C)));
#define EMAC1MCFG EMAC1MCFG
extern volatile uint32_t   EMAC1MCFG __attribute__((section("sfrs"), address(0xBF843280)));
typedef union {
  struct {
    uint32_t SCANINC:1;
    uint32_t NOPRE:1;
    uint32_t CLKSEL:4;
    uint32_t :9;
    uint32_t RESETMGMT:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MCFGbits_t;
extern volatile __EMAC1MCFGbits_t EMAC1MCFGbits __asm__ ("EMAC1MCFG") __attribute__((section("sfrs"), address(0xBF843280)));
#define EMACxMCFG EMACxMCFG
extern volatile uint32_t   EMACxMCFG __attribute__((section("sfrs"), address(0xBF843280)));
typedef union {
  struct {
    uint32_t SCANINC:1;
    uint32_t NOPRE:1;
    uint32_t CLKSEL:4;
    uint32_t :9;
    uint32_t RESETMGMT:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMCFGbits_t;
extern volatile __EMACxMCFGbits_t EMACxMCFGbits __asm__ ("EMACxMCFG") __attribute__((section("sfrs"), address(0xBF843280)));
extern volatile uint32_t        EMAC1MCFGCLR __attribute__((section("sfrs"),address(0xBF843284)));
extern volatile uint32_t        EMACxMCFGCLR __attribute__((section("sfrs"),address(0xBF843284)));
extern volatile uint32_t        EMAC1MCFGSET __attribute__((section("sfrs"),address(0xBF843288)));
extern volatile uint32_t        EMACxMCFGSET __attribute__((section("sfrs"),address(0xBF843288)));
extern volatile uint32_t        EMAC1MCFGINV __attribute__((section("sfrs"),address(0xBF84328C)));
extern volatile uint32_t        EMACxMCFGINV __attribute__((section("sfrs"),address(0xBF84328C)));
#define EMAC1MCMD EMAC1MCMD
extern volatile uint32_t   EMAC1MCMD __attribute__((section("sfrs"), address(0xBF843290)));
typedef union {
  struct {
    uint32_t READ:1;
    uint32_t SCAN:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MCMDbits_t;
extern volatile __EMAC1MCMDbits_t EMAC1MCMDbits __asm__ ("EMAC1MCMD") __attribute__((section("sfrs"), address(0xBF843290)));
#define EMACxMCMD EMACxMCMD
extern volatile uint32_t   EMACxMCMD __attribute__((section("sfrs"), address(0xBF843290)));
typedef union {
  struct {
    uint32_t READ:1;
    uint32_t SCAN:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMCMDbits_t;
extern volatile __EMACxMCMDbits_t EMACxMCMDbits __asm__ ("EMACxMCMD") __attribute__((section("sfrs"), address(0xBF843290)));
extern volatile uint32_t        EMAC1MCMDCLR __attribute__((section("sfrs"),address(0xBF843294)));
extern volatile uint32_t        EMACxMCMDCLR __attribute__((section("sfrs"),address(0xBF843294)));
extern volatile uint32_t        EMAC1MCMDSET __attribute__((section("sfrs"),address(0xBF843298)));
extern volatile uint32_t        EMACxMCMDSET __attribute__((section("sfrs"),address(0xBF843298)));
extern volatile uint32_t        EMAC1MCMDINV __attribute__((section("sfrs"),address(0xBF84329C)));
extern volatile uint32_t        EMACxMCMDINV __attribute__((section("sfrs"),address(0xBF84329C)));
#define EMAC1MADR EMAC1MADR
extern volatile uint32_t   EMAC1MADR __attribute__((section("sfrs"), address(0xBF8432A0)));
typedef union {
  struct {
    uint32_t REGADDR:5;
    uint32_t :3;
    uint32_t PHYADDR:5;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MADRbits_t;
extern volatile __EMAC1MADRbits_t EMAC1MADRbits __asm__ ("EMAC1MADR") __attribute__((section("sfrs"), address(0xBF8432A0)));
#define EMACxMADR EMACxMADR
extern volatile uint32_t   EMACxMADR __attribute__((section("sfrs"), address(0xBF8432A0)));
typedef union {
  struct {
    uint32_t REGADDR:5;
    uint32_t :3;
    uint32_t PHYADDR:5;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMADRbits_t;
extern volatile __EMACxMADRbits_t EMACxMADRbits __asm__ ("EMACxMADR") __attribute__((section("sfrs"), address(0xBF8432A0)));
extern volatile uint32_t        EMAC1MADRCLR __attribute__((section("sfrs"),address(0xBF8432A4)));
extern volatile uint32_t        EMACxMADRCLR __attribute__((section("sfrs"),address(0xBF8432A4)));
extern volatile uint32_t        EMAC1MADRSET __attribute__((section("sfrs"),address(0xBF8432A8)));
extern volatile uint32_t        EMACxMADRSET __attribute__((section("sfrs"),address(0xBF8432A8)));
extern volatile uint32_t        EMAC1MADRINV __attribute__((section("sfrs"),address(0xBF8432AC)));
extern volatile uint32_t        EMACxMADRINV __attribute__((section("sfrs"),address(0xBF8432AC)));
#define EMAC1MWTD EMAC1MWTD
extern volatile uint32_t   EMAC1MWTD __attribute__((section("sfrs"), address(0xBF8432B0)));
typedef union {
  struct {
    uint32_t MWTD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MWTDbits_t;
