Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __U1EP0bits_t U1EP0bits __asm__ ("U1EP0") __attribute__((section("sfrs"), address(0xBF844300)));
extern volatile uint32_t        U1EP0CLR __attribute__((section("sfrs"),address(0xBF844304)));
extern volatile uint32_t        U1EP0SET __attribute__((section("sfrs"),address(0xBF844308)));
extern volatile uint32_t        U1EP0INV __attribute__((section("sfrs"),address(0xBF84430C)));
#define U1EP1 U1EP1
extern volatile uint32_t   U1EP1 __attribute__((section("sfrs"), address(0xBF844310)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP1bits_t;
extern volatile __U1EP1bits_t U1EP1bits __asm__ ("U1EP1") __attribute__((section("sfrs"), address(0xBF844310)));
extern volatile uint32_t        U1EP1CLR __attribute__((section("sfrs"),address(0xBF844314)));
extern volatile uint32_t        U1EP1SET __attribute__((section("sfrs"),address(0xBF844318)));
extern volatile uint32_t        U1EP1INV __attribute__((section("sfrs"),address(0xBF84431C)));
#define U1EP2 U1EP2
extern volatile uint32_t   U1EP2 __attribute__((section("sfrs"), address(0xBF844320)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP2bits_t;
extern volatile __U1EP2bits_t U1EP2bits __asm__ ("U1EP2") __attribute__((section("sfrs"), address(0xBF844320)));
extern volatile uint32_t        U1EP2CLR __attribute__((section("sfrs"),address(0xBF844324)));
extern volatile uint32_t        U1EP2SET __attribute__((section("sfrs"),address(0xBF844328)));
extern volatile uint32_t        U1EP2INV __attribute__((section("sfrs"),address(0xBF84432C)));
#define U1EP3 U1EP3
extern volatile uint32_t   U1EP3 __attribute__((section("sfrs"), address(0xBF844330)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP3bits_t;
extern volatile __U1EP3bits_t U1EP3bits __asm__ ("U1EP3") __attribute__((section("sfrs"), address(0xBF844330)));
extern volatile uint32_t        U1EP3CLR __attribute__((section("sfrs"),address(0xBF844334)));
extern volatile uint32_t        U1EP3SET __attribute__((section("sfrs"),address(0xBF844338)));
extern volatile uint32_t        U1EP3INV __attribute__((section("sfrs"),address(0xBF84433C)));
#define U1EP4 U1EP4
extern volatile uint32_t   U1EP4 __attribute__((section("sfrs"), address(0xBF844340)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP4bits_t;
extern volatile __U1EP4bits_t U1EP4bits __asm__ ("U1EP4") __attribute__((section("sfrs"), address(0xBF844340)));
extern volatile uint32_t        U1EP4CLR __attribute__((section("sfrs"),address(0xBF844344)));
extern volatile uint32_t        U1EP4SET __attribute__((section("sfrs"),address(0xBF844348)));
extern volatile uint32_t        U1EP4INV __attribute__((section("sfrs"),address(0xBF84434C)));
#define U1EP5 U1EP5
extern volatile uint32_t   U1EP5 __attribute__((section("sfrs"), address(0xBF844350)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP5bits_t;
extern volatile __U1EP5bits_t U1EP5bits __asm__ ("U1EP5") __attribute__((section("sfrs"), address(0xBF844350)));
extern volatile uint32_t        U1EP5CLR __attribute__((section("sfrs"),address(0xBF844354)));
extern volatile uint32_t        U1EP5SET __attribute__((section("sfrs"),address(0xBF844358)));
extern volatile uint32_t        U1EP5INV __attribute__((section("sfrs"),address(0xBF84435C)));
#define U1EP6 U1EP6
extern volatile uint32_t   U1EP6 __attribute__((section("sfrs"), address(0xBF844360)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP6bits_t;
extern volatile __U1EP6bits_t U1EP6bits __asm__ ("U1EP6") __attribute__((section("sfrs"), address(0xBF844360)));
extern volatile uint32_t        U1EP6CLR __attribute__((section("sfrs"),address(0xBF844364)));
extern volatile uint32_t        U1EP6SET __attribute__((section("sfrs"),address(0xBF844368)));
extern volatile uint32_t        U1EP6INV __attribute__((section("sfrs"),address(0xBF84436C)));
#define U1EP7 U1EP7
extern volatile uint32_t   U1EP7 __attribute__((section("sfrs"), address(0xBF844370)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP7bits_t;
extern volatile __U1EP7bits_t U1EP7bits __asm__ ("U1EP7") __attribute__((section("sfrs"), address(0xBF844370)));
extern volatile uint32_t        U1EP7CLR __attribute__((section("sfrs"),address(0xBF844374)));
extern volatile uint32_t        U1EP7SET __attribute__((section("sfrs"),address(0xBF844378)));
extern volatile uint32_t        U1EP7INV __attribute__((section("sfrs"),address(0xBF84437C)));
#define U1EP8 U1EP8
extern volatile uint32_t   U1EP8 __attribute__((section("sfrs"), address(0xBF844380)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP8bits_t;
extern volatile __U1EP8bits_t U1EP8bits __asm__ ("U1EP8") __attribute__((section("sfrs"), address(0xBF844380)));
extern volatile uint32_t        U1EP8CLR __attribute__((section("sfrs"),address(0xBF844384)));
extern volatile uint32_t        U1EP8SET __attribute__((section("sfrs"),address(0xBF844388)));
extern volatile uint32_t        U1EP8INV __attribute__((section("sfrs"),address(0xBF84438C)));
#define U1EP9 U1EP9
extern volatile uint32_t   U1EP9 __attribute__((section("sfrs"), address(0xBF844390)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP9bits_t;
extern volatile __U1EP9bits_t U1EP9bits __asm__ ("U1EP9") __attribute__((section("sfrs"), address(0xBF844390)));
extern volatile uint32_t        U1EP9CLR __attribute__((section("sfrs"),address(0xBF844394)));
extern volatile uint32_t        U1EP9SET __attribute__((section("sfrs"),address(0xBF844398)));
extern volatile uint32_t        U1EP9INV __attribute__((section("sfrs"),address(0xBF84439C)));
#define U1EP10 U1EP10
extern volatile uint32_t   U1EP10 __attribute__((section("sfrs"), address(0xBF8443A0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP10bits_t;
extern volatile __U1EP10bits_t U1EP10bits __asm__ ("U1EP10") __attribute__((section("sfrs"), address(0xBF8443A0)));
extern volatile uint32_t        U1EP10CLR __attribute__((section("sfrs"),address(0xBF8443A4)));
extern volatile uint32_t        U1EP10SET __attribute__((section("sfrs"),address(0xBF8443A8)));
extern volatile uint32_t        U1EP10INV __attribute__((section("sfrs"),address(0xBF8443AC)));
#define U1EP11 U1EP11
extern volatile uint32_t   U1EP11 __attribute__((section("sfrs"), address(0xBF8443B0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP11bits_t;
extern volatile __U1EP11bits_t U1EP11bits __asm__ ("U1EP11") __attribute__((section("sfrs"), address(0xBF8443B0)));
extern volatile uint32_t        U1EP11CLR __attribute__((section("sfrs"),address(0xBF8443B4)));
extern volatile uint32_t        U1EP11SET __attribute__((section("sfrs"),address(0xBF8443B8)));
extern volatile uint32_t        U1EP11INV __attribute__((section("sfrs"),address(0xBF8443BC)));
#define U1EP12 U1EP12
extern volatile uint32_t   U1EP12 __attribute__((section("sfrs"), address(0xBF8443C0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP12bits_t;
extern volatile __U1EP12bits_t U1EP12bits __asm__ ("U1EP12") __attribute__((section("sfrs"), address(0xBF8443C0)));
extern volatile uint32_t        U1EP12CLR __attribute__((section("sfrs"),address(0xBF8443C4)));
extern volatile uint32_t        U1EP12SET __attribute__((section("sfrs"),address(0xBF8443C8)));
extern volatile uint32_t        U1EP12INV __attribute__((section("sfrs"),address(0xBF8443CC)));
#define U1EP13 U1EP13
extern volatile uint32_t   U1EP13 __attribute__((section("sfrs"), address(0xBF8443D0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP13bits_t;
