Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __CECONbits_t CECONbits __asm__ ("CECON") __attribute__((section("sfrs"), address(0xBF8E4004)));
#define CEBDADDR CEBDADDR
extern volatile uint32_t   CEBDADDR __attribute__((section("sfrs"), address(0xBF8E4008)));
typedef struct {
  uint32_t BDPADDR:32;
} __CEBDADDRbits_t;
extern volatile __CEBDADDRbits_t CEBDADDRbits __asm__ ("CEBDADDR") __attribute__((section("sfrs"), address(0xBF8E4008)));
#define CEBDPADDR CEBDPADDR
extern volatile uint32_t   CEBDPADDR __attribute__((section("sfrs"), address(0xBF8E400C)));
typedef struct {
  uint32_t BASEADDR:32;
} __CEBDPADDRbits_t;
extern volatile __CEBDPADDRbits_t CEBDPADDRbits __asm__ ("CEBDPADDR") __attribute__((section("sfrs"), address(0xBF8E400C)));
#define CESTAT CESTAT
extern volatile uint32_t   CESTAT __attribute__((section("sfrs"), address(0xBF8E4010)));
typedef struct {
  uint32_t BDCTRL:16;
  uint32_t ACTIVE:1;
  uint32_t START:1;
  uint32_t BDSTATE:4;
  uint32_t :2;
  uint32_t ERRPHASE:2;
  uint32_t ERROP:3;
  uint32_t ERRMODE:3;
} __CESTATbits_t;
extern volatile __CESTATbits_t CESTATbits __asm__ ("CESTAT") __attribute__((section("sfrs"), address(0xBF8E4010)));
#define CEINTSRC CEINTSRC
extern volatile uint32_t   CEINTSRC __attribute__((section("sfrs"), address(0xBF8E4014)));
typedef struct {
  uint32_t PENDIF:1;
  uint32_t CBDIF:1;
  uint32_t PKTIF:1;
  uint32_t AREIF:1;
} __CEINTSRCbits_t;
extern volatile __CEINTSRCbits_t CEINTSRCbits __asm__ ("CEINTSRC") __attribute__((section("sfrs"), address(0xBF8E4014)));
#define CEINTEN CEINTEN
extern volatile uint32_t   CEINTEN __attribute__((section("sfrs"), address(0xBF8E4018)));
typedef struct {
  uint32_t PENDIE:1;
  uint32_t CBDIE:1;
  uint32_t PKTIE:1;
  uint32_t AREIE:1;
} __CEINTENbits_t;
extern volatile __CEINTENbits_t CEINTENbits __asm__ ("CEINTEN") __attribute__((section("sfrs"), address(0xBF8E4018)));
#define CEPOLLCON CEPOLLCON
extern volatile uint32_t   CEPOLLCON __attribute__((section("sfrs"), address(0xBF8E401C)));
typedef struct {
  uint32_t BDPPLCON:16;
} __CEPOLLCONbits_t;
extern volatile __CEPOLLCONbits_t CEPOLLCONbits __asm__ ("CEPOLLCON") __attribute__((section("sfrs"), address(0xBF8E401C)));
#define CEHDLEN CEHDLEN
extern volatile uint32_t   CEHDLEN __attribute__((section("sfrs"), address(0xBF8E4020)));
typedef struct {
  uint32_t HDRLEN:8;
} __CEHDLENbits_t;
extern volatile __CEHDLENbits_t CEHDLENbits __asm__ ("CEHDLEN") __attribute__((section("sfrs"), address(0xBF8E4020)));
#define CETRLLEN CETRLLEN
extern volatile uint32_t   CETRLLEN __attribute__((section("sfrs"), address(0xBF8E4024)));
typedef struct {
  uint32_t TRLRLEN:8;
} __CETRLLENbits_t;
extern volatile __CETRLLENbits_t CETRLLENbits __asm__ ("CETRLLEN") __attribute__((section("sfrs"), address(0xBF8E4024)));
#define CEDTXSTAT CEDTXSTAT
extern volatile uint32_t   CEDTXSTAT __attribute__((section("sfrs"), address(0xBF8E4028)));
typedef struct {
  uint32_t DTXSTATE:4;
  uint32_t DTXBLEN:16;
} __CEDTXSTATbits_t;
extern volatile __CEDTXSTATbits_t CEDTXSTATbits __asm__ ("CEDTXSTAT") __attribute__((section("sfrs"), address(0xBF8E4028)));
#define CEDRXSTAT CEDRXSTAT
extern volatile uint32_t   CEDRXSTAT __attribute__((section("sfrs"), address(0xBF8E402C)));
typedef struct {
  uint32_t DRXSTATE:4;
  uint32_t DRXBLEN:16;
} __CEDRXSTATbits_t;
extern volatile __CEDRXSTATbits_t CEDRXSTATbits __asm__ ("CEDRXSTAT") __attribute__((section("sfrs"), address(0xBF8E402C)));
#define CEDCRYPTOADDR CEDCRYPTOADDR
extern volatile uint32_t   CEDCRYPTOADDR __attribute__((section("sfrs"), address(0xBF8E4030)));
typedef struct {
  uint32_t CRYPTOADDR:4;
} __CEDCRYPTOADDRbits_t;
extern volatile __CEDCRYPTOADDRbits_t CEDCRYPTOADDRbits __asm__ ("CEDCRYPTOADDR") __attribute__((section("sfrs"), address(0xBF8E4030)));
#define CEDHASHADDR CEDHASHADDR
extern volatile uint32_t   CEDHASHADDR __attribute__((section("sfrs"), address(0xBF8E4034)));
typedef struct {
  uint32_t HASHADDR:4;
} __CEDHASHADDRbits_t;
extern volatile __CEDHASHADDRbits_t CEDHASHADDRbits __asm__ ("CEDHASHADDR") __attribute__((section("sfrs"), address(0xBF8E4034)));
#define CEDTXADDR CEDTXADDR
extern volatile uint32_t   CEDTXADDR __attribute__((section("sfrs"), address(0xBF8E4038)));
typedef struct {
  uint32_t TXDADDR:2;
} __CEDTXADDRbits_t;
extern volatile __CEDTXADDRbits_t CEDTXADDRbits __asm__ ("CEDTXADDR") __attribute__((section("sfrs"), address(0xBF8E4038)));
#define CEDML0ADDR CEDML0ADDR
extern volatile uint32_t   CEDML0ADDR __attribute__((section("sfrs"), address(0xBF8E403C)));
typedef struct {
  uint32_t ML0ADDR:32;
} __CEDML0ADDRbits_t;
extern volatile __CEDML0ADDRbits_t CEDML0ADDRbits __asm__ ("CEDML0ADDR") __attribute__((section("sfrs"), address(0xBF8E403C)));
#define CEDML1ADDR CEDML1ADDR
extern volatile uint32_t   CEDML1ADDR __attribute__((section("sfrs"), address(0xBF8E4040)));
typedef struct {
  uint32_t ML1ADDR:32;
} __CEDML1ADDRbits_t;
extern volatile __CEDML1ADDRbits_t CEDML1ADDRbits __asm__ ("CEDML1ADDR") __attribute__((section("sfrs"), address(0xBF8E4040)));
#define CEDOL0ADDR CEDOL0ADDR
extern volatile uint32_t   CEDOL0ADDR __attribute__((section("sfrs"), address(0xBF8E4044)));
typedef struct {
  uint32_t OL0ADDR:32;
} __CEDOL0ADDRbits_t;
extern volatile __CEDOL0ADDRbits_t CEDOL0ADDRbits __asm__ ("CEDOL0ADDR") __attribute__((section("sfrs"), address(0xBF8E4044)));
#define CEDCSTADDDR CEDCSTADDDR
extern volatile uint32_t   CEDCSTADDDR __attribute__((section("sfrs"), address(0xBF8E4048)));
typedef struct {
  uint32_t CSTATEADDR:4;
} __CEDCSTADDDRbits_t;
extern volatile __CEDCSTADDDRbits_t CEDCSTADDDRbits __asm__ ("CEDCSTADDDR") __attribute__((section("sfrs"), address(0xBF8E4048)));
#define CEDMTSKADDR CEDMTSKADDR
extern volatile uint32_t   CEDMTSKADDR __attribute__((section("sfrs"), address(0xBF8E404C)));
typedef struct {
  uint32_t MTASKADDR:2;
} __CEDMTSKADDRbits_t;
extern volatile __CEDMTSKADDRbits_t CEDMTSKADDRbits __asm__ ("CEDMTSKADDR") __attribute__((section("sfrs"), address(0xBF8E404C)));
#define CEDSACON CEDSACON
extern volatile uint32_t   CEDSACON __attribute__((section("sfrs"), address(0xBF8E4050)));
typedef struct {
  uint32_t SACON:32;
} __CEDSACONbits_t;
