Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs"), address(0xBFC55F98)));
#define FBCFG0 FBCFG0
extern volatile uint32_t   FBCFG0 __attribute__((section("sfrs"), address(0xBFC55F9C)));
typedef union {
  struct {
    uint32_t BUHSWEN:1;
    uint32_t PCSCMODE:1;
    uint32_t :1;
    uint32_t BOOTISA:1;
  };
  struct {
    uint32_t w:32;
  };
} __FBCFG0bits_t;
extern volatile __FBCFG0bits_t FBCFG0bits __asm__ ("FBCFG0") __attribute__((section("sfrs"), address(0xBFC55F9C)));
#define FCPN0 FCPN0
extern volatile uint32_t   FCPN0 __attribute__((section("sfrs"), address(0xBFC55FBC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __FCPN0bits_t;
extern volatile __FCPN0bits_t FCPN0bits __asm__ ("FCPN0") __attribute__((section("sfrs"), address(0xBFC55FBC)));
#define FSIGN0 FSIGN0
extern volatile uint32_t   FSIGN0 __attribute__((section("sfrs"), address(0xBFC55FDC)));
typedef union {
  struct {
    uint32_t :31;
    uint32_t SIGN:1;
  };
  struct {
    uint32_t w:32;
  };
} __FSIGN0bits_t;
extern volatile __FSIGN0bits_t FSIGN0bits __asm__ ("FSIGN0") __attribute__((section("sfrs"), address(0xBFC55FDC)));
#define AFUSERID AFUSERID
extern volatile uint32_t   AFUSERID __attribute__((section("sfrs"), address(0xBFC55E88)));
typedef union {
  struct {
    uint32_t USERID:16;
  };
  struct {
    uint32_t w:32;
  };
} __AFUSERIDbits_t;
extern volatile __AFUSERIDbits_t AFUSERIDbits __asm__ ("AFUSERID") __attribute__((section("sfrs"), address(0xBFC55E88)));
#define ADEVCFG4 ADEVCFG4
extern volatile uint32_t   ADEVCFG4 __attribute__((section("sfrs"), address(0xBFC55E8C)));
typedef union {
  struct {
    uint32_t SOSCCFG:8;
    uint32_t :11;
    uint32_t VBZPBOREN:1;
    uint32_t DSZPBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t DSEN:1;
    uint32_t :1;
    uint32_t SOSCEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG4bits_t;
extern volatile __ADEVCFG4bits_t ADEVCFG4bits __asm__ ("ADEVCFG4") __attribute__((section("sfrs"), address(0xBFC55E8C)));
#define ADEVCFG2 ADEVCFG2
extern volatile uint32_t   ADEVCFG2 __attribute__((section("sfrs"), address(0xBFC55E90)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t DMTINTV:3;
    uint32_t :2;
    uint32_t POSCMOD:2;
    uint32_t WDTRMCS:2;
    uint32_t SOSCSEL:1;
    uint32_t WAKE2SPD:1;
    uint32_t CKSWEN:1;
    uint32_t FSCMEN:1;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t WDTEN:1;
    uint32_t WDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t DMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG2bits_t;
extern volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs"), address(0xBFC55E90)));
#define ADEVCFG1 ADEVCFG1
extern volatile uint32_t   ADEVCFG1 __attribute__((section("sfrs"), address(0xBFC55E94)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t :1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t :2;
    uint32_t FMIIEN:1;
    uint32_t ETHEXEREF:1;
    uint32_t CLASSBDIS:1;
    uint32_t USBIDIO:1;
    uint32_t VBUSIO:1;
    uint32_t HSSPIEN:1;
    uint32_t SMCLR:1;
    uint32_t HSUARTEN:1;
    uint32_t USBDMTRIM:4;
    uint32_t USBDPTRIM:4;
    uint32_t WDTPSS:5;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG1bits_t;
extern volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs"), address(0xBFC55E94)));
#define ADEVCFG0 ADEVCFG0
extern volatile uint32_t   ADEVCFG0 __attribute__((section("sfrs"), address(0xBFC55E98)));
typedef union {
  struct {
    uint32_t TDOEN:1;
    uint32_t :1;
    uint32_t TROEN:1;
    uint32_t JTAGEN:1;
    uint32_t :1;
    uint32_t FCPRI:1;
    uint32_t DMAPRI:1;
    uint32_t EXLPRI:1;
    uint32_t USBSSEN:1;
    uint32_t :1;
    uint32_t PMULOCK:1;
    uint32_t PGLOCK:1;
    uint32_t PMDLOCK:1;
    uint32_t IOLOCK:1;
    uint32_t CFGLOCK:2;
    uint32_t OC_ACLK:1;
    uint32_t IC_ACLK:1;
    uint32_t :2;
    uint32_t CANFDDIV:2;
    uint32_t :1;
    uint32_t PCM:1;
    uint32_t UPLLHWMD:1;
    uint32_t SPLLHWMD:1;
    uint32_t BTPLLHWMD:1;
    uint32_t ETHPLLHWMD:1;
    uint32_t FECCCON:2;
    uint32_t ETHTPSF:1;
    uint32_t EPGMCLK:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG0bits_t;
extern volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs"), address(0xBFC55E98)));
#define AFBCFG0 AFBCFG0
extern volatile uint32_t   AFBCFG0 __attribute__((section("sfrs"), address(0xBFC55E9C)));
typedef union {
  struct {
    uint32_t BUHSWEN:1;
    uint32_t PCSCMODE:1;
    uint32_t :1;
    uint32_t BOOTISA:1;
  };
  struct {
    uint32_t w:32;
  };
} __AFBCFG0bits_t;
extern volatile __AFBCFG0bits_t AFBCFG0bits __asm__ ("AFBCFG0") __attribute__((section("sfrs"), address(0xBFC55E9C)));
#define AFCPN0 AFCPN0
extern volatile uint32_t   AFCPN0 __attribute__((section("sfrs"), address(0xBFC55EBC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __AFCPN0bits_t;
extern volatile __AFCPN0bits_t AFCPN0bits __asm__ ("AFCPN0") __attribute__((section("sfrs"), address(0xBFC55EBC)));
#ifdef __cplusplus
}
#endif

#elif defined (__LANGUAGE_ASSEMBLY__)
  .extern CFGCON0          /* 0xBF800000 */
  .extern CFGCON1          /* 0xBF800010 */
  .extern CFGCON2          /* 0xBF800020 */
  .extern CFGCON3          /* 0xBF800030 */
  .extern CFGCON4          /* 0xBF800040 */
  .extern CFGPG            /* 0xBF800050 */
  .extern DEVID            /* 0xBF800060 */
  .extern USERID           /* 0xBF800070 */
  .extern SYSKEY           /* 0xBF800080 */
  .extern PMD1             /* 0xBF800090 */
  .extern PMD2             /* 0xBF8000A0 */
  .extern PMD3             /* 0xBF8000B0 */
  .extern BCFG0            /* 0xBF800100 */
  .extern NVMCON           /* 0xBF800600 */
  .extern NVMCONCLR        /* 0xBF800604 */
  .extern NVMCONSET        /* 0xBF800608 */
  .extern NVMCONINV        /* 0xBF80060C */
  .extern NVMCON2          /* 0xBF800610 */
  .extern NVMCON2CLR       /* 0xBF800614 */
  .extern NVMCON2SET       /* 0xBF800618 */
  .extern NVMCON2INV       /* 0xBF80061C */
  .extern NVMKEY           /* 0xBF800620 */
  .extern NVMKEYCLR        /* 0xBF800624 */
  .extern NVMKEYSET        /* 0xBF800628 */
  .extern NVMKEYINV        /* 0xBF80062C */
  .extern NVMADDR          /* 0xBF800630 */
  .extern NVMADDRCLR       /* 0xBF800634 */
  .extern NVMADDRSET       /* 0xBF800638 */
  .extern NVMADDRINV       /* 0xBF80063C */
  .extern NVMDATA0         /* 0xBF800640 */
  .extern NVMDATA0CLR      /* 0xBF800644 */
  .extern NVMDATA0SET      /* 0xBF800648 */
  .extern NVMDATA0INV      /* 0xBF80064C */
  .extern NVMDATA1         /* 0xBF800650 */
  .extern NVMDATA1CLR      /* 0xBF800654 */
  .extern NVMDATA1SET      /* 0xBF800658 */
  .extern NVMDATA1INV      /* 0xBF80065C */
  .extern NVMDATA2         /* 0xBF800660 */
  .extern NVMDATA2CLR      /* 0xBF800664 */
  .extern NVMDATA2SET      /* 0xBF800668 */
  .extern NVMDATA2INV      /* 0xBF80066C */
  .extern NVMDATA3         /* 0xBF800670 */
  .extern NVMDATA3CLR      /* 0xBF800674 */
  .extern NVMDATA3SET      /* 0xBF800678 */
  .extern NVMDATA3INV      /* 0xBF80067C */
  .extern NVMDATA4         /* 0xBF800680 */
  .extern NVMDATA4CLR      /* 0xBF800684 */
  .extern NVMDATA4SET      /* 0xBF800688 */
  .extern NVMDATA4INV      /* 0xBF80068C */
  .extern NVMDATA5         /* 0xBF800690 */
  .extern NVMDATA5CLR      /* 0xBF800694 */
  .extern NVMDATA5SET      /* 0xBF800698 */
  .extern NVMDATA5INV      /* 0xBF80069C */
  .extern NVMDATA6         /* 0xBF8006A0 */
  .extern NVMDATA6CLR      /* 0xBF8006A4 */
  .extern NVMDATA6SET      /* 0xBF8006A8 */
  .extern NVMDATA6INV      /* 0xBF8006AC */
  .extern NVMDATA7         /* 0xBF8006B0 */
  .extern NVMDATA7CLR      /* 0xBF8006B4 */
  .extern NVMDATA7SET      /* 0xBF8006B8 */
  .extern NVMDATA7INV      /* 0xBF8006BC */
  .extern NVMSRCADDR       /* 0xBF8006C0 */
  .extern NVMSRCADDRCLR    /* 0xBF8006C4 */
  .extern NVMSRCADDRSET    /* 0xBF8006C8 */
  .extern NVMSRCADDRINV    /* 0xBF8006CC */
  .extern NVMPWPLT         /* 0xBF8006D0 */
  .extern NVMPWPLTCLR      /* 0xBF8006D4 */
  .extern NVMPWPLTSET      /* 0xBF8006D8 */
  .extern NVMPWPLTINV      /* 0xBF8006DC */
  .extern NVMPWPGTE        /* 0xBF8006E0 */
  .extern NVMPWPGTECLR     /* 0xBF8006E4 */
  .extern NVMPWPGTESET     /* 0xBF8006E8 */
  .extern NVMPWPGTEINV     /* 0xBF8006EC */
  .extern NVMLBWP          /* 0xBF8006F0 */
  .extern NVMLBWPCLR       /* 0xBF8006F4 */
  .extern NVMLBWPSET       /* 0xBF8006F8 */
  .extern NVMLBWPINV       /* 0xBF8006FC */
  .extern NVMUBWP          /* 0xBF800700 */
  .extern NVMUBWPCLR       /* 0xBF800704 */
  .extern NVMUBWPSET       /* 0xBF800708 */
  .extern NVMUBWPINV       /* 0xBF80070C */
  .extern WDTCON           /* 0xBF800800 */
  .extern WDTCONCLR        /* 0xBF800804 */
  .extern WDTCONSET        /* 0xBF800808 */
  .extern WDTCONINV        /* 0xBF80080C */
  .extern DMTCON           /* 0xBF800A00 */
  .extern DMTPRECLR        /* 0xBF800A10 */
  .extern DMTCLR           /* 0xBF800A20 */
  .extern DMTSTAT          /* 0xBF800A30 */
  .extern DMTCNT           /* 0xBF800A40 */
  .extern DMTHOLDREG       /* 0xBF800A50 */
  .extern DMTPSCNT         /* 0xBF800A60 */
  .extern DMTPSINTV        /* 0xBF800A70 */
  .extern OSCCON           /* 0xBF801200 */
  .extern OSCCONCLR        /* 0xBF801204 */
  .extern OSCCONSET        /* 0xBF801208 */
  .extern OSCCONINV        /* 0xBF80120C */
  .extern OSCTUN           /* 0xBF801210 */
  .extern OSCTUNCLR        /* 0xBF801214 */
  .extern OSCTUNSET        /* 0xBF801218 */
  .extern OSCTUNINV        /* 0xBF80121C */
  .extern SPLLCON          /* 0xBF801220 */
  .extern SPLLCONCLR       /* 0xBF801224 */
  .extern SPLLCONSET       /* 0xBF801228 */
  .extern SPLLCONINV       /* 0xBF80122C */
  .extern UPLLCON          /* 0xBF801230 */
  .extern UPLLCONCLR       /* 0xBF801234 */
  .extern UPLLCONSET       /* 0xBF801238 */
  .extern UPLLCONINV       /* 0xBF80123C */
  .extern BTPLLCON         /* 0xBF801240 */
  .extern BTPLLCONCLR      /* 0xBF801244 */
  .extern BTPLLCONSET      /* 0xBF801248 */
  .extern BTPLLCONINV      /* 0xBF80124C */
  .extern EWPLLCON         /* 0xBF801250 */
  .extern EWPLLCONCLR      /* 0xBF801254 */
  .extern EWPLLCONSET      /* 0xBF801258 */
  .extern EWPLLCONINV      /* 0xBF80125C */
  .extern RCON             /* 0xBF801260 */
  .extern RCONCLR          /* 0xBF801264 */
  .extern RCONSET          /* 0xBF801268 */
  .extern RCONINV          /* 0xBF80126C */
  .extern RSWRST           /* 0xBF801270 */
  .extern RSWRSTCLR        /* 0xBF801274 */
  .extern RSWRSTSET        /* 0xBF801278 */
  .extern RSWRSTINV        /* 0xBF80127C */
  .extern RNMICON          /* 0xBF801280 */
  .extern RNMICONCLR       /* 0xBF801284 */
  .extern RNMICONSET       /* 0xBF801288 */
  .extern RNMICONINV       /* 0xBF80128C */
  .extern PWRCON           /* 0xBF801290 */
  .extern PWRCONCLR        /* 0xBF801294 */
  .extern PWRCONSET        /* 0xBF801298 */
  .extern PWRCONINV        /* 0xBF80129C */
  .extern REFO1CON         /* 0xBF8012A0 */
  .extern REFO1CONCLR      /* 0xBF8012A4 */
  .extern REFO1CONSET      /* 0xBF8012A8 */
  .extern REFO1CONINV      /* 0xBF8012AC */
  .extern REFO1TRIM        /* 0xBF8012B0 */
  .extern REFO1TRIMCLR     /* 0xBF8012B4 */
  .extern REFO1TRIMSET     /* 0xBF8012B8 */
  .extern REFO1TRIMINV     /* 0xBF8012BC */
  .extern REFO2CON         /* 0xBF8012C0 */
  .extern REFO2CONCLR      /* 0xBF8012C4 */
  .extern REFO2CONSET      /* 0xBF8012C8 */
  .extern REFO2CONINV      /* 0xBF8012CC */
  .extern REFO2TRIM        /* 0xBF8012D0 */
  .extern REFO2TRIMCLR     /* 0xBF8012D4 */
  .extern REFO2TRIMSET     /* 0xBF8012D8 */
  .extern REFO2TRIMINV     /* 0xBF8012DC */
  .extern REFO3CON         /* 0xBF8012E0 */
  .extern REFO3CONCLR      /* 0xBF8012E4 */
  .extern REFO3CONSET      /* 0xBF8012E8 */
  .extern REFO3CONINV      /* 0xBF8012EC */
  .extern REFO3TRIM        /* 0xBF8012F0 */
  .extern REFO3TRIMCLR     /* 0xBF8012F4 */
  .extern REFO3TRIMSET     /* 0xBF8012F8 */
  .extern REFO3TRIMINV     /* 0xBF8012FC */
  .extern REFO4CON         /* 0xBF801300 */
  .extern REFO4CONCLR      /* 0xBF801304 */
  .extern REFO4CONSET      /* 0xBF801308 */
  .extern REFO4CONINV      /* 0xBF80130C */
  .extern REFO4TRIM        /* 0xBF801310 */
  .extern REFO4TRIMCLR     /* 0xBF801314 */
  .extern REFO4TRIMSET     /* 0xBF801318 */
  .extern REFO4TRIMINV     /* 0xBF80131C */
  .extern PB1DIV           /* 0xBF801320 */
  .extern PB1DIVCLR        /* 0xBF801324 */
  .extern PB1DIVSET        /* 0xBF801328 */
  .extern PB1DIVINV        /* 0xBF80132C */
  .extern PB2DIV           /* 0xBF801330 */
  .extern PB2DIVCLR        /* 0xBF801334 */
  .extern PB2DIVSET        /* 0xBF801338 */
  .extern PB2DIVINV        /* 0xBF80133C */
  .extern PB3DIV           /* 0xBF801340 */
  .extern PB3DIVCLR        /* 0xBF801344 */
  .extern PB3DIVSET        /* 0xBF801348 */
  .extern PB3DIVINV        /* 0xBF80134C */
  .extern PB4DIV           /* 0xBF801350 */
  .extern PB4DIVCLR        /* 0xBF801354 */
  .extern PB4DIVSET        /* 0xBF801358 */
  .extern PB4DIVINV        /* 0xBF80135C */
  .extern PB5DIV           /* 0xBF801360 */
  .extern PB5DIVCLR        /* 0xBF801364 */
  .extern PB5DIVSET        /* 0xBF801368 */
  .extern PB5DIVINV        /* 0xBF80136C */
  .extern PB6DIV           /* 0xBF801370 */
  .extern PB6DIVCLR        /* 0xBF801374 */
  .extern PB6DIVSET        /* 0xBF801378 */
  .extern PB6DIVINV        /* 0xBF80137C */
  .extern SLEWCON          /* 0xBF801380 */
  .extern SLEWCONCLR       /* 0xBF801384 */
  .extern SLEWCONSET       /* 0xBF801388 */
  .extern SLEWCONINV       /* 0xBF80138C */
  .extern CLKSTAT          /* 0xBF801390 */
  .extern CLKSTATCLR       /* 0xBF801394 */
  .extern CLKSTATSET       /* 0xBF801398 */
  .extern CLKSTATINV       /* 0xBF80139C */
  .extern OSCCONBAR        /* 0xBF8013A0 */
  .extern OSCCONBARCLR     /* 0xBF8013A4 */
  .extern OSCCONBARSET     /* 0xBF8013A8 */
  .extern OSCCONBARINV     /* 0xBF8013AC */
  .extern CLKDIAG          /* 0xBF8013B0 */
  .extern CLKDIAGCLR       /* 0xBF8013B4 */
  .extern CLKDIAGSET       /* 0xBF8013B8 */
  .extern CLKDIAGINV       /* 0xBF8013BC */
  .extern LVDCON           /* 0xBF801400 */
  .extern U3MODE           /* 0xBF801600 */
  .extern U3MODECLR        /* 0xBF801604 */
  .extern U3MODESET        /* 0xBF801608 */
  .extern U3MODEINV        /* 0xBF80160C */
  .extern U3STA            /* 0xBF801610 */
  .extern U3STACLR         /* 0xBF801614 */
  .extern U3STASET         /* 0xBF801618 */
  .extern U3STAINV         /* 0xBF80161C */
  .extern U3TXREG          /* 0xBF801620 */
  .extern U3RXREG          /* 0xBF801630 */
  .extern U3BRG            /* 0xBF801640 */
  .extern U3BRGCLR         /* 0xBF801644 */
  .extern U3BRGSET         /* 0xBF801648 */
  .extern U3BRGINV         /* 0xBF80164C */
  .extern INT0R            /* 0xBF801800 */
  .extern INT1R            /* 0xBF801804 */
  .extern INT2R            /* 0xBF801808 */
  .extern INT3R            /* 0xBF80180C */
  .extern INT4R            /* 0xBF801810 */
  .extern T1CKR            /* 0xBF801814 */
  .extern T2CKR            /* 0xBF801818 */
  .extern T3CKR            /* 0xBF80181C */
  .extern T4CKR            /* 0xBF801820 */
  .extern T5CKR            /* 0xBF801824 */
  .extern T6CKR            /* 0xBF801828 */
  .extern T7CKR            /* 0xBF80182C */
  .extern IC1R             /* 0xBF801838 */
  .extern IC2R             /* 0xBF80183C */
  .extern IC3R             /* 0xBF801840 */
  .extern IC4R             /* 0xBF801844 */
  .extern OCFAR            /* 0xBF80185C */
  .extern OCFBR            /* 0xBF801860 */
  .extern OCFCR            /* 0xBF801864 */
  .extern OCFDR            /* 0xBF801868 */
  .extern U1RXR            /* 0xBF80186C */
  .extern U1CTSR           /* 0xBF801870 */
  .extern U2RXR            /* 0xBF801874 */
  .extern U2CTSR           /* 0xBF801878 */
  .extern U3RXR            /* 0xBF80187C */
  .extern U3CTSR           /* 0xBF801880 */
  .extern PTG30R           /* 0xBF80188C */
  .extern PTG31R           /* 0xBF801890 */
  .extern SDI1R            /* 0xBF801898 */
  .extern SS1INR           /* 0xBF80189C */
  .extern SDI2R            /* 0xBF8018A4 */
  .extern SS2INR           /* 0xBF8018A8 */
  .extern C1RXR            /* 0xBF8018C4 */
  .extern C2RXR            /* 0xBF8018C8 */
  .extern REFIR            /* 0xBF8018CC */
  .extern ECOLR            /* 0xBF801974 */
  .extern ECRSR            /* 0xBF801978 */
  .extern ETXCLKR          /* 0xBF80197C */
  .extern ERXD3R           /* 0xBF801980 */
  .extern ERXD2R           /* 0xBF801984 */
  .extern RPA0R            /* 0xBF801A00 */
  .extern RPA1R            /* 0xBF801A04 */
  .extern RPA2R            /* 0xBF801A08 */
  .extern RPA3R            /* 0xBF801A0C */
  .extern RPA4R            /* 0xBF801A10 */
  .extern RPA5R            /* 0xBF801A14 */
  .extern RPA10R           /* 0xBF801A28 */
  .extern RPA11R           /* 0xBF801A2C */
  .extern RPA12R           /* 0xBF801A30 */
  .extern RPA13R           /* 0xBF801A34 */
  .extern RPA14R           /* 0xBF801A38 */
  .extern RPA15R           /* 0xBF801A3C */
  .extern RPB0R            /* 0xBF801A40 */
  .extern RPB1R            /* 0xBF801A44 */
  .extern RPB2R            /* 0xBF801A48 */
  .extern RPB3R            /* 0xBF801A4C */
  .extern RPB4R            /* 0xBF801A50 */
  .extern RPB5R            /* 0xBF801A54 */
  .extern RPB6R            /* 0xBF801A58 */
  .extern RPB7R            /* 0xBF801A5C */
  .extern RPB8R            /* 0xBF801A60 */
  .extern RPB9R            /* 0xBF801A64 */
  .extern RPB10R           /* 0xBF801A68 */
  .extern RPB11R           /* 0xBF801A6C */
  .extern RPB12R           /* 0xBF801A70 */
  .extern RPB13R           /* 0xBF801A74 */
  .extern RPB14R           /* 0xBF801A78 */
  .extern RPC0R            /* 0xBF801A80 */
  .extern RPC1R            /* 0xBF801A84 */
  .extern RPC2R            /* 0xBF801A88 */
  .extern RPC3R            /* 0xBF801A8C */
  .extern RPC4R            /* 0xBF801A90 */
  .extern RPC5R            /* 0xBF801A94 */
  .extern RPC6R            /* 0xBF801A98 */
  .extern RPC7R            /* 0xBF801A9C */
  .extern RPC8R            /* 0xBF801AA0 */
  .extern RPC9R            /* 0xBF801AA4 */
  .extern RPC10R           /* 0xBF801AA8 */
  .extern RPC11R           /* 0xBF801AAC */
  .extern RPC12R           /* 0xBF801AB0 */
  .extern RPC13R           /* 0xBF801AB4 */
  .extern RPC14R           /* 0xBF801AB8 */
  .extern RPC15R           /* 0xBF801ABC */
  .extern RPK0R            /* 0xBF801AC0 */
  .extern RPK1R            /* 0xBF801AC4 */
  .extern RPK2R            /* 0xBF801AC8 */
  .extern RPK3R            /* 0xBF801ACC */
  .extern RPK4R            /* 0xBF801AD0 */
  .extern RPK5R            /* 0xBF801AD4 */
  .extern RPK6R            /* 0xBF801AD8 */
  .extern RPK7R            /* 0xBF801ADC */
  .extern RPK8R            /* 0xBF801AE0 */
  .extern RPK9R            /* 0xBF801AE4 */
  .extern RPK10R           /* 0xBF801AE8 */
  .extern RPK11R           /* 0xBF801AEC */
  .extern RPK12R           /* 0xBF801AF0 */
  .extern RPK13R           /* 0xBF801AF4 */
  .extern RPK14R           /* 0xBF801AF8 */
  .extern PTGCON           /* 0xBF801C00 */
  .extern PTGCONCLR        /* 0xBF801C04 */
  .extern PTGCONSET        /* 0xBF801C08 */
  .extern PTGCONINV        /* 0xBF801C0C */
  .extern PTGBTE           /* 0xBF801C10 */
  .extern PTGBTECLR        /* 0xBF801C14 */
  .extern PTGBTESET        /* 0xBF801C18 */
  .extern PTGBTEINV        /* 0xBF801C1C */
  .extern PTGHOLD          /* 0xBF801C20 */
  .extern PTGHOLDCLR       /* 0xBF801C24 */
  .extern PTGHOLDSET       /* 0xBF801C28 */
  .extern PTGHOLDINV       /* 0xBF801C2C */
  .extern PTGT0LIM         /* 0xBF801C30 */
  .extern PTGT0LIMCLR      /* 0xBF801C34 */
  .extern PTGT0LIMSET      /* 0xBF801C38 */
  .extern PTGT0LIMINV      /* 0xBF801C3C */
  .extern PTGT1LIM         /* 0xBF801C40 */
  .extern PTGT1LIMCLR      /* 0xBF801C44 */
  .extern PTGT1LIMSET      /* 0xBF801C48 */
  .extern PTGT1LIMINV      /* 0xBF801C4C */
  .extern PTGSDLIM         /* 0xBF801C50 */
  .extern PTGSDLIMCLR      /* 0xBF801C54 */
  .extern PTGSDLIMSET      /* 0xBF801C58 */
  .extern PTGSDLIMINV      /* 0xBF801C5C */
  .extern PTGC0LIM         /* 0xBF801C60 */
  .extern PTGC0LIMCLR      /* 0xBF801C64 */
  .extern PTGC0LIMSET      /* 0xBF801C68 */
  .extern PTGC0LIMINV      /* 0xBF801C6C */
  .extern PTGC1LIM         /* 0xBF801C70 */
  .extern PTGC1LIMCLR      /* 0xBF801C74 */
  .extern PTGC1LIMSET      /* 0xBF801C78 */
  .extern PTGC1LIMINV      /* 0xBF801C7C */
  .extern PTGADJ           /* 0xBF801C80 */
  .extern PTGADJCLR        /* 0xBF801C84 */
  .extern PTGADJSET        /* 0xBF801C88 */
  .extern PTGADJINV        /* 0xBF801C8C */
  .extern PTGL0            /* 0xBF801C90 */
  .extern PTGL0CLR         /* 0xBF801C94 */
  .extern PTGL0SET         /* 0xBF801C98 */
  .extern PTGL0INV         /* 0xBF801C9C */
  .extern PTGQPTR          /* 0xBF801CA0 */
  .extern PTGQPTRCLR       /* 0xBF801CA4 */
  .extern PTGQPTRSET       /* 0xBF801CA8 */
  .extern PTGQPTRINV       /* 0xBF801CAC */
  .extern PTGQUE0          /* 0xBF801CC0 */
  .extern PTGQUE0CLR       /* 0xBF801CC4 */
  .extern PTGQUE0SET       /* 0xBF801CC8 */
  .extern PTGQUE0INV       /* 0xBF801CCC */
  .extern PTGQUE1          /* 0xBF801CD0 */
  .extern PTGQUE1CLR       /* 0xBF801CD4 */
  .extern PTGQUE1SET       /* 0xBF801CD8 */
  .extern PTGQUE1INV       /* 0xBF801CDC */
  .extern PTGQUE2          /* 0xBF801CE0 */
  .extern PTGQUE2CLR       /* 0xBF801CE4 */
  .extern PTGQUE2SET       /* 0xBF801CE8 */
  .extern PTGQUE2INV       /* 0xBF801CEC */
  .extern PTGQUE3          /* 0xBF801CF0 */
  .extern PTGQUE3CLR       /* 0xBF801CF4 */
  .extern PTGQUE3SET       /* 0xBF801CF8 */
  .extern PTGQUE3INV       /* 0xBF801CFC */
  .extern PTGQUE4          /* 0xBF801D00 */
  .extern PTGQUE4CLR       /* 0xBF801D04 */
  .extern PTGQUE4SET       /* 0xBF801D08 */
  .extern PTGQUE4INV       /* 0xBF801D0C */
  .extern PTGQUE5          /* 0xBF801D10 */
  .extern PTGQUE5CLR       /* 0xBF801D14 */
  .extern PTGQUE5SET       /* 0xBF801D18 */
  .extern PTGQUE5INV       /* 0xBF801D1C */
  .extern PTGQUE6          /* 0xBF801D20 */
  .extern PTGQUE6CLR       /* 0xBF801D24 */
  .extern PTGQUE6SET       /* 0xBF801D28 */
  .extern PTGQUE6INV       /* 0xBF801D2C */
  .extern PTGQUE7          /* 0xBF801D30 */
  .extern PTGQUE7CLR       /* 0xBF801D34 */
  .extern PTGQUE7SET       /* 0xBF801D38 */
  .extern PTGQUE7INV       /* 0xBF801D3C */
  .extern T1CON            /* 0xBF802000 */
  .extern T1CONCLR         /* 0xBF802004 */
  .extern T1CONSET         /* 0xBF802008 */
  .extern T1CONINV         /* 0xBF80200C */
  .extern TMR1             /* 0xBF802010 */
  .extern TMR1CLR          /* 0xBF802014 */
  .extern TMR1SET          /* 0xBF802018 */
  .extern TMR1INV          /* 0xBF80201C */
  .extern PR1              /* 0xBF802020 */
  .extern PR1CLR           /* 0xBF802024 */
  .extern PR1SET           /* 0xBF802028 */
  .extern PR1INV           /* 0xBF80202C */
  .extern T2CON            /* 0xBF802200 */
  .extern T2CONCLR         /* 0xBF802204 */
  .extern T2CONSET         /* 0xBF802208 */
  .extern T2CONINV         /* 0xBF80220C */
  .extern TMR2             /* 0xBF802210 */
  .extern TMR2CLR          /* 0xBF802214 */
  .extern TMR2SET          /* 0xBF802218 */
  .extern TMR2INV          /* 0xBF80221C */
  .extern PR2              /* 0xBF802220 */
  .extern PR2CLR           /* 0xBF802224 */
  .extern PR2SET           /* 0xBF802228 */
  .extern PR2INV           /* 0xBF80222C */
  .extern T3CON            /* 0xBF802400 */
  .extern T3CONCLR         /* 0xBF802404 */
  .extern T3CONSET         /* 0xBF802408 */
  .extern T3CONINV         /* 0xBF80240C */
  .extern TMR3             /* 0xBF802410 */
  .extern TMR3CLR          /* 0xBF802414 */
