Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CFGCON0_FCPRI_POSITION                  0x00000005
#define _CFGCON0_FCPRI_MASK                      0x00000020
#define _CFGCON0_FCPRI_LENGTH                    0x00000001

#define _CFGCON0_DMAPRI_POSITION                 0x00000006
#define _CFGCON0_DMAPRI_MASK                     0x00000040
#define _CFGCON0_DMAPRI_LENGTH                   0x00000001

#define _CFGCON0_EXLPRI_POSITION                 0x00000007
#define _CFGCON0_EXLPRI_MASK                     0x00000080
#define _CFGCON0_EXLPRI_LENGTH                   0x00000001

#define _CFGCON0_USBSSEN_POSITION                0x00000008
#define _CFGCON0_USBSSEN_MASK                    0x00000100
#define _CFGCON0_USBSSEN_LENGTH                  0x00000001

#define _CFGCON0_PMULOCK_POSITION                0x0000000A
#define _CFGCON0_PMULOCK_MASK                    0x00000400
#define _CFGCON0_PMULOCK_LENGTH                  0x00000001

#define _CFGCON0_PGLOCK_POSITION                 0x0000000B
#define _CFGCON0_PGLOCK_MASK                     0x00000800
#define _CFGCON0_PGLOCK_LENGTH                   0x00000001

#define _CFGCON0_PMDLOCK_POSITION                0x0000000C
#define _CFGCON0_PMDLOCK_MASK                    0x00001000
#define _CFGCON0_PMDLOCK_LENGTH                  0x00000001

#define _CFGCON0_IOLOCK_POSITION                 0x0000000D
#define _CFGCON0_IOLOCK_MASK                     0x00002000
#define _CFGCON0_IOLOCK_LENGTH                   0x00000001

#define _CFGCON0_CFGLOCK_POSITION                0x0000000E
#define _CFGCON0_CFGLOCK_MASK                    0x0000C000
#define _CFGCON0_CFGLOCK_LENGTH                  0x00000002

#define _CFGCON0_OC_ACLK_POSITION                0x00000010
#define _CFGCON0_OC_ACLK_MASK                    0x00010000
#define _CFGCON0_OC_ACLK_LENGTH                  0x00000001

#define _CFGCON0_IC_ACLK_POSITION                0x00000011
#define _CFGCON0_IC_ACLK_MASK                    0x00020000
#define _CFGCON0_IC_ACLK_LENGTH                  0x00000001

#define _CFGCON0_CANFDDIV_POSITION               0x00000014
#define _CFGCON0_CANFDDIV_MASK                   0x00300000
#define _CFGCON0_CANFDDIV_LENGTH                 0x00000002

#define _CFGCON0_PCM_POSITION                    0x00000017
#define _CFGCON0_PCM_MASK                        0x00800000
#define _CFGCON0_PCM_LENGTH                      0x00000001

#define _CFGCON0_UPLLHWMD_POSITION               0x00000018
#define _CFGCON0_UPLLHWMD_MASK                   0x01000000
#define _CFGCON0_UPLLHWMD_LENGTH                 0x00000001

#define _CFGCON0_SPLLHWMD_POSITION               0x00000019
#define _CFGCON0_SPLLHWMD_MASK                   0x02000000
#define _CFGCON0_SPLLHWMD_LENGTH                 0x00000001

#define _CFGCON0_BTPLLHWMD_POSITION              0x0000001A
#define _CFGCON0_BTPLLHWMD_MASK                  0x04000000
#define _CFGCON0_BTPLLHWMD_LENGTH                0x00000001

#define _CFGCON0_ETHPLLHWMD_POSITION             0x0000001B
#define _CFGCON0_ETHPLLHWMD_MASK                 0x08000000
#define _CFGCON0_ETHPLLHWMD_LENGTH               0x00000001

#define _CFGCON0_FECCCON_POSITION                0x0000001C
#define _CFGCON0_FECCCON_MASK                    0x30000000
#define _CFGCON0_FECCCON_LENGTH                  0x00000002

#define _CFGCON0_ETHTPSF_POSITION                0x0000001E
#define _CFGCON0_ETHTPSF_MASK                    0x40000000
#define _CFGCON0_ETHTPSF_LENGTH                  0x00000001

#define _CFGCON0_EPGMCLK_POSITION                0x0000001F
#define _CFGCON0_EPGMCLK_MASK                    0x80000000
#define _CFGCON0_EPGMCLK_LENGTH                  0x00000001

#define _CFGCON1_DEBUG_POSITION                  0x00000000
#define _CFGCON1_DEBUG_MASK                      0x00000003
#define _CFGCON1_DEBUG_LENGTH                    0x00000002

#define _CFGCON1_ICESEL_POSITION                 0x00000003
#define _CFGCON1_ICESEL_MASK                     0x00000018
#define _CFGCON1_ICESEL_LENGTH                   0x00000002

#define _CFGCON1_TRCEN_POSITION                  0x00000005
#define _CFGCON1_TRCEN_MASK                      0x00000020
#define _CFGCON1_TRCEN_LENGTH                    0x00000001

#define _CFGCON1_FMIIEN_POSITION                 0x00000008
#define _CFGCON1_FMIIEN_MASK                     0x00000100
#define _CFGCON1_FMIIEN_LENGTH                   0x00000001

#define _CFGCON1_ETHEXEREF_POSITION              0x00000009
#define _CFGCON1_ETHEXEREF_MASK                  0x00000200
#define _CFGCON1_ETHEXEREF_LENGTH                0x00000001

#define _CFGCON1_CLASSBDIS_POSITION              0x0000000A
#define _CFGCON1_CLASSBDIS_MASK                  0x00000400
#define _CFGCON1_CLASSBDIS_LENGTH                0x00000001

#define _CFGCON1_USBIDIO_POSITION                0x0000000B
#define _CFGCON1_USBIDIO_MASK                    0x00000800
#define _CFGCON1_USBIDIO_LENGTH                  0x00000001

#define _CFGCON1_VBUSIO_POSITION                 0x0000000C
#define _CFGCON1_VBUSIO_MASK                     0x00001000
#define _CFGCON1_VBUSIO_LENGTH                   0x00000001

#define _CFGCON1_HSSPIEN_POSITION                0x0000000D
#define _CFGCON1_HSSPIEN_MASK                    0x00002000
#define _CFGCON1_HSSPIEN_LENGTH                  0x00000001

#define _CFGCON1_SMCLR_POSITION                  0x0000000E
#define _CFGCON1_SMCLR_MASK                      0x00004000
#define _CFGCON1_SMCLR_LENGTH                    0x00000001

#define _CFGCON1_HSUARTEN_POSITION               0x0000000F
#define _CFGCON1_HSUARTEN_MASK                   0x00008000
#define _CFGCON1_HSUARTEN_LENGTH                 0x00000001

#define _CFGCON1_USBDMTRIM_POSITION              0x00000010
#define _CFGCON1_USBDMTRIM_MASK                  0x000F0000
#define _CFGCON1_USBDMTRIM_LENGTH                0x00000004

#define _CFGCON1_USBDPTRIM_POSITION              0x00000014
#define _CFGCON1_USBDPTRIM_MASK                  0x00F00000
#define _CFGCON1_USBDPTRIM_LENGTH                0x00000004

#define _CFGCON1_WDTPS_POSITION                  0x00000018
#define _CFGCON1_WDTPS_MASK                      0x1F000000
#define _CFGCON1_WDTPS_LENGTH                    0x00000005

#define _CFGCON2_DMTINTV_POSITION                0x00000003
#define _CFGCON2_DMTINTV_MASK                    0x00000038
#define _CFGCON2_DMTINTV_LENGTH                  0x00000003

