Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CFGCON2_POSCMOD_POSITION                0x00000008
#define _CFGCON2_POSCMOD_MASK                    0x00000300
#define _CFGCON2_POSCMOD_LENGTH                  0x00000002

#define _CFGCON2_WDTRMCS_POSITION                0x0000000A
#define _CFGCON2_WDTRMCS_MASK                    0x00000C00
#define _CFGCON2_WDTRMCS_LENGTH                  0x00000002

#define _CFGCON2_SOSCSEL_POSITION                0x0000000C
#define _CFGCON2_SOSCSEL_MASK                    0x00001000
#define _CFGCON2_SOSCSEL_LENGTH                  0x00000001

#define _CFGCON2_WAKE2SPD_POSITION               0x0000000D
#define _CFGCON2_WAKE2SPD_MASK                   0x00002000
#define _CFGCON2_WAKE2SPD_LENGTH                 0x00000001

#define _CFGCON2_CKSWEN_POSITION                 0x0000000E
#define _CFGCON2_CKSWEN_MASK                     0x00004000
#define _CFGCON2_CKSWEN_LENGTH                   0x00000001

#define _CFGCON2_FSCMEN_POSITION                 0x0000000F
#define _CFGCON2_FSCMEN_MASK                     0x00008000
#define _CFGCON2_FSCMEN_LENGTH                   0x00000001

#define _CFGCON2_WDTPS_POSITION                  0x00000010
#define _CFGCON2_WDTPS_MASK                      0x001F0000
#define _CFGCON2_WDTPS_LENGTH                    0x00000005

#define _CFGCON2_WDTSPGM_POSITION                0x00000015
#define _CFGCON2_WDTSPGM_MASK                    0x00200000
#define _CFGCON2_WDTSPGM_LENGTH                  0x00000001

#define _CFGCON2_WINDIS_POSITION                 0x00000016
#define _CFGCON2_WINDIS_MASK                     0x00400000
#define _CFGCON2_WINDIS_LENGTH                   0x00000001

#define _CFGCON2_WDTEN_POSITION                  0x00000017
#define _CFGCON2_WDTEN_MASK                      0x00800000
#define _CFGCON2_WDTEN_LENGTH                    0x00000001

#define _CFGCON2_WDTWINSZ_POSITION               0x00000018
#define _CFGCON2_WDTWINSZ_MASK                   0x03000000
#define _CFGCON2_WDTWINSZ_LENGTH                 0x00000002

#define _CFGCON2_DMTCNT_POSITION                 0x0000001A
#define _CFGCON2_DMTCNT_MASK                     0x7C000000
#define _CFGCON2_DMTCNT_LENGTH                   0x00000005

#define _CFGCON2_DMTEN_POSITION                  0x0000001F
#define _CFGCON2_DMTEN_MASK                      0x80000000
#define _CFGCON2_DMTEN_LENGTH                    0x00000001

#define _CFGCON3_ETHPLLPOSTDIV2_POSITION         0x00000000
#define _CFGCON3_ETHPLLPOSTDIV2_MASK             0x0000003F
#define _CFGCON3_ETHPLLPOSTDIV2_LENGTH           0x00000006

#define _CFGCON3_SPLLPOSTDIV2_POSITION           0x00000006
#define _CFGCON3_SPLLPOSTDIV2_MASK               0x00000FC0
#define _CFGCON3_SPLLPOSTDIV2_LENGTH             0x00000006

#define _CFGCON3_BTPLLPOSTDIV2_POSITION          0x0000000C
#define _CFGCON3_BTPLLPOSTDIV2_MASK              0x0003F000
#define _CFGCON3_BTPLLPOSTDIV2_LENGTH            0x00000006

#define _CFGCON4_SOSCCFG_POSITION                0x00000000
#define _CFGCON4_SOSCCFG_MASK                    0x000000FF
#define _CFGCON4_SOSCCFG_LENGTH                  0x00000008

#define _CFGCON4_VBZPBOREN_POSITION              0x00000013
#define _CFGCON4_VBZPBOREN_MASK                  0x00080000
#define _CFGCON4_VBZPBOREN_LENGTH                0x00000001

#define _CFGCON4_DSZPBOREN_POSITION              0x00000014
#define _CFGCON4_DSZPBOREN_MASK                  0x00100000
#define _CFGCON4_DSZPBOREN_LENGTH                0x00000001

#define _CFGCON4_DSWDTPS_POSITION                0x00000015
#define _CFGCON4_DSWDTPS_MASK                    0x03E00000
#define _CFGCON4_DSWDTPS_LENGTH                  0x00000005

#define _CFGCON4_DSWDTOSC_POSITION               0x0000001A
#define _CFGCON4_DSWDTOSC_MASK                   0x04000000
#define _CFGCON4_DSWDTOSC_LENGTH                 0x00000001

#define _CFGCON4_DSWDTEN_POSITION                0x0000001B
#define _CFGCON4_DSWDTEN_MASK                    0x08000000
#define _CFGCON4_DSWDTEN_LENGTH                  0x00000001

#define _CFGCON4_DSEN_POSITION                   0x0000001C
#define _CFGCON4_DSEN_MASK                       0x10000000
#define _CFGCON4_DSEN_LENGTH                     0x00000001

#define _CFGCON4_SOSCEN_POSITION                 0x0000001E
#define _CFGCON4_SOSCEN_MASK                     0x40000000
#define _CFGCON4_SOSCEN_LENGTH                   0x00000001

#define _CFGPG_CPUPG_POSITION                    0x00000000
#define _CFGPG_CPUPG_MASK                        0x00000003
#define _CFGPG_CPUPG_LENGTH                      0x00000002

#define _CFGPG_FCPG_POSITION                     0x00000002
#define _CFGPG_FCPG_MASK                         0x0000000C
#define _CFGPG_FCPG_LENGTH                       0x00000002

#define _CFGPG_DMAPG_POSITION                    0x00000004
#define _CFGPG_DMAPG_MASK                        0x00000030
#define _CFGPG_DMAPG_LENGTH                      0x00000002

#define _CFGPG_ICDJPG_POSITION                   0x00000006
#define _CFGPG_ICDJPG_MASK                       0x000000C0
#define _CFGPG_ICDJPG_LENGTH                     0x00000002

#define _CFGPG_WIFIPG_POSITION                   0x00000008
#define _CFGPG_WIFIPG_MASK                       0x00000300
#define _CFGPG_WIFIPG_LENGTH                     0x00000002

#define _CFGPG_ADCPG_POSITION                    0x0000000A
#define _CFGPG_ADCPG_MASK                        0x00000C00
#define _CFGPG_ADCPG_LENGTH                      0x00000002

#define _CFGPG_CAN1PG_POSITION                   0x0000000C
#define _CFGPG_CAN1PG_MASK                       0x00003000
#define _CFGPG_CAN1PG_LENGTH                     0x00000002

#define _CFGPG_CAN2PG_POSITION                   0x0000000E
#define _CFGPG_CAN2PG_MASK                       0x0000C000
#define _CFGPG_CAN2PG_LENGTH                     0x00000002

#define _CFGPG_CRY1PG_POSITION                   0x00000010
#define _CFGPG_CRY1PG_MASK                       0x00030000
#define _CFGPG_CRY1PG_LENGTH                     0x00000002

#define _CFGPG_ETHPG_POSITION                    0x00000012
#define _CFGPG_ETHPG_MASK                        0x000C0000
#define _CFGPG_ETHPG_LENGTH                      0x00000002

