Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CFGPG_SQIPG_POSITION                    0x00000014
#define _CFGPG_SQIPG_MASK                        0x00300000
#define _CFGPG_SQIPG_LENGTH                      0x00000002

#define _CFGPG_USBPG_POSITION                    0x00000016
#define _CFGPG_USBPG_MASK                        0x00C00000
#define _CFGPG_USBPG_LENGTH                      0x00000002

#define _DEVID_DEVID_POSITION                    0x00000000
#define _DEVID_DEVID_MASK                        0x0FFFFFFF
#define _DEVID_DEVID_LENGTH                      0x0000001C

#define _DEVID_VER_POSITION                      0x0000001C
#define _DEVID_VER_MASK                          0xF0000000
#define _DEVID_VER_LENGTH                        0x00000004

#define _USERID_USERID_POSITION                  0x00000000
#define _USERID_USERID_MASK                      0x0000FFFF
#define _USERID_USERID_LENGTH                    0x00000010

#define _SYSKEY_SYSKEY_POSITION                  0x00000000
#define _SYSKEY_SYSKEY_MASK                      0xFFFFFFFF
#define _SYSKEY_SYSKEY_LENGTH                    0x00000020

#define _PMD1_ADCSAR0MD_POSITION                 0x00000000
#define _PMD1_ADCSAR0MD_MASK                     0x00000001
#define _PMD1_ADCSAR0MD_LENGTH                   0x00000001

#define _PMD1_ADCSARSHRMD_POSITION               0x00000007
#define _PMD1_ADCSARSHRMD_MASK                   0x00000080
#define _PMD1_ADCSARSHRMD_LENGTH                 0x00000001

#define _PMD1_ADC1MD_POSITION                    0x00000008
#define _PMD1_ADC1MD_MASK                        0x00000100
#define _PMD1_ADC1MD_LENGTH                      0x00000001

#define _PMD1_PTGMD_POSITION                     0x0000000B
#define _PMD1_PTGMD_MASK                         0x00000800
#define _PMD1_PTGMD_LENGTH                       0x00000001

#define _PMD1_CVD1MD_POSITION                    0x0000000F
#define _PMD1_CVD1MD_MASK                        0x00008000
#define _PMD1_CVD1MD_LENGTH                      0x00000001

#define _PMD1_RTCC1MD_POSITION                   0x00000010
#define _PMD1_RTCC1MD_MASK                       0x00010000
#define _PMD1_RTCC1MD_LENGTH                     0x00000001

#define _PMD1_DMA1MD_POSITION                    0x00000013
#define _PMD1_DMA1MD_MASK                        0x00080000
#define _PMD1_DMA1MD_LENGTH                      0x00000001

#define _PMD1_BA414MD_POSITION                   0x00000017
#define _PMD1_BA414MD_MASK                       0x00800000
#define _PMD1_BA414MD_LENGTH                     0x00000001

#define _PMD1_CRYPT1MD_POSITION                  0x00000018
#define _PMD1_CRYPT1MD_MASK                      0x01000000
#define _PMD1_CRYPT1MD_LENGTH                    0x00000001

#define _PMD1_RNG1MD_POSITION                    0x0000001A
#define _PMD1_RNG1MD_MASK                        0x04000000
#define _PMD1_RNG1MD_LENGTH                      0x00000001

#define _PMD1_SQI1MD_POSITION                    0x0000001D
#define _PMD1_SQI1MD_MASK                        0x20000000
#define _PMD1_SQI1MD_LENGTH                      0x00000001

#define _PMD2_IC1MD_POSITION                     0x00000000
#define _PMD2_IC1MD_MASK                         0x00000001
#define _PMD2_IC1MD_LENGTH                       0x00000001

#define _PMD2_IC2MD_POSITION                     0x00000001
#define _PMD2_IC2MD_MASK                         0x00000002
#define _PMD2_IC2MD_LENGTH                       0x00000001

#define _PMD2_IC3MD_POSITION                     0x00000002
#define _PMD2_IC3MD_MASK                         0x00000004
#define _PMD2_IC3MD_LENGTH                       0x00000001

#define _PMD2_IC4MD_POSITION                     0x00000003
#define _PMD2_IC4MD_MASK                         0x00000008
#define _PMD2_IC4MD_LENGTH                       0x00000001

#define _PMD2_OC1MD_POSITION                     0x00000008
#define _PMD2_OC1MD_MASK                         0x00000100
#define _PMD2_OC1MD_LENGTH                       0x00000001

#define _PMD2_OC2MD_POSITION                     0x00000009
#define _PMD2_OC2MD_MASK                         0x00000200
#define _PMD2_OC2MD_LENGTH                       0x00000001

#define _PMD2_OC3MD_POSITION                     0x0000000A
#define _PMD2_OC3MD_MASK                         0x00000400
#define _PMD2_OC3MD_LENGTH                       0x00000001

#define _PMD2_OC4MD_POSITION                     0x0000000B
#define _PMD2_OC4MD_MASK                         0x00000800
#define _PMD2_OC4MD_LENGTH                       0x00000001

#define _PMD2_T1MD_POSITION                      0x00000010
#define _PMD2_T1MD_MASK                          0x00010000
#define _PMD2_T1MD_LENGTH                        0x00000001

#define _PMD2_T2MD_POSITION                      0x00000011
#define _PMD2_T2MD_MASK                          0x00020000
#define _PMD2_T2MD_LENGTH                        0x00000001

#define _PMD2_T3MD_POSITION                      0x00000012
#define _PMD2_T3MD_MASK                          0x00040000
#define _PMD2_T3MD_LENGTH                        0x00000001

#define _PMD2_T4MD_POSITION                      0x00000013
#define _PMD2_T4MD_MASK                          0x00080000
#define _PMD2_T4MD_LENGTH                        0x00000001

#define _PMD2_T5MD_POSITION                      0x00000014
#define _PMD2_T5MD_MASK                          0x00100000
#define _PMD2_T5MD_LENGTH                        0x00000001

#define _PMD2_T6MD_POSITION                      0x00000015
#define _PMD2_T6MD_MASK                          0x00200000
#define _PMD2_T6MD_LENGTH                        0x00000001

#define _PMD2_T7MD_POSITION                      0x00000016
#define _PMD2_T7MD_MASK                          0x00400000
#define _PMD2_T7MD_LENGTH                        0x00000001

#define _PMD2_REFO1MD_POSITION                   0x0000001C
#define _PMD2_REFO1MD_MASK                       0x10000000
#define _PMD2_REFO1MD_LENGTH                     0x00000001

#define _PMD2_REFO2MD_POSITION                   0x0000001D
#define _PMD2_REFO2MD_MASK                       0x20000000
#define _PMD2_REFO2MD_LENGTH                     0x00000001

#define _PMD2_REFO3MD_POSITION                   0x0000001E
#define _PMD2_REFO3MD_MASK                       0x40000000
#define _PMD2_REFO3MD_LENGTH                     0x00000001

#define _PMD2_REFO4MD_POSITION                   0x0000001F
#define _PMD2_REFO4MD_MASK                       0x80000000
#define _PMD2_REFO4MD_LENGTH                     0x00000001

#define _PMD3_U1MD_POSITION                      0x00000000
#define _PMD3_U1MD_MASK                          0x00000001
#define _PMD3_U1MD_LENGTH                        0x00000001

#define _PMD3_U2MD_POSITION                      0x00000001
#define _PMD3_U2MD_MASK                          0x00000002
#define _PMD3_U2MD_LENGTH                        0x00000001

#define _PMD3_U3MD_POSITION                      0x00000002
#define _PMD3_U3MD_MASK                          0x00000004
#define _PMD3_U3MD_LENGTH                        0x00000001

#define _PMD3_ETH1MD_POSITION                    0x00000004
#define _PMD3_ETH1MD_MASK                        0x00000010
#define _PMD3_ETH1MD_LENGTH                      0x00000001

#define _PMD3_SPI1MD_POSITION                    0x00000008
#define _PMD3_SPI1MD_MASK                        0x00000100
#define _PMD3_SPI1MD_LENGTH                      0x00000001

