Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _REFO1CON_OE_POSITION                    0x0000000C
#define _REFO1CON_OE_MASK                        0x00001000
#define _REFO1CON_OE_LENGTH                      0x00000001

#define _REFO1CON_SIDL_POSITION                  0x0000000D
#define _REFO1CON_SIDL_MASK                      0x00002000
#define _REFO1CON_SIDL_LENGTH                    0x00000001

#define _REFO1CON_ON_POSITION                    0x0000000F
#define _REFO1CON_ON_MASK                        0x00008000
#define _REFO1CON_ON_LENGTH                      0x00000001

#define _REFO1CON_RODIV_POSITION                 0x00000010
#define _REFO1CON_RODIV_MASK                     0x7FFF0000
#define _REFO1CON_RODIV_LENGTH                   0x0000000F

#define _REFO1TRIM_ROTRIM_POSITION               0x00000017
#define _REFO1TRIM_ROTRIM_MASK                   0xFF800000
#define _REFO1TRIM_ROTRIM_LENGTH                 0x00000009

#define _REFO2CON_ROSEL_POSITION                 0x00000000
#define _REFO2CON_ROSEL_MASK                     0x0000000F
#define _REFO2CON_ROSEL_LENGTH                   0x00000004

#define _REFO2CON_ACTIVE_POSITION                0x00000008
#define _REFO2CON_ACTIVE_MASK                    0x00000100
#define _REFO2CON_ACTIVE_LENGTH                  0x00000001

#define _REFO2CON_DIVSWEN_POSITION               0x00000009
#define _REFO2CON_DIVSWEN_MASK                   0x00000200
#define _REFO2CON_DIVSWEN_LENGTH                 0x00000001

#define _REFO2CON_RSLP_POSITION                  0x0000000B
#define _REFO2CON_RSLP_MASK                      0x00000800
#define _REFO2CON_RSLP_LENGTH                    0x00000001

#define _REFO2CON_OE_POSITION                    0x0000000C
#define _REFO2CON_OE_MASK                        0x00001000
#define _REFO2CON_OE_LENGTH                      0x00000001

#define _REFO2CON_SIDL_POSITION                  0x0000000D
#define _REFO2CON_SIDL_MASK                      0x00002000
#define _REFO2CON_SIDL_LENGTH                    0x00000001

#define _REFO2CON_ON_POSITION                    0x0000000F
#define _REFO2CON_ON_MASK                        0x00008000
#define _REFO2CON_ON_LENGTH                      0x00000001

#define _REFO2CON_RODIV_POSITION                 0x00000010
#define _REFO2CON_RODIV_MASK                     0x7FFF0000
#define _REFO2CON_RODIV_LENGTH                   0x0000000F

#define _REFO2TRIM_ROTRIM_POSITION               0x00000017
#define _REFO2TRIM_ROTRIM_MASK                   0xFF800000
#define _REFO2TRIM_ROTRIM_LENGTH                 0x00000009

#define _REFO3CON_ROSEL_POSITION                 0x00000000
#define _REFO3CON_ROSEL_MASK                     0x0000000F
#define _REFO3CON_ROSEL_LENGTH                   0x00000004

#define _REFO3CON_ACTIVE_POSITION                0x00000008
#define _REFO3CON_ACTIVE_MASK                    0x00000100
#define _REFO3CON_ACTIVE_LENGTH                  0x00000001

#define _REFO3CON_DIVSWEN_POSITION               0x00000009
#define _REFO3CON_DIVSWEN_MASK                   0x00000200
#define _REFO3CON_DIVSWEN_LENGTH                 0x00000001

#define _REFO3CON_RSLP_POSITION                  0x0000000B
#define _REFO3CON_RSLP_MASK                      0x00000800
#define _REFO3CON_RSLP_LENGTH                    0x00000001

#define _REFO3CON_OE_POSITION                    0x0000000C
#define _REFO3CON_OE_MASK                        0x00001000
#define _REFO3CON_OE_LENGTH                      0x00000001

#define _REFO3CON_SIDL_POSITION                  0x0000000D
#define _REFO3CON_SIDL_MASK                      0x00002000
#define _REFO3CON_SIDL_LENGTH                    0x00000001

#define _REFO3CON_ON_POSITION                    0x0000000F
#define _REFO3CON_ON_MASK                        0x00008000
#define _REFO3CON_ON_LENGTH                      0x00000001

#define _REFO3CON_RODIV_POSITION                 0x00000010
#define _REFO3CON_RODIV_MASK                     0x7FFF0000
#define _REFO3CON_RODIV_LENGTH                   0x0000000F

#define _REFO3TRIM_ROTRIM_POSITION               0x00000017
#define _REFO3TRIM_ROTRIM_MASK                   0xFF800000
#define _REFO3TRIM_ROTRIM_LENGTH                 0x00000009

#define _REFO4CON_ROSEL_POSITION                 0x00000000
#define _REFO4CON_ROSEL_MASK                     0x0000000F
#define _REFO4CON_ROSEL_LENGTH                   0x00000004

#define _REFO4CON_ACTIVE_POSITION                0x00000008
#define _REFO4CON_ACTIVE_MASK                    0x00000100
#define _REFO4CON_ACTIVE_LENGTH                  0x00000001

#define _REFO4CON_DIVSWEN_POSITION               0x00000009
#define _REFO4CON_DIVSWEN_MASK                   0x00000200
#define _REFO4CON_DIVSWEN_LENGTH                 0x00000001

#define _REFO4CON_RSLP_POSITION                  0x0000000B
#define _REFO4CON_RSLP_MASK                      0x00000800
#define _REFO4CON_RSLP_LENGTH                    0x00000001

#define _REFO4CON_OE_POSITION                    0x0000000C
#define _REFO4CON_OE_MASK                        0x00001000
#define _REFO4CON_OE_LENGTH                      0x00000001

#define _REFO4CON_SIDL_POSITION                  0x0000000D
#define _REFO4CON_SIDL_MASK                      0x00002000
#define _REFO4CON_SIDL_LENGTH                    0x00000001

#define _REFO4CON_ON_POSITION                    0x0000000F
#define _REFO4CON_ON_MASK                        0x00008000
#define _REFO4CON_ON_LENGTH                      0x00000001

#define _REFO4CON_RODIV_POSITION                 0x00000010
#define _REFO4CON_RODIV_MASK                     0x7FFF0000
#define _REFO4CON_RODIV_LENGTH                   0x0000000F

#define _REFO4TRIM_ROTRIM_POSITION               0x00000017
#define _REFO4TRIM_ROTRIM_MASK                   0xFF800000
#define _REFO4TRIM_ROTRIM_LENGTH                 0x00000009

#define _PB1DIV_PBDIV_POSITION                   0x00000000
#define _PB1DIV_PBDIV_MASK                       0x0000007F
#define _PB1DIV_PBDIV_LENGTH                     0x00000007

#define _PB1DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB1DIV_PBDIVRDY_MASK                    0x00000800
#define _PB1DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB1DIV_PB1DIVON_POSITION                0x0000000F
#define _PB1DIV_PB1DIVON_MASK                    0x00008000
#define _PB1DIV_PB1DIVON_LENGTH                  0x00000001

#define _PB2DIV_PBDIV_POSITION                   0x00000000
#define _PB2DIV_PBDIV_MASK                       0x0000007F
#define _PB2DIV_PBDIV_LENGTH                     0x00000007

