Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _PB2DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB2DIV_PBDIVRDY_MASK                    0x00000800
#define _PB2DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB2DIV_PB2DIVON_POSITION                0x0000000F
#define _PB2DIV_PB2DIVON_MASK                    0x00008000
#define _PB2DIV_PB2DIVON_LENGTH                  0x00000001

#define _PB3DIV_PBDIV_POSITION                   0x00000000
#define _PB3DIV_PBDIV_MASK                       0x0000007F
#define _PB3DIV_PBDIV_LENGTH                     0x00000007

#define _PB3DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB3DIV_PBDIVRDY_MASK                    0x00000800
#define _PB3DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB3DIV_PB3DIVON_POSITION                0x0000000F
#define _PB3DIV_PB3DIVON_MASK                    0x00008000
#define _PB3DIV_PB3DIVON_LENGTH                  0x00000001

#define _PB4DIV_PBDIV_POSITION                   0x00000000
#define _PB4DIV_PBDIV_MASK                       0x0000007F
#define _PB4DIV_PBDIV_LENGTH                     0x00000007

#define _PB4DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB4DIV_PBDIVRDY_MASK                    0x00000800
#define _PB4DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB4DIV_PB4DIVON_POSITION                0x0000000F
#define _PB4DIV_PB4DIVON_MASK                    0x00008000
#define _PB4DIV_PB4DIVON_LENGTH                  0x00000001

#define _PB5DIV_PBDIV_POSITION                   0x00000000
#define _PB5DIV_PBDIV_MASK                       0x0000007F
#define _PB5DIV_PBDIV_LENGTH                     0x00000007

#define _PB5DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB5DIV_PBDIVRDY_MASK                    0x00000800
#define _PB5DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB5DIV_PB5DIVON_POSITION                0x0000000F
#define _PB5DIV_PB5DIVON_MASK                    0x00008000
#define _PB5DIV_PB5DIVON_LENGTH                  0x00000001

#define _PB6DIV_PBDIV_POSITION                   0x00000000
#define _PB6DIV_PBDIV_MASK                       0x0000007F
#define _PB6DIV_PBDIV_LENGTH                     0x00000007

#define _PB6DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB6DIV_PBDIVRDY_MASK                    0x00000800
#define _PB6DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB6DIV_PB6DIVON_POSITION                0x0000000F
#define _PB6DIV_PB6DIVON_MASK                    0x00008000
#define _PB6DIV_PB6DIVON_LENGTH                  0x00000001

#define _SLEWCON_BUSY_POSITION                   0x00000000
#define _SLEWCON_BUSY_MASK                       0x00000001
#define _SLEWCON_BUSY_LENGTH                     0x00000001

#define _SLEWCON_DNEN_POSITION                   0x00000001
#define _SLEWCON_DNEN_MASK                       0x00000002
#define _SLEWCON_DNEN_LENGTH                     0x00000001

#define _SLEWCON_UPEN_POSITION                   0x00000002
#define _SLEWCON_UPEN_MASK                       0x00000004
#define _SLEWCON_UPEN_LENGTH                     0x00000001

#define _SLEWCON_SLWDIV_POSITION                 0x00000008
#define _SLEWCON_SLWDIV_MASK                     0x00000700
#define _SLEWCON_SLWDIV_LENGTH                   0x00000003

#define _SLEWCON_SYSDIV_POSITION                 0x00000010
#define _SLEWCON_SYSDIV_MASK                     0x000F0000
#define _SLEWCON_SYSDIV_LENGTH                   0x00000004

#define _SLEWCON_SLWDLY_POSITION                 0x00000018
#define _SLEWCON_SLWDLY_MASK                     0x0F000000
#define _SLEWCON_SLWDLY_LENGTH                   0x00000004

#define _CLKSTAT_FRCRDY_POSITION                 0x00000000
#define _CLKSTAT_FRCRDY_MASK                     0x00000001
#define _CLKSTAT_FRCRDY_LENGTH                   0x00000001

#define _CLKSTAT_SPLLRDY_POSITION                0x00000001
#define _CLKSTAT_SPLLRDY_MASK                    0x00000002
#define _CLKSTAT_SPLLRDY_LENGTH                  0x00000001

#define _CLKSTAT_POSCRDY_POSITION                0x00000002
#define _CLKSTAT_POSCRDY_MASK                    0x00000004
#define _CLKSTAT_POSCRDY_LENGTH                  0x00000001

#define _CLKSTAT_UPLLRDY_POSITION                0x00000003
#define _CLKSTAT_UPLLRDY_MASK                    0x00000008
#define _CLKSTAT_UPLLRDY_LENGTH                  0x00000001

#define _CLKSTAT_SOSCRDY_POSITION                0x00000004
#define _CLKSTAT_SOSCRDY_MASK                    0x00000010
#define _CLKSTAT_SOSCRDY_LENGTH                  0x00000001

#define _CLKSTAT_LPRCRDY_POSITION                0x00000005
#define _CLKSTAT_LPRCRDY_MASK                    0x00000020
#define _CLKSTAT_LPRCRDY_LENGTH                  0x00000001

#define _CLKSTAT_BTPLLRDY_POSITION               0x00000006
#define _CLKSTAT_BTPLLRDY_MASK                   0x00000040
#define _CLKSTAT_BTPLLRDY_LENGTH                 0x00000001

#define _CLKSTAT_ETHPLLRDY_POSITION              0x00000007
#define _CLKSTAT_ETHPLLRDY_MASK                  0x00000080
#define _CLKSTAT_ETHPLLRDY_LENGTH                0x00000001

#define _CLKSTAT_WIFICLKRDY_POSITION             0x00000008
#define _CLKSTAT_WIFICLKRDY_MASK                 0x00000100
#define _CLKSTAT_WIFICLKRDY_LENGTH               0x00000001

#define _CLKSTAT_SPLLALTRDY_POSITION             0x00000009
#define _CLKSTAT_SPLLALTRDY_MASK                 0x00000200
#define _CLKSTAT_SPLLALTRDY_LENGTH               0x00000001

#define _CLKSTAT_PB1CLKRDY_POSITION              0x0000000A
#define _CLKSTAT_PB1CLKRDY_MASK                  0x00000400
#define _CLKSTAT_PB1CLKRDY_LENGTH                0x00000001

#define _CLKSTAT_SYSCLKRDY_POSITION              0x0000000B
#define _CLKSTAT_SYSCLKRDY_MASK                  0x00000800
#define _CLKSTAT_SYSCLKRDY_LENGTH                0x00000001

#define _CLKDIAG_POSCSTOP_POSITION               0x00000000
#define _CLKDIAG_POSCSTOP_MASK                   0x00000001
#define _CLKDIAG_POSCSTOP_LENGTH                 0x00000001

#define _CLKDIAG_SOSCSTOP_POSITION               0x00000001
#define _CLKDIAG_SOSCSTOP_MASK                   0x00000002
#define _CLKDIAG_SOSCSTOP_LENGTH                 0x00000001

#define _CLKDIAG_FRCSTOP_POSITION                0x00000002
#define _CLKDIAG_FRCSTOP_MASK                    0x00000004
#define _CLKDIAG_FRCSTOP_LENGTH                  0x00000001

