Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IFS4_PTGWDTIF_POSITION                  0x00000019
#define _IFS4_PTGWDTIF_MASK                      0x02000000
#define _IFS4_PTGWDTIF_LENGTH                    0x00000001

#define _IFS4_PTG0TR0IF_POSITION                 0x0000001A
#define _IFS4_PTG0TR0IF_MASK                     0x04000000
#define _IFS4_PTG0TR0IF_LENGTH                   0x00000001

#define _IFS4_PTG0TR1IF_POSITION                 0x0000001B
#define _IFS4_PTG0TR1IF_MASK                     0x08000000
#define _IFS4_PTG0TR1IF_LENGTH                   0x00000001

#define _IFS4_PTG0TR2IF_POSITION                 0x0000001C
#define _IFS4_PTG0TR2IF_MASK                     0x10000000
#define _IFS4_PTG0TR2IF_LENGTH                   0x00000001

#define _IFS4_PTG0TR3IF_POSITION                 0x0000001D
#define _IFS4_PTG0TR3IF_MASK                     0x20000000
#define _IFS4_PTG0TR3IF_LENGTH                   0x00000001

#define _IFS5_MPUPCIF_POSITION                   0x00000002
#define _IFS5_MPUPCIF_MASK                       0x00000004
#define _IFS5_MPUPCIF_LENGTH                     0x00000001

#define _IFS5_FDCIF_POSITION                     0x00000003
#define _IFS5_FDCIF_MASK                         0x00000008
#define _IFS5_FDCIF_LENGTH                       0x00000001

#define _IFS5_CRPTIF_POSITION                    0x00000004
#define _IFS5_CRPTIF_MASK                        0x00000010
#define _IFS5_CRPTIF_LENGTH                      0x00000001

#define _IFS5_ETHIF_POSITION                     0x00000005
#define _IFS5_ETHIF_MASK                         0x00000020
#define _IFS5_ETHIF_LENGTH                       0x00000001

#define _IFS5_CRPT1IF_POSITION                   0x00000006
#define _IFS5_CRPT1IF_MASK                       0x00000040
#define _IFS5_CRPT1IF_LENGTH                     0x00000001

#define _IFS5_CRPT1EIF_POSITION                  0x00000007
#define _IFS5_CRPT1EIF_MASK                      0x00000080
#define _IFS5_CRPT1EIF_LENGTH                    0x00000001

#define _IFS5_w_POSITION                         0x00000000
#define _IFS5_w_MASK                             0xFFFFFFFF
#define _IFS5_w_LENGTH                           0x00000020

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000004
#define _IEC0_T1IE_MASK                          0x00000010
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC1EIE_POSITION                    0x00000005
#define _IEC0_IC1EIE_MASK                        0x00000020
#define _IEC0_IC1EIE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000006
#define _IEC0_IC1IE_MASK                         0x00000040
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000007
#define _IEC0_OC1IE_MASK                         0x00000080
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_INT1IE_POSITION                    0x00000008
#define _IEC0_INT1IE_MASK                        0x00000100
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC0_T2IE_POSITION                      0x00000009
#define _IEC0_T2IE_MASK                          0x00000200
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_IC2EIE_POSITION                    0x0000000A
#define _IEC0_IC2EIE_MASK                        0x00000400
#define _IEC0_IC2EIE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x0000000B
#define _IEC0_IC2IE_MASK                         0x00000800
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x0000000C
#define _IEC0_OC2IE_MASK                         0x00001000
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_INT2IE_POSITION                    0x0000000D
#define _IEC0_INT2IE_MASK                        0x00002000
#define _IEC0_INT2IE_LENGTH                      0x00000001

#define _IEC0_T3IE_POSITION                      0x0000000E
#define _IEC0_T3IE_MASK                          0x00004000
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_IC3EIE_POSITION                    0x0000000F
#define _IEC0_IC3EIE_MASK                        0x00008000
#define _IEC0_IC3EIE_LENGTH                      0x00000001

#define _IEC0_IC3IE_POSITION                     0x00000010
#define _IEC0_IC3IE_MASK                         0x00010000
#define _IEC0_IC3IE_LENGTH                       0x00000001

#define _IEC0_OC3IE_POSITION                     0x00000011
#define _IEC0_OC3IE_MASK                         0x00020000
#define _IEC0_OC3IE_LENGTH                       0x00000001

#define _IEC0_INT3IE_POSITION                    0x00000012
#define _IEC0_INT3IE_MASK                        0x00040000
#define _IEC0_INT3IE_LENGTH                      0x00000001

#define _IEC0_T4IE_POSITION                      0x00000013
#define _IEC0_T4IE_MASK                          0x00080000
#define _IEC0_T4IE_LENGTH                        0x00000001

#define _IEC0_IC4EIE_POSITION                    0x00000014
#define _IEC0_IC4EIE_MASK                        0x00100000
#define _IEC0_IC4EIE_LENGTH                      0x00000001

#define _IEC0_IC4IE_POSITION                     0x00000015
#define _IEC0_IC4IE_MASK                         0x00200000
#define _IEC0_IC4IE_LENGTH                       0x00000001

