Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IEC0_OC4IE_POSITION                     0x00000016
#define _IEC0_OC4IE_MASK                         0x00400000
#define _IEC0_OC4IE_LENGTH                       0x00000001

#define _IEC0_INT4IE_POSITION                    0x00000017
#define _IEC0_INT4IE_MASK                        0x00800000
#define _IEC0_INT4IE_LENGTH                      0x00000001

#define _IEC0_T5IE_POSITION                      0x00000018
#define _IEC0_T5IE_MASK                          0x01000000
#define _IEC0_T5IE_LENGTH                        0x00000001

#define _IEC0_FCEIE_POSITION                     0x0000001E
#define _IEC0_FCEIE_MASK                         0x40000000
#define _IEC0_FCEIE_LENGTH                       0x00000001

#define _IEC0_PREIE_POSITION                     0x0000001F
#define _IEC0_PREIE_MASK                         0x80000000
#define _IEC0_PREIE_LENGTH                       0x00000001

#define _IEC1_PFWCRCIE_POSITION                  0x00000000
#define _IEC1_PFWCRCIE_MASK                      0x00000001
#define _IEC1_PFWCRCIE_LENGTH                    0x00000001

#define _IEC1_RTCCIE_POSITION                    0x00000001
#define _IEC1_RTCCIE_MASK                        0x00000002
#define _IEC1_RTCCIE_LENGTH                      0x00000001

#define _IEC1_USBIE_POSITION                     0x00000002
#define _IEC1_USBIE_MASK                         0x00000004
#define _IEC1_USBIE_LENGTH                       0x00000001

#define _IEC1_SPI1EIE_POSITION                   0x00000003
#define _IEC1_SPI1EIE_MASK                       0x00000008
#define _IEC1_SPI1EIE_LENGTH                     0x00000001

#define _IEC1_SPI1RXIE_POSITION                  0x00000004
#define _IEC1_SPI1RXIE_MASK                      0x00000010
#define _IEC1_SPI1RXIE_LENGTH                    0x00000001

#define _IEC1_SPI1TXIE_POSITION                  0x00000005
#define _IEC1_SPI1TXIE_MASK                      0x00000020
#define _IEC1_SPI1TXIE_LENGTH                    0x00000001

#define _IEC1_U1EIE_POSITION                     0x00000006
#define _IEC1_U1EIE_MASK                         0x00000040
#define _IEC1_U1EIE_LENGTH                       0x00000001

#define _IEC1_U1RXIE_POSITION                    0x00000007
#define _IEC1_U1RXIE_MASK                        0x00000080
#define _IEC1_U1RXIE_LENGTH                      0x00000001

#define _IEC1_U1TXIE_POSITION                    0x00000008
#define _IEC1_U1TXIE_MASK                        0x00000100
#define _IEC1_U1TXIE_LENGTH                      0x00000001

#define _IEC1_I2C1BIE_POSITION                   0x00000009
#define _IEC1_I2C1BIE_MASK                       0x00000200
#define _IEC1_I2C1BIE_LENGTH                     0x00000001

#define _IEC1_I2C1SIE_POSITION                   0x0000000A
#define _IEC1_I2C1SIE_MASK                       0x00000400
#define _IEC1_I2C1SIE_LENGTH                     0x00000001

#define _IEC1_I2C1MIE_POSITION                   0x0000000B
#define _IEC1_I2C1MIE_MASK                       0x00000800
#define _IEC1_I2C1MIE_LENGTH                     0x00000001

#define _IEC1_CNAIE_POSITION                     0x0000000C
#define _IEC1_CNAIE_MASK                         0x00001000
#define _IEC1_CNAIE_LENGTH                       0x00000001

#define _IEC1_CNBIE_POSITION                     0x0000000D
#define _IEC1_CNBIE_MASK                         0x00002000
#define _IEC1_CNBIE_LENGTH                       0x00000001

#define _IEC1_CNCIE_POSITION                     0x0000000E
#define _IEC1_CNCIE_MASK                         0x00004000
#define _IEC1_CNCIE_LENGTH                       0x00000001

#define _IEC1_CNKIE_POSITION                     0x0000000F
#define _IEC1_CNKIE_MASK                         0x00008000
#define _IEC1_CNKIE_LENGTH                       0x00000001

#define _IEC1_SPI2EIE_POSITION                   0x00000015
#define _IEC1_SPI2EIE_MASK                       0x00200000
#define _IEC1_SPI2EIE_LENGTH                     0x00000001

#define _IEC1_SPI2RXIE_POSITION                  0x00000016
#define _IEC1_SPI2RXIE_MASK                      0x00400000
#define _IEC1_SPI2RXIE_LENGTH                    0x00000001

#define _IEC1_SPI2TXIE_POSITION                  0x00000017
#define _IEC1_SPI2TXIE_MASK                      0x00800000
#define _IEC1_SPI2TXIE_LENGTH                    0x00000001

#define _IEC1_U2EIE_POSITION                     0x00000018
#define _IEC1_U2EIE_MASK                         0x01000000
#define _IEC1_U2EIE_LENGTH                       0x00000001

#define _IEC1_U2RXIE_POSITION                    0x00000019
#define _IEC1_U2RXIE_MASK                        0x02000000
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x0000001A
#define _IEC1_U2TXIE_MASK                        0x04000000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_I2C2BIE_POSITION                   0x0000001B
#define _IEC1_I2C2BIE_MASK                       0x08000000
#define _IEC1_I2C2BIE_LENGTH                     0x00000001

#define _IEC1_I2C2SIE_POSITION                   0x0000001C
#define _IEC1_I2C2SIE_MASK                       0x10000000
#define _IEC1_I2C2SIE_LENGTH                     0x00000001

#define _IEC1_I2C2MIE_POSITION                   0x0000001D
#define _IEC1_I2C2MIE_MASK                       0x20000000
#define _IEC1_I2C2MIE_LENGTH                     0x00000001

#define _IEC1_U3EIE_POSITION                     0x0000001E
#define _IEC1_U3EIE_MASK                         0x40000000
#define _IEC1_U3EIE_LENGTH                       0x00000001

#define _IEC1_U3RXIE_POSITION                    0x0000001F
#define _IEC1_U3RXIE_MASK                        0x80000000
#define _IEC1_U3RXIE_LENGTH                      0x00000001

#define _IEC2_U3TXIE_POSITION                    0x00000000
#define _IEC2_U3TXIE_MASK                        0x00000001
#define _IEC2_U3TXIE_LENGTH                      0x00000001

#define _IEC2_DMA0IE_POSITION                    0x00000004
#define _IEC2_DMA0IE_MASK                        0x00000010
#define _IEC2_DMA0IE_LENGTH                      0x00000001

#define _IEC2_DMA1IE_POSITION                    0x00000005
#define _IEC2_DMA1IE_MASK                        0x00000020
#define _IEC2_DMA1IE_LENGTH                      0x00000001

#define _IEC2_DMA2IE_POSITION                    0x00000006
#define _IEC2_DMA2IE_MASK                        0x00000040
#define _IEC2_DMA2IE_LENGTH                      0x00000001

#define _IEC2_DMA3IE_POSITION                    0x00000007
#define _IEC2_DMA3IE_MASK                        0x00000080
#define _IEC2_DMA3IE_LENGTH                      0x00000001

#define _IEC2_DMA4IE_POSITION                    0x00000008
#define _IEC2_DMA4IE_MASK                        0x00000100
#define _IEC2_DMA4IE_LENGTH                      0x00000001

#define _IEC2_DMA5IE_POSITION                    0x00000009
#define _IEC2_DMA5IE_MASK                        0x00000200
#define _IEC2_DMA5IE_LENGTH                      0x00000001

#define _IEC2_DMA6IE_POSITION                    0x0000000A
#define _IEC2_DMA6IE_MASK                        0x00000400
#define _IEC2_DMA6IE_LENGTH                      0x00000001

#define _IEC2_DMA7IE_POSITION                    0x0000000B
#define _IEC2_DMA7IE_MASK                        0x00000800
#define _IEC2_DMA7IE_LENGTH                      0x00000001

#define _IEC2_T6IE_POSITION                      0x0000000C
#define _IEC2_T6IE_MASK                          0x00001000
#define _IEC2_T6IE_LENGTH                        0x00000001

#define _IEC2_T7IE_POSITION                      0x00000010
#define _IEC2_T7IE_MASK                          0x00010000
#define _IEC2_T7IE_LENGTH                        0x00000001

