Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IEC2_RFSMCIE_POSITION                   0x00000013
#define _IEC2_RFSMCIE_MASK                       0x00080000
#define _IEC2_RFSMCIE_LENGTH                     0x00000001

#define _IEC2_RFMACIE_POSITION                   0x00000014
#define _IEC2_RFMACIE_MASK                       0x00100000
#define _IEC2_RFMACIE_LENGTH                     0x00000001

#define _IEC2_CTREVIE_POSITION                   0x00000015
#define _IEC2_CTREVIE_MASK                       0x00200000
#define _IEC2_CTREVIE_LENGTH                     0x00000001

#define _IEC2_RFTM0IE_POSITION                   0x00000016
#define _IEC2_RFTM0IE_MASK                       0x00400000
#define _IEC2_RFTM0IE_LENGTH                     0x00000001

#define _IEC2_RFTM1IE_POSITION                   0x00000017
#define _IEC2_RFTM1IE_MASK                       0x00800000
#define _IEC2_RFTM1IE_LENGTH                     0x00000001

#define _IEC2_RFTM2IE_POSITION                   0x00000018
#define _IEC2_RFTM2IE_MASK                       0x01000000
#define _IEC2_RFTM2IE_LENGTH                     0x00000001

#define _IEC2_RFTM3IE_POSITION                   0x00000019
#define _IEC2_RFTM3IE_MASK                       0x02000000
#define _IEC2_RFTM3IE_LENGTH                     0x00000001

#define _IEC2_CTRTRGIE_POSITION                  0x0000001A
#define _IEC2_CTRTRGIE_MASK                      0x04000000
#define _IEC2_CTRTRGIE_LENGTH                    0x00000001

#define _IEC2_RFWCOEIE_POSITION                  0x0000001B
#define _IEC2_RFWCOEIE_MASK                      0x08000000
#define _IEC2_RFWCOEIE_LENGTH                    0x00000001

#define _IEC2_ADCIE_POSITION                     0x0000001C
#define _IEC2_ADCIE_MASK                         0x10000000
#define _IEC2_ADCIE_LENGTH                       0x00000001

#define _IEC2_ADCDC1IE_POSITION                  0x0000001E
#define _IEC2_ADCDC1IE_MASK                      0x40000000
#define _IEC2_ADCDC1IE_LENGTH                    0x00000001

#define _IEC2_ADCDC2IE_POSITION                  0x0000001F
#define _IEC2_ADCDC2IE_MASK                      0x80000000
#define _IEC2_ADCDC2IE_LENGTH                    0x00000001

#define _IEC3_ADCDF1IE_POSITION                  0x00000000
#define _IEC3_ADCDF1IE_MASK                      0x00000001
#define _IEC3_ADCDF1IE_LENGTH                    0x00000001

#define _IEC3_ADCDF2IE_POSITION                  0x00000001
#define _IEC3_ADCDF2IE_MASK                      0x00000002
#define _IEC3_ADCDF2IE_LENGTH                    0x00000001

#define _IEC3_ADCFLTIE_POSITION                  0x00000004
#define _IEC3_ADCFLTIE_MASK                      0x00000010
#define _IEC3_ADCFLTIE_LENGTH                    0x00000001

#define _IEC3_ADCEOSIE_POSITION                  0x00000005
#define _IEC3_ADCEOSIE_MASK                      0x00000020
#define _IEC3_ADCEOSIE_LENGTH                    0x00000001

#define _IEC3_ADCARDYIE_POSITION                 0x00000006
#define _IEC3_ADCARDYIE_MASK                     0x00000040
#define _IEC3_ADCARDYIE_LENGTH                   0x00000001

#define _IEC3_ADCURDYIE_POSITION                 0x00000007
#define _IEC3_ADCURDYIE_MASK                     0x00000080
#define _IEC3_ADCURDYIE_LENGTH                   0x00000001

#define _IEC3_ADCFCBTIE_POSITION                 0x00000008
#define _IEC3_ADCFCBTIE_MASK                     0x00000100
#define _IEC3_ADCFCBTIE_LENGTH                   0x00000001

#define _IEC3_ADCD0IE_POSITION                   0x0000000A
#define _IEC3_ADCD0IE_MASK                       0x00000400
#define _IEC3_ADCD0IE_LENGTH                     0x00000001

#define _IEC3_ADCD1IE_POSITION                   0x0000000B
#define _IEC3_ADCD1IE_MASK                       0x00000800
#define _IEC3_ADCD1IE_LENGTH                     0x00000001

#define _IEC3_ADCD2IE_POSITION                   0x0000000C
#define _IEC3_ADCD2IE_MASK                       0x00001000
#define _IEC3_ADCD2IE_LENGTH                     0x00000001

#define _IEC3_ADCD3IE_POSITION                   0x0000000D
#define _IEC3_ADCD3IE_MASK                       0x00002000
#define _IEC3_ADCD3IE_LENGTH                     0x00000001

#define _IEC3_ADCD4IE_POSITION                   0x0000000E
#define _IEC3_ADCD4IE_MASK                       0x00004000
#define _IEC3_ADCD4IE_LENGTH                     0x00000001

#define _IEC3_ADCD5IE_POSITION                   0x0000000F
#define _IEC3_ADCD5IE_MASK                       0x00008000
#define _IEC3_ADCD5IE_LENGTH                     0x00000001

#define _IEC3_ADCD6IE_POSITION                   0x00000010
#define _IEC3_ADCD6IE_MASK                       0x00010000
#define _IEC3_ADCD6IE_LENGTH                     0x00000001

#define _IEC3_ADCD7IE_POSITION                   0x00000011
#define _IEC3_ADCD7IE_MASK                       0x00020000
#define _IEC3_ADCD7IE_LENGTH                     0x00000001

#define _IEC3_ADCD8IE_POSITION                   0x00000012
#define _IEC3_ADCD8IE_MASK                       0x00040000
#define _IEC3_ADCD8IE_LENGTH                     0x00000001

#define _IEC3_ADCD9IE_POSITION                   0x00000013
#define _IEC3_ADCD9IE_MASK                       0x00080000
#define _IEC3_ADCD9IE_LENGTH                     0x00000001

#define _IEC3_ADCD10IE_POSITION                  0x00000014
#define _IEC3_ADCD10IE_MASK                      0x00100000
#define _IEC3_ADCD10IE_LENGTH                    0x00000001

#define _IEC3_ADCD11IE_POSITION                  0x00000015
#define _IEC3_ADCD11IE_MASK                      0x00200000
#define _IEC3_ADCD11IE_LENGTH                    0x00000001

#define _IEC3_ADCD12IE_POSITION                  0x00000016
#define _IEC3_ADCD12IE_MASK                      0x00400000
#define _IEC3_ADCD12IE_LENGTH                    0x00000001

#define _IEC3_ADCD13IE_POSITION                  0x00000017
#define _IEC3_ADCD13IE_MASK                      0x00800000
#define _IEC3_ADCD13IE_LENGTH                    0x00000001

#define _IEC3_ADCD14IE_POSITION                  0x00000018
#define _IEC3_ADCD14IE_MASK                      0x01000000
#define _IEC3_ADCD14IE_LENGTH                    0x00000001

