Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IPC14_U2RXIS_POSITION                   0x00000008
#define _IPC14_U2RXIS_MASK                       0x00000300
#define _IPC14_U2RXIS_LENGTH                     0x00000002

#define _IPC14_U2RXIP_POSITION                   0x0000000A
#define _IPC14_U2RXIP_MASK                       0x00001C00
#define _IPC14_U2RXIP_LENGTH                     0x00000003

#define _IPC14_U2TXIS_POSITION                   0x00000010
#define _IPC14_U2TXIS_MASK                       0x00030000
#define _IPC14_U2TXIS_LENGTH                     0x00000002

#define _IPC14_U2TXIP_POSITION                   0x00000012
#define _IPC14_U2TXIP_MASK                       0x001C0000
#define _IPC14_U2TXIP_LENGTH                     0x00000003

#define _IPC14_I2C2BIS_POSITION                  0x00000018
#define _IPC14_I2C2BIS_MASK                      0x03000000
#define _IPC14_I2C2BIS_LENGTH                    0x00000002

#define _IPC14_I2C2BIP_POSITION                  0x0000001A
#define _IPC14_I2C2BIP_MASK                      0x1C000000
#define _IPC14_I2C2BIP_LENGTH                    0x00000003

#define _IPC15_I2C2SIS_POSITION                  0x00000000
#define _IPC15_I2C2SIS_MASK                      0x00000003
#define _IPC15_I2C2SIS_LENGTH                    0x00000002

#define _IPC15_I2C2SIP_POSITION                  0x00000002
#define _IPC15_I2C2SIP_MASK                      0x0000001C
#define _IPC15_I2C2SIP_LENGTH                    0x00000003

#define _IPC15_I2C2MIS_POSITION                  0x00000008
#define _IPC15_I2C2MIS_MASK                      0x00000300
#define _IPC15_I2C2MIS_LENGTH                    0x00000002

#define _IPC15_I2C2MIP_POSITION                  0x0000000A
#define _IPC15_I2C2MIP_MASK                      0x00001C00
#define _IPC15_I2C2MIP_LENGTH                    0x00000003

#define _IPC15_U3EIS_POSITION                    0x00000010
#define _IPC15_U3EIS_MASK                        0x00030000
#define _IPC15_U3EIS_LENGTH                      0x00000002

#define _IPC15_U3EIP_POSITION                    0x00000012
#define _IPC15_U3EIP_MASK                        0x001C0000
#define _IPC15_U3EIP_LENGTH                      0x00000003

#define _IPC15_U3RXIS_POSITION                   0x00000018
#define _IPC15_U3RXIS_MASK                       0x03000000
#define _IPC15_U3RXIS_LENGTH                     0x00000002

#define _IPC15_U3RXIP_POSITION                   0x0000001A
#define _IPC15_U3RXIP_MASK                       0x1C000000
#define _IPC15_U3RXIP_LENGTH                     0x00000003

#define _IPC16_U3TXIS_POSITION                   0x00000000
#define _IPC16_U3TXIS_MASK                       0x00000003
#define _IPC16_U3TXIS_LENGTH                     0x00000002

#define _IPC16_U3TXIP_POSITION                   0x00000002
#define _IPC16_U3TXIP_MASK                       0x0000001C
#define _IPC16_U3TXIP_LENGTH                     0x00000003

#define _IPC17_DMA0IS_POSITION                   0x00000000
#define _IPC17_DMA0IS_MASK                       0x00000003
#define _IPC17_DMA0IS_LENGTH                     0x00000002

#define _IPC17_DMA0IP_POSITION                   0x00000002
#define _IPC17_DMA0IP_MASK                       0x0000001C
#define _IPC17_DMA0IP_LENGTH                     0x00000003

#define _IPC17_DMA1IS_POSITION                   0x00000008
#define _IPC17_DMA1IS_MASK                       0x00000300
#define _IPC17_DMA1IS_LENGTH                     0x00000002

#define _IPC17_DMA1IP_POSITION                   0x0000000A
#define _IPC17_DMA1IP_MASK                       0x00001C00
#define _IPC17_DMA1IP_LENGTH                     0x00000003

#define _IPC17_DMA2IS_POSITION                   0x00000010
#define _IPC17_DMA2IS_MASK                       0x00030000
#define _IPC17_DMA2IS_LENGTH                     0x00000002

#define _IPC17_DMA2IP_POSITION                   0x00000012
#define _IPC17_DMA2IP_MASK                       0x001C0000
#define _IPC17_DMA2IP_LENGTH                     0x00000003

#define _IPC17_DMA3IS_POSITION                   0x00000018
#define _IPC17_DMA3IS_MASK                       0x03000000
#define _IPC17_DMA3IS_LENGTH                     0x00000002

#define _IPC17_DMA3IP_POSITION                   0x0000001A
#define _IPC17_DMA3IP_MASK                       0x1C000000
#define _IPC17_DMA3IP_LENGTH                     0x00000003

#define _IPC18_DMA4IS_POSITION                   0x00000000
#define _IPC18_DMA4IS_MASK                       0x00000003
#define _IPC18_DMA4IS_LENGTH                     0x00000002

#define _IPC18_DMA4IP_POSITION                   0x00000002
#define _IPC18_DMA4IP_MASK                       0x0000001C
#define _IPC18_DMA4IP_LENGTH                     0x00000003

#define _IPC18_DMA5IS_POSITION                   0x00000008
#define _IPC18_DMA5IS_MASK                       0x00000300
#define _IPC18_DMA5IS_LENGTH                     0x00000002

#define _IPC18_DMA5IP_POSITION                   0x0000000A
#define _IPC18_DMA5IP_MASK                       0x00001C00
#define _IPC18_DMA5IP_LENGTH                     0x00000003

#define _IPC18_DMA6IS_POSITION                   0x00000010
#define _IPC18_DMA6IS_MASK                       0x00030000
#define _IPC18_DMA6IS_LENGTH                     0x00000002

#define _IPC18_DMA6IP_POSITION                   0x00000012
#define _IPC18_DMA6IP_MASK                       0x001C0000
#define _IPC18_DMA6IP_LENGTH                     0x00000003

#define _IPC18_DMA7IS_POSITION                   0x00000018
#define _IPC18_DMA7IS_MASK                       0x03000000
#define _IPC18_DMA7IS_LENGTH                     0x00000002

#define _IPC18_DMA7IP_POSITION                   0x0000001A
#define _IPC18_DMA7IP_MASK                       0x1C000000
#define _IPC18_DMA7IP_LENGTH                     0x00000003

#define _IPC19_T6IS_POSITION                     0x00000000
#define _IPC19_T6IS_MASK                         0x00000003
#define _IPC19_T6IS_LENGTH                       0x00000002

#define _IPC19_T6IP_POSITION                     0x00000002
#define _IPC19_T6IP_MASK                         0x0000001C
#define _IPC19_T6IP_LENGTH                       0x00000003

