Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IPC20_T7IS_POSITION                     0x00000000
#define _IPC20_T7IS_MASK                         0x00000003
#define _IPC20_T7IS_LENGTH                       0x00000002

#define _IPC20_T7IP_POSITION                     0x00000002
#define _IPC20_T7IP_MASK                         0x0000001C
#define _IPC20_T7IP_LENGTH                       0x00000003

#define _IPC20_RFSMCIS_POSITION                  0x00000018
#define _IPC20_RFSMCIS_MASK                      0x03000000
#define _IPC20_RFSMCIS_LENGTH                    0x00000002

#define _IPC20_RFSMCIP_POSITION                  0x0000001A
#define _IPC20_RFSMCIP_MASK                      0x1C000000
#define _IPC20_RFSMCIP_LENGTH                    0x00000003

#define _IPC21_RFMACIS_POSITION                  0x00000000
#define _IPC21_RFMACIS_MASK                      0x00000003
#define _IPC21_RFMACIS_LENGTH                    0x00000002

#define _IPC21_RFMACIP_POSITION                  0x00000002
#define _IPC21_RFMACIP_MASK                      0x0000001C
#define _IPC21_RFMACIP_LENGTH                    0x00000003

#define _IPC21_CTREVIS_POSITION                  0x00000008
#define _IPC21_CTREVIS_MASK                      0x00000300
#define _IPC21_CTREVIS_LENGTH                    0x00000002

#define _IPC21_CTREVIP_POSITION                  0x0000000A
#define _IPC21_CTREVIP_MASK                      0x00001C00
#define _IPC21_CTREVIP_LENGTH                    0x00000003

#define _IPC21_RFTM0IS_POSITION                  0x00000010
#define _IPC21_RFTM0IS_MASK                      0x00030000
#define _IPC21_RFTM0IS_LENGTH                    0x00000002

#define _IPC21_RFTM0IP_POSITION                  0x00000012
#define _IPC21_RFTM0IP_MASK                      0x001C0000
#define _IPC21_RFTM0IP_LENGTH                    0x00000003

#define _IPC21_RFTM1IS_POSITION                  0x00000018
#define _IPC21_RFTM1IS_MASK                      0x03000000
#define _IPC21_RFTM1IS_LENGTH                    0x00000002

#define _IPC21_RFTM1IP_POSITION                  0x0000001A
#define _IPC21_RFTM1IP_MASK                      0x1C000000
#define _IPC21_RFTM1IP_LENGTH                    0x00000003

#define _IPC22_RFTM2IS_POSITION                  0x00000000
#define _IPC22_RFTM2IS_MASK                      0x00000003
#define _IPC22_RFTM2IS_LENGTH                    0x00000002

#define _IPC22_RFTM2IP_POSITION                  0x00000002
#define _IPC22_RFTM2IP_MASK                      0x0000001C
#define _IPC22_RFTM2IP_LENGTH                    0x00000003

#define _IPC22_RFTM3IS_POSITION                  0x00000008
#define _IPC22_RFTM3IS_MASK                      0x00000300
#define _IPC22_RFTM3IS_LENGTH                    0x00000002

#define _IPC22_RFTM3IP_POSITION                  0x0000000A
#define _IPC22_RFTM3IP_MASK                      0x00001C00
#define _IPC22_RFTM3IP_LENGTH                    0x00000003

#define _IPC22_CTRTRGIS_POSITION                 0x00000010
#define _IPC22_CTRTRGIS_MASK                     0x00030000
#define _IPC22_CTRTRGIS_LENGTH                   0x00000002

#define _IPC22_CTRTRGIP_POSITION                 0x00000012
#define _IPC22_CTRTRGIP_MASK                     0x001C0000
#define _IPC22_CTRTRGIP_LENGTH                   0x00000003

#define _IPC22_RFWCOEIS_POSITION                 0x00000018
#define _IPC22_RFWCOEIS_MASK                     0x03000000
#define _IPC22_RFWCOEIS_LENGTH                   0x00000002

#define _IPC22_RFWCOEIP_POSITION                 0x0000001A
#define _IPC22_RFWCOEIP_MASK                     0x1C000000
#define _IPC22_RFWCOEIP_LENGTH                   0x00000003

#define _IPC23_AD1IS_POSITION                    0x00000000
#define _IPC23_AD1IS_MASK                        0x00000003
#define _IPC23_AD1IS_LENGTH                      0x00000002

#define _IPC23_AD1IP_POSITION                    0x00000002
#define _IPC23_AD1IP_MASK                        0x0000001C
#define _IPC23_AD1IP_LENGTH                      0x00000003

#define _IPC23_AD1DC1IS_POSITION                 0x00000010
#define _IPC23_AD1DC1IS_MASK                     0x00030000
#define _IPC23_AD1DC1IS_LENGTH                   0x00000002

#define _IPC23_AD1DC1IP_POSITION                 0x00000012
#define _IPC23_AD1DC1IP_MASK                     0x001C0000
#define _IPC23_AD1DC1IP_LENGTH                   0x00000003

#define _IPC23_AD1DC2IS_POSITION                 0x00000018
#define _IPC23_AD1DC2IS_MASK                     0x03000000
#define _IPC23_AD1DC2IS_LENGTH                   0x00000002

#define _IPC23_AD1DC2IP_POSITION                 0x0000001A
#define _IPC23_AD1DC2IP_MASK                     0x1C000000
#define _IPC23_AD1DC2IP_LENGTH                   0x00000003

#define _IPC24_AD1DF1IS_POSITION                 0x00000000
#define _IPC24_AD1DF1IS_MASK                     0x00000003
#define _IPC24_AD1DF1IS_LENGTH                   0x00000002

#define _IPC24_AD1DF1IP_POSITION                 0x00000002
#define _IPC24_AD1DF1IP_MASK                     0x0000001C
#define _IPC24_AD1DF1IP_LENGTH                   0x00000003

#define _IPC24_AD1DF2IS_POSITION                 0x00000008
#define _IPC24_AD1DF2IS_MASK                     0x00000300
#define _IPC24_AD1DF2IS_LENGTH                   0x00000002

#define _IPC24_AD1DF2IP_POSITION                 0x0000000A
#define _IPC24_AD1DF2IP_MASK                     0x00001C00
#define _IPC24_AD1DF2IP_LENGTH                   0x00000003

#define _IPC25_AD1DFIIS_POSITION                 0x00000000
#define _IPC25_AD1DFIIS_MASK                     0x00000003
#define _IPC25_AD1DFIIS_LENGTH                   0x00000002

#define _IPC25_AD1DFIIP_POSITION                 0x00000002
#define _IPC25_AD1DFIIP_MASK                     0x0000001C
#define _IPC25_AD1DFIIP_LENGTH                   0x00000003

#define _IPC25_AD1EOSIS_POSITION                 0x00000008
#define _IPC25_AD1EOSIS_MASK                     0x00000300
#define _IPC25_AD1EOSIS_LENGTH                   0x00000002

#define _IPC25_AD1EOSIP_POSITION                 0x0000000A
#define _IPC25_AD1EOSIP_MASK                     0x00001C00
#define _IPC25_AD1EOSIP_LENGTH                   0x00000003

#define _IPC25_AD1ARIS_POSITION                  0x00000010
#define _IPC25_AD1ARIS_MASK                      0x00030000
#define _IPC25_AD1ARIS_LENGTH                    0x00000002

#define _IPC25_AD1ARIP_POSITION                  0x00000012
#define _IPC25_AD1ARIP_MASK                      0x001C0000
#define _IPC25_AD1ARIP_LENGTH                    0x00000003

#define _IPC25_AD1RSIS_POSITION                  0x00000018
#define _IPC25_AD1RSIS_MASK                      0x03000000
#define _IPC25_AD1RSIS_LENGTH                    0x00000002

#define _IPC25_AD1RSIP_POSITION                  0x0000001A
#define _IPC25_AD1RSIP_MASK                      0x1C000000
#define _IPC25_AD1RSIP_LENGTH                    0x00000003

#define _IPC26_AD1FCIS_POSITION                  0x00000000
#define _IPC26_AD1FCIS_MASK                      0x00000003
#define _IPC26_AD1FCIS_LENGTH                    0x00000002

