Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IPC26_AD1FCIP_POSITION                  0x00000002
#define _IPC26_AD1FCIP_MASK                      0x0000001C
#define _IPC26_AD1FCIP_LENGTH                    0x00000003

#define _IPC26_AD1I00IS_POSITION                 0x00000010
#define _IPC26_AD1I00IS_MASK                     0x00030000
#define _IPC26_AD1I00IS_LENGTH                   0x00000002

#define _IPC26_AD1I00IP_POSITION                 0x00000012
#define _IPC26_AD1I00IP_MASK                     0x001C0000
#define _IPC26_AD1I00IP_LENGTH                   0x00000003

#define _IPC26_AD1I01IS_POSITION                 0x00000018
#define _IPC26_AD1I01IS_MASK                     0x03000000
#define _IPC26_AD1I01IS_LENGTH                   0x00000002

#define _IPC26_AD1I01IP_POSITION                 0x0000001A
#define _IPC26_AD1I01IP_MASK                     0x1C000000
#define _IPC26_AD1I01IP_LENGTH                   0x00000003

#define _IPC27_AD1I02IS_POSITION                 0x00000000
#define _IPC27_AD1I02IS_MASK                     0x00000003
#define _IPC27_AD1I02IS_LENGTH                   0x00000002

#define _IPC27_AD1I02IP_POSITION                 0x00000002
#define _IPC27_AD1I02IP_MASK                     0x0000001C
#define _IPC27_AD1I02IP_LENGTH                   0x00000003

#define _IPC27_AD1I03IS_POSITION                 0x00000008
#define _IPC27_AD1I03IS_MASK                     0x00000300
#define _IPC27_AD1I03IS_LENGTH                   0x00000002

#define _IPC27_AD1I03IP_POSITION                 0x0000000A
#define _IPC27_AD1I03IP_MASK                     0x00001C00
#define _IPC27_AD1I03IP_LENGTH                   0x00000003

#define _IPC27_AD1I04IS_POSITION                 0x00000010
#define _IPC27_AD1I04IS_MASK                     0x00030000
#define _IPC27_AD1I04IS_LENGTH                   0x00000002

#define _IPC27_AD1I04IP_POSITION                 0x00000012
#define _IPC27_AD1I04IP_MASK                     0x001C0000
#define _IPC27_AD1I04IP_LENGTH                   0x00000003

#define _IPC27_AD1I05IS_POSITION                 0x00000018
#define _IPC27_AD1I05IS_MASK                     0x03000000
#define _IPC27_AD1I05IS_LENGTH                   0x00000002

#define _IPC27_AD1I05IP_POSITION                 0x0000001A
#define _IPC27_AD1I05IP_MASK                     0x1C000000
#define _IPC27_AD1I05IP_LENGTH                   0x00000003

#define _IPC28_AD1I06IS_POSITION                 0x00000000
#define _IPC28_AD1I06IS_MASK                     0x00000003
#define _IPC28_AD1I06IS_LENGTH                   0x00000002

#define _IPC28_AD1I06IP_POSITION                 0x00000002
#define _IPC28_AD1I06IP_MASK                     0x0000001C
#define _IPC28_AD1I06IP_LENGTH                   0x00000003

#define _IPC28_AD1I07IS_POSITION                 0x00000008
#define _IPC28_AD1I07IS_MASK                     0x00000300
#define _IPC28_AD1I07IS_LENGTH                   0x00000002

#define _IPC28_AD1I07IP_POSITION                 0x0000000A
#define _IPC28_AD1I07IP_MASK                     0x00001C00
#define _IPC28_AD1I07IP_LENGTH                   0x00000003

#define _IPC28_AD1I08IS_POSITION                 0x00000010
#define _IPC28_AD1I08IS_MASK                     0x00030000
#define _IPC28_AD1I08IS_LENGTH                   0x00000002

#define _IPC28_AD1I08IP_POSITION                 0x00000012
#define _IPC28_AD1I08IP_MASK                     0x001C0000
#define _IPC28_AD1I08IP_LENGTH                   0x00000003

#define _IPC28_AD1I09IS_POSITION                 0x00000018
#define _IPC28_AD1I09IS_MASK                     0x03000000
#define _IPC28_AD1I09IS_LENGTH                   0x00000002

#define _IPC28_AD1I09IP_POSITION                 0x0000001A
#define _IPC28_AD1I09IP_MASK                     0x1C000000
#define _IPC28_AD1I09IP_LENGTH                   0x00000003

#define _IPC29_AD1I10IS_POSITION                 0x00000000
#define _IPC29_AD1I10IS_MASK                     0x00000003
#define _IPC29_AD1I10IS_LENGTH                   0x00000002

#define _IPC29_AD1I10IP_POSITION                 0x00000002
#define _IPC29_AD1I10IP_MASK                     0x0000001C
#define _IPC29_AD1I10IP_LENGTH                   0x00000003

#define _IPC29_AD1I11IS_POSITION                 0x00000008
#define _IPC29_AD1I11IS_MASK                     0x00000300
#define _IPC29_AD1I11IS_LENGTH                   0x00000002

#define _IPC29_AD1I11IP_POSITION                 0x0000000A
#define _IPC29_AD1I11IP_MASK                     0x00001C00
#define _IPC29_AD1I11IP_LENGTH                   0x00000003

#define _IPC29_AD1I12IS_POSITION                 0x00000010
#define _IPC29_AD1I12IS_MASK                     0x00030000
#define _IPC29_AD1I12IS_LENGTH                   0x00000002

#define _IPC29_AD1I12IP_POSITION                 0x00000012
#define _IPC29_AD1I12IP_MASK                     0x001C0000
#define _IPC29_AD1I12IP_LENGTH                   0x00000003

#define _IPC29_AD1I13IS_POSITION                 0x00000018
#define _IPC29_AD1I13IS_MASK                     0x03000000
#define _IPC29_AD1I13IS_LENGTH                   0x00000002

#define _IPC29_AD1I13IP_POSITION                 0x0000001A
#define _IPC29_AD1I13IP_MASK                     0x1C000000
#define _IPC29_AD1I13IP_LENGTH                   0x00000003

#define _IPC30_AD1I14IS_POSITION                 0x00000000
#define _IPC30_AD1I14IS_MASK                     0x00000003
#define _IPC30_AD1I14IS_LENGTH                   0x00000002

#define _IPC30_AD1I14IP_POSITION                 0x00000002
#define _IPC30_AD1I14IP_MASK                     0x0000001C
#define _IPC30_AD1I14IP_LENGTH                   0x00000003

#define _IPC30_AD1I15IS_POSITION                 0x00000008
#define _IPC30_AD1I15IS_MASK                     0x00000300
#define _IPC30_AD1I15IS_LENGTH                   0x00000002

#define _IPC30_AD1I15IP_POSITION                 0x0000000A
#define _IPC30_AD1I15IP_MASK                     0x00001C00
#define _IPC30_AD1I15IP_LENGTH                   0x00000003

#define _IPC30_AD1I16IS_POSITION                 0x00000010
#define _IPC30_AD1I16IS_MASK                     0x00030000
#define _IPC30_AD1I16IS_LENGTH                   0x00000002

#define _IPC30_AD1I16IP_POSITION                 0x00000012
#define _IPC30_AD1I16IP_MASK                     0x001C0000
#define _IPC30_AD1I16IP_LENGTH                   0x00000003

#define _IPC30_AD1I17IS_POSITION                 0x00000018
#define _IPC30_AD1I17IS_MASK                     0x03000000
#define _IPC30_AD1I17IS_LENGTH                   0x00000002

#define _IPC30_AD1I17IP_POSITION                 0x0000001A
#define _IPC30_AD1I17IP_MASK                     0x1C000000
#define _IPC30_AD1I17IP_LENGTH                   0x00000003

#define _IPC31_AD1I18IS_POSITION                 0x00000000
#define _IPC31_AD1I18IS_MASK                     0x00000003
#define _IPC31_AD1I18IS_LENGTH                   0x00000002

#define _IPC31_AD1I18IP_POSITION                 0x00000002
#define _IPC31_AD1I18IP_MASK                     0x0000001C
#define _IPC31_AD1I18IP_LENGTH                   0x00000003

