Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _IPC41_CRPT1IP_POSITION                  0x00000012
#define _IPC41_CRPT1IP_MASK                      0x001C0000
#define _IPC41_CRPT1IP_LENGTH                    0x00000003

#define _IPC41_CRPT1EIS_POSITION                 0x00000018
#define _IPC41_CRPT1EIS_MASK                     0x03000000
#define _IPC41_CRPT1EIS_LENGTH                   0x00000002

#define _IPC41_CRPT1EIP_POSITION                 0x0000001A
#define _IPC41_CRPT1EIP_MASK                     0x1C000000
#define _IPC41_CRPT1EIP_LENGTH                   0x00000003

#define _IPC42_CVDIS_POSITION                    0x00000000
#define _IPC42_CVDIS_MASK                        0x00000003
#define _IPC42_CVDIS_LENGTH                      0x00000002

#define _IPC42_CVDIP_POSITION                    0x00000002
#define _IPC42_CVDIP_MASK                        0x0000001C
#define _IPC42_CVDIP_LENGTH                      0x00000003

#define _OFF000_VOFF_POSITION                    0x00000001
#define _OFF000_VOFF_MASK                        0x0003FFFE
#define _OFF000_VOFF_LENGTH                      0x00000011

#define _OFF001_VOFF_POSITION                    0x00000001
#define _OFF001_VOFF_MASK                        0x0003FFFE
#define _OFF001_VOFF_LENGTH                      0x00000011

#define _OFF002_VOFF_POSITION                    0x00000001
#define _OFF002_VOFF_MASK                        0x0003FFFE
#define _OFF002_VOFF_LENGTH                      0x00000011

#define _OFF003_VOFF_POSITION                    0x00000001
#define _OFF003_VOFF_MASK                        0x0003FFFE
#define _OFF003_VOFF_LENGTH                      0x00000011

#define _OFF004_VOFF_POSITION                    0x00000001
#define _OFF004_VOFF_MASK                        0x0003FFFE
#define _OFF004_VOFF_LENGTH                      0x00000011

#define _OFF005_VOFF_POSITION                    0x00000001
#define _OFF005_VOFF_MASK                        0x0003FFFE
#define _OFF005_VOFF_LENGTH                      0x00000011

#define _OFF006_VOFF_POSITION                    0x00000001
#define _OFF006_VOFF_MASK                        0x0003FFFE
#define _OFF006_VOFF_LENGTH                      0x00000011

#define _OFF007_VOFF_POSITION                    0x00000001
#define _OFF007_VOFF_MASK                        0x0003FFFE
#define _OFF007_VOFF_LENGTH                      0x00000011

#define _OFF008_VOFF_POSITION                    0x00000001
#define _OFF008_VOFF_MASK                        0x0003FFFE
#define _OFF008_VOFF_LENGTH                      0x00000011

#define _OFF009_VOFF_POSITION                    0x00000001
#define _OFF009_VOFF_MASK                        0x0003FFFE
#define _OFF009_VOFF_LENGTH                      0x00000011

#define _OFF010_VOFF_POSITION                    0x00000001
#define _OFF010_VOFF_MASK                        0x0003FFFE
#define _OFF010_VOFF_LENGTH                      0x00000011

#define _OFF011_VOFF_POSITION                    0x00000001
#define _OFF011_VOFF_MASK                        0x0003FFFE
#define _OFF011_VOFF_LENGTH                      0x00000011

#define _OFF012_VOFF_POSITION                    0x00000001
#define _OFF012_VOFF_MASK                        0x0003FFFE
#define _OFF012_VOFF_LENGTH                      0x00000011

#define _OFF013_VOFF_POSITION                    0x00000001
#define _OFF013_VOFF_MASK                        0x0003FFFE
#define _OFF013_VOFF_LENGTH                      0x00000011

#define _OFF014_VOFF_POSITION                    0x00000001
#define _OFF014_VOFF_MASK                        0x0003FFFE
#define _OFF014_VOFF_LENGTH                      0x00000011

#define _OFF015_VOFF_POSITION                    0x00000001
#define _OFF015_VOFF_MASK                        0x0003FFFE
#define _OFF015_VOFF_LENGTH                      0x00000011

#define _OFF016_VOFF_POSITION                    0x00000001
#define _OFF016_VOFF_MASK                        0x0003FFFE
#define _OFF016_VOFF_LENGTH                      0x00000011

#define _OFF017_VOFF_POSITION                    0x00000001
#define _OFF017_VOFF_MASK                        0x0003FFFE
#define _OFF017_VOFF_LENGTH                      0x00000011

#define _OFF018_VOFF_POSITION                    0x00000001
#define _OFF018_VOFF_MASK                        0x0003FFFE
#define _OFF018_VOFF_LENGTH                      0x00000011

#define _OFF019_VOFF_POSITION                    0x00000001
#define _OFF019_VOFF_MASK                        0x0003FFFE
#define _OFF019_VOFF_LENGTH                      0x00000011

#define _OFF020_VOFF_POSITION                    0x00000001
#define _OFF020_VOFF_MASK                        0x0003FFFE
#define _OFF020_VOFF_LENGTH                      0x00000011

#define _OFF021_VOFF_POSITION                    0x00000001
#define _OFF021_VOFF_MASK                        0x0003FFFE
#define _OFF021_VOFF_LENGTH                      0x00000011

#define _OFF022_VOFF_POSITION                    0x00000001
#define _OFF022_VOFF_MASK                        0x0003FFFE
#define _OFF022_VOFF_LENGTH                      0x00000011

#define _OFF023_VOFF_POSITION                    0x00000001
#define _OFF023_VOFF_MASK                        0x0003FFFE
#define _OFF023_VOFF_LENGTH                      0x00000011

#define _OFF024_VOFF_POSITION                    0x00000001
#define _OFF024_VOFF_MASK                        0x0003FFFE
#define _OFF024_VOFF_LENGTH                      0x00000011

#define _OFF030_VOFF_POSITION                    0x00000001
#define _OFF030_VOFF_MASK                        0x0003FFFE
#define _OFF030_VOFF_LENGTH                      0x00000011

#define _OFF031_VOFF_POSITION                    0x00000001
#define _OFF031_VOFF_MASK                        0x0003FFFE
#define _OFF031_VOFF_LENGTH                      0x00000011

#define _OFF032_VOFF_POSITION                    0x00000001
#define _OFF032_VOFF_MASK                        0x0003FFFE
#define _OFF032_VOFF_LENGTH                      0x00000011

#define _OFF033_VOFF_POSITION                    0x00000001
#define _OFF033_VOFF_MASK                        0x0003FFFE
#define _OFF033_VOFF_LENGTH                      0x00000011

#define _OFF034_VOFF_POSITION                    0x00000001
#define _OFF034_VOFF_MASK                        0x0003FFFE
#define _OFF034_VOFF_LENGTH                      0x00000011

#define _OFF035_VOFF_POSITION                    0x00000001
#define _OFF035_VOFF_MASK                        0x0003FFFE
#define _OFF035_VOFF_LENGTH                      0x00000011

