Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _DCH7INT_CHERIE_POSITION                 0x00000010
#define _DCH7INT_CHERIE_MASK                     0x00010000
#define _DCH7INT_CHERIE_LENGTH                   0x00000001

#define _DCH7INT_CHTAIE_POSITION                 0x00000011
#define _DCH7INT_CHTAIE_MASK                     0x00020000
#define _DCH7INT_CHTAIE_LENGTH                   0x00000001

#define _DCH7INT_CHCCIE_POSITION                 0x00000012
#define _DCH7INT_CHCCIE_MASK                     0x00040000
#define _DCH7INT_CHCCIE_LENGTH                   0x00000001

#define _DCH7INT_CHBCIE_POSITION                 0x00000013
#define _DCH7INT_CHBCIE_MASK                     0x00080000
#define _DCH7INT_CHBCIE_LENGTH                   0x00000001

#define _DCH7INT_CHDHIE_POSITION                 0x00000014
#define _DCH7INT_CHDHIE_MASK                     0x00100000
#define _DCH7INT_CHDHIE_LENGTH                   0x00000001

#define _DCH7INT_CHDDIE_POSITION                 0x00000015
#define _DCH7INT_CHDDIE_MASK                     0x00200000
#define _DCH7INT_CHDDIE_LENGTH                   0x00000001

#define _DCH7INT_CHSHIE_POSITION                 0x00000016
#define _DCH7INT_CHSHIE_MASK                     0x00400000
#define _DCH7INT_CHSHIE_LENGTH                   0x00000001

#define _DCH7INT_CHSDIE_POSITION                 0x00000017
#define _DCH7INT_CHSDIE_MASK                     0x00800000
#define _DCH7INT_CHSDIE_LENGTH                   0x00000001

#define _DCH7SSA_CHSSA_POSITION                  0x00000000
#define _DCH7SSA_CHSSA_MASK                      0xFFFFFFFF
#define _DCH7SSA_CHSSA_LENGTH                    0x00000020

#define _DCH7DSA_CHDSA_POSITION                  0x00000000
#define _DCH7DSA_CHDSA_MASK                      0xFFFFFFFF
#define _DCH7DSA_CHDSA_LENGTH                    0x00000020

#define _DCH7SSIZ_CHSSIZ_POSITION                0x00000000
#define _DCH7SSIZ_CHSSIZ_MASK                    0x0000FFFF
#define _DCH7SSIZ_CHSSIZ_LENGTH                  0x00000010

#define _DCH7DSIZ_CHDSIZ_POSITION                0x00000000
#define _DCH7DSIZ_CHDSIZ_MASK                    0x0000FFFF
#define _DCH7DSIZ_CHDSIZ_LENGTH                  0x00000010

#define _DCH7SPTR_CHSPTR_POSITION                0x00000000
#define _DCH7SPTR_CHSPTR_MASK                    0x0000FFFF
#define _DCH7SPTR_CHSPTR_LENGTH                  0x00000010

#define _DCH7DPTR_CHDPTR_POSITION                0x00000000
#define _DCH7DPTR_CHDPTR_MASK                    0x0000FFFF
#define _DCH7DPTR_CHDPTR_LENGTH                  0x00000010

#define _DCH7CSIZ_CHCSIZ_POSITION                0x00000000
#define _DCH7CSIZ_CHCSIZ_MASK                    0x0000FFFF
#define _DCH7CSIZ_CHCSIZ_LENGTH                  0x00000010

#define _DCH7CPTR_CHCPTR_POSITION                0x00000000
#define _DCH7CPTR_CHCPTR_MASK                    0x0000FFFF
#define _DCH7CPTR_CHCPTR_LENGTH                  0x00000010

#define _DCS7CPTR_CHCPTR_POSITION                0x00000000
#define _DCS7CPTR_CHCPTR_MASK                    0x0000FFFF
#define _DCS7CPTR_CHCPTR_LENGTH                  0x00000010

#define _DCH7DAT_CHPDAT_POSITION                 0x00000000
#define _DCH7DAT_CHPDAT_MASK                     0x0000FFFF
#define _DCH7DAT_CHPDAT_LENGTH                   0x00000010

#define __ICDCON_CKSWBKEN_POSITION               0x00000000
#define __ICDCON_CKSWBKEN_MASK                   0x00000001
#define __ICDCON_CKSWBKEN_LENGTH                 0x00000001

#define __ICDCON_SLPBKEN_POSITION                0x00000001
#define __ICDCON_SLPBKEN_MASK                    0x00000002
#define __ICDCON_SLPBKEN_LENGTH                  0x00000001

#define __ICDCON_WDTBKEN_POSITION                0x00000002
#define __ICDCON_WDTBKEN_MASK                    0x00000004
#define __ICDCON_WDTBKEN_LENGTH                  0x00000001

#define __ICDCON_WDTEN_POSITION                  0x00000003
#define __ICDCON_WDTEN_MASK                      0x00000008
#define __ICDCON_WDTEN_LENGTH                    0x00000001

#define __ICDCON_RSTBUG_POSITION                 0x00000004
#define __ICDCON_RSTBUG_MASK                     0x00000010
#define __ICDCON_RSTBUG_LENGTH                   0x00000001

#define __ICDCON_DMTBKEN_POSITION                0x00000005
#define __ICDCON_DMTBKEN_MASK                    0x00000020
#define __ICDCON_DMTBKEN_LENGTH                  0x00000001

#define __ICDCON_DMTEN_POSITION                  0x00000006
#define __ICDCON_DMTEN_MASK                      0x00000040
#define __ICDCON_DMTEN_LENGTH                    0x00000001

#define __ICDCON_FRZ_POSITION                    0x0000000E
#define __ICDCON_FRZ_MASK                        0x00004000
#define __ICDCON_FRZ_LENGTH                      0x00000001

#define __ICDSTAT_CKSWBF_POSITION                0x00000000
#define __ICDSTAT_CKSWBF_MASK                    0x00000001
#define __ICDSTAT_CKSWBF_LENGTH                  0x00000001

#define __ICDSTAT_SLPBF_POSITION                 0x00000001
#define __ICDSTAT_SLPBF_MASK                     0x00000002
#define __ICDSTAT_SLPBF_LENGTH                   0x00000001

#define __ICDSTAT_WDTBF_POSITION                 0x00000002
#define __ICDSTAT_WDTBF_MASK                     0x00000004
#define __ICDSTAT_WDTBF_LENGTH                   0x00000001

#define __ICDSTAT_DMTBF_POSITION                 0x00000003
#define __ICDSTAT_DMTBF_MASK                     0x00000008
#define __ICDSTAT_DMTBF_LENGTH                   0x00000001

#define __ICDSTAT_WDTRUNBF_POSITION              0x00000004
#define __ICDSTAT_WDTRUNBF_MASK                  0x00000010
#define __ICDSTAT_WDTRUNBF_LENGTH                0x00000001

#define __ICDSTAT_WDTSLPBF_POSITION              0x00000005
#define __ICDSTAT_WDTSLPBF_MASK                  0x00000020
#define __ICDSTAT_WDTSLPBF_LENGTH                0x00000001

#define _PRECON_PFMWS_POSITION                   0x00000000
#define _PRECON_PFMWS_MASK                       0x0000000F
#define _PRECON_PFMWS_LENGTH                     0x00000004

#define _PRECON_PREFEN_POSITION                  0x00000004
#define _PRECON_PREFEN_MASK                      0x00000030
#define _PRECON_PREFEN_LENGTH                    0x00000002

#define _PRECON_PFMSECEN_POSITION                0x00000007
#define _PRECON_PFMSECEN_MASK                    0x00000080
#define _PRECON_PFMSECEN_LENGTH                  0x00000001

