Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _PMUMODECTRL2_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL2_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL2_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL2_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL2_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL2_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL2_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL2_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL2_BUCKEN_LENGTH              0x00000001

#define _PMUMODECTRL3_VREG4CTRL_POSITION         0x00000000
#define _PMUMODECTRL3_VREG4CTRL_MASK             0x0000001F
#define _PMUMODECTRL3_VREG4CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_VREG3CTRL_POSITION         0x00000008
#define _PMUMODECTRL3_VREG3CTRL_MASK             0x00001F00
#define _PMUMODECTRL3_VREG3CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_VREG2CTRL_POSITION         0x00000010
#define _PMUMODECTRL3_VREG2CTRL_MASK             0x001F0000
#define _PMUMODECTRL3_VREG2CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_VREG1CTRL_POSITION         0x00000018
#define _PMUMODECTRL3_VREG1CTRL_MASK             0x1F000000
#define _PMUMODECTRL3_VREG1CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL3_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL3_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL3_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL3_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL3_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL3_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL3_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL3_BUCKEN_LENGTH              0x00000001

#define _PMUMODECTRL4_VREG4CTRL_POSITION         0x00000000
#define _PMUMODECTRL4_VREG4CTRL_MASK             0x0000001F
#define _PMUMODECTRL4_VREG4CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_VREG3CTRL_POSITION         0x00000008
#define _PMUMODECTRL4_VREG3CTRL_MASK             0x00001F00
#define _PMUMODECTRL4_VREG3CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_VREG2CTRL_POSITION         0x00000010
#define _PMUMODECTRL4_VREG2CTRL_MASK             0x001F0000
#define _PMUMODECTRL4_VREG2CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_VREG1CTRL_POSITION         0x00000018
#define _PMUMODECTRL4_VREG1CTRL_MASK             0x1F000000
#define _PMUMODECTRL4_VREG1CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL4_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL4_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL4_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL4_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL4_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL4_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL4_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL4_BUCKEN_LENGTH              0x00000001

#define _PMUOVERCTRL_VREG4OCTRL_POSITION         0x00000000
#define _PMUOVERCTRL_VREG4OCTRL_MASK             0x0000001F
#define _PMUOVERCTRL_VREG4OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_VREG3OCTRL_POSITION         0x00000008
#define _PMUOVERCTRL_VREG3OCTRL_MASK             0x00001F00
#define _PMUOVERCTRL_VREG3OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_VREG2OCTRL_POSITION         0x00000010
#define _PMUOVERCTRL_VREG2OCTRL_MASK             0x001F0000
#define _PMUOVERCTRL_VREG2OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_PHWC_POSITION               0x00000016
#define _PMUOVERCTRL_PHWC_MASK                   0x00400000
#define _PMUOVERCTRL_PHWC_LENGTH                 0x00000001

#define _PMUOVERCTRL_OVEREN_POSITION             0x00000017
#define _PMUOVERCTRL_OVEREN_MASK                 0x00800000
#define _PMUOVERCTRL_OVEREN_LENGTH               0x00000001

#define _PMUOVERCTRL_VREG1OCTRL_POSITION         0x00000018
#define _PMUOVERCTRL_VREG1OCTRL_MASK             0x1F000000
#define _PMUOVERCTRL_VREG1OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_OBUCKMODE_POSITION          0x0000001D
#define _PMUOVERCTRL_OBUCKMODE_MASK              0x20000000
#define _PMUOVERCTRL_OBUCKMODE_LENGTH            0x00000001

#define _PMUOVERCTRL_OMLDOEN_POSITION            0x0000001E
#define _PMUOVERCTRL_OMLDOEN_MASK                0x40000000
#define _PMUOVERCTRL_OMLDOEN_LENGTH              0x00000001

#define _PMUOVERCTRL_OBUCKEN_POSITION            0x0000001F
#define _PMUOVERCTRL_OBUCKEN_MASK                0x80000000
#define _PMUOVERCTRL_OBUCKEN_LENGTH              0x00000001

#define _PMUCMODE_CVREG4OCTRL_POSITION           0x00000000
#define _PMUCMODE_CVREG4OCTRL_MASK               0x0000001F
#define _PMUCMODE_CVREG4OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CVREG3OCTRL_POSITION           0x00000008
#define _PMUCMODE_CVREG3OCTRL_MASK               0x00001F00
#define _PMUCMODE_CVREG3OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CVREG2OCTRL_POSITION           0x00000010
#define _PMUCMODE_CVREG2OCTRL_MASK               0x001F0000
#define _PMUCMODE_CVREG2OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CVREG1OCTRL_POSITION           0x00000018
#define _PMUCMODE_CVREG1OCTRL_MASK               0x1F000000
#define _PMUCMODE_CVREG1OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CBUCKMODE_POSITION             0x0000001D
#define _PMUCMODE_CBUCKMODE_MASK                 0x20000000
#define _PMUCMODE_CBUCKMODE_LENGTH               0x00000001

#define _PMUCMODE_CMLDOEN_POSITION               0x0000001E
#define _PMUCMODE_CMLDOEN_MASK                   0x40000000
#define _PMUCMODE_CMLDOEN_LENGTH                 0x00000001

#define _PMUCMODE_CBUCKEN_POSITION               0x0000001F
#define _PMUCMODE_CBUCKEN_MASK                   0x80000000
#define _PMUCMODE_CBUCKEN_LENGTH                 0x00000001

#define _PMUSTATUS_STATUS_POSITION               0x00000000
#define _PMUSTATUS_STATUS_MASK                   0x0000001F
#define _PMUSTATUS_STATUS_LENGTH                 0x00000005

#define _PMUSTATUS_WCMRM_POSITION                0x00000005
#define _PMUSTATUS_WCMRM_MASK                    0x00000020
#define _PMUSTATUS_WCMRM_LENGTH                  0x00000001

