Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _PMUSTATUS_BSSEDATA_POSITION             0x00000008
#define _PMUSTATUS_BSSEDATA_MASK                 0x00FFFF00
#define _PMUSTATUS_BSSEDATA_LENGTH               0x00000010

#define _PMUSTATUS_BSSENUM_POSITION              0x00000018
#define _PMUSTATUS_BSSENUM_MASK                  0x7F000000
#define _PMUSTATUS_BSSENUM_LENGTH                0x00000007

#define _PMUSTATUS_BSSERR_POSITION               0x0000001F
#define _PMUSTATUS_BSSERR_MASK                   0x80000000
#define _PMUSTATUS_BSSERR_LENGTH                 0x00000001

#define _PMUSEQ0_DELAY_POSITION                  0x00000000
#define _PMUSEQ0_DELAY_MASK                      0x0000003F
#define _PMUSEQ0_DELAY_LENGTH                    0x00000006

#define _PMUSEQ0_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ0_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ0_CMPBVAL_LENGTH                  0x00000001

#define _PMUSEQ0_CMD_POSITION                    0x00000007
#define _PMUSEQ0_CMD_MASK                        0x00000080
#define _PMUSEQ0_CMD_LENGTH                      0x00000001

#define _PMUSEQ0_SPIADDR_POSITION                0x00000008
#define _PMUSEQ0_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ0_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ0_SPIDATA_POSITION                0x00000010
#define _PMUSEQ0_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ0_SPIDATA_LENGTH                  0x00000010

#define _PMUSEQ1_DELAY_POSITION                  0x00000000
#define _PMUSEQ1_DELAY_MASK                      0x0000003F
#define _PMUSEQ1_DELAY_LENGTH                    0x00000006

#define _PMUSEQ1_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ1_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ1_CMPBVAL_LENGTH                  0x00000001

#define _PMUSEQ1_CMD_POSITION                    0x00000007
#define _PMUSEQ1_CMD_MASK                        0x00000080
#define _PMUSEQ1_CMD_LENGTH                      0x00000001

#define _PMUSEQ1_SPIADDR_POSITION                0x00000008
#define _PMUSEQ1_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ1_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ1_SPIDATA_POSITION                0x00000010
#define _PMUSEQ1_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ1_SPIDATA_LENGTH                  0x00000010

#define _PMUSEQ2_DELAY_POSITION                  0x00000000
#define _PMUSEQ2_DELAY_MASK                      0x0000003F
#define _PMUSEQ2_DELAY_LENGTH                    0x00000006

#define _PMUSEQ2_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ2_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ2_CMPBVAL_LENGTH                  0x00000001

#define _PMUSEQ2_CMD_POSITION                    0x00000007
#define _PMUSEQ2_CMD_MASK                        0x00000080
#define _PMUSEQ2_CMD_LENGTH                      0x00000001

#define _PMUSEQ2_SPIADDR_POSITION                0x00000008
#define _PMUSEQ2_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ2_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ2_SPIDATA_POSITION                0x00000010
#define _PMUSEQ2_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ2_SPIDATA_LENGTH                  0x00000010

#define _PMUCFG_DELAY_POSITION                   0x00000000
#define _PMUCFG_DELAY_MASK                       0x0000003F
#define _PMUCFG_DELAY_LENGTH                     0x00000006

#define _PMUWCMCMD_WCMADDR_POSITION              0x00000000
#define _PMUWCMCMD_WCMADDR_MASK                  0x000007FF
#define _PMUWCMCMD_WCMADDR_LENGTH                0x0000000B

#define _PMUWCMCMD_WCMCLKDIV_POSITION            0x00000010
#define _PMUWCMCMD_WCMCLKDIV_MASK                0x00070000
#define _PMUWCMCMD_WCMCLKDIV_LENGTH              0x00000003

#define _PMUWCMCMD_WCMRDY_POSITION               0x0000001C
#define _PMUWCMCMD_WCMRDY_MASK                   0x10000000
#define _PMUWCMCMD_WCMRDY_LENGTH                 0x00000001

#define _PMUWCMCMD_CMD_POSITION                  0x0000001E
#define _PMUWCMCMD_CMD_MASK                      0x40000000
#define _PMUWCMCMD_CMD_LENGTH                    0x00000001

#define _PMUWCMCMD_MODE_POSITION                 0x0000001F
#define _PMUWCMCMD_MODE_MASK                     0x80000000
#define _PMUWCMCMD_MODE_LENGTH                   0x00000001

#define _PMUWCMWDATA_WDATA_POSITION              0x00000000
#define _PMUWCMWDATA_WDATA_MASK                  0xFFFFFFFF
#define _PMUWCMWDATA_WDATA_LENGTH                0x00000020

#define _PMUWCMRDATA_RDATA_POSITION              0x00000000
#define _PMUWCMRDATA_RDATA_MASK                  0xFFFFFFFF
#define _PMUWCMRDATA_RDATA_LENGTH                0x00000020

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSA12_POSITION                  0x0000000C
#define _ANSELA_ANSA12_MASK                      0x00001000
#define _ANSELA_ANSA12_LENGTH                    0x00000001

#define _ANSELA_ANSA13_POSITION                  0x0000000D
#define _ANSELA_ANSA13_MASK                      0x00002000
#define _ANSELA_ANSA13_LENGTH                    0x00000001

#define _ANSELA_ANSA14_POSITION                  0x0000000E
#define _ANSELA_ANSA14_MASK                      0x00004000
#define _ANSELA_ANSA14_LENGTH                    0x00000001

#define _ANSELA_ANSA15_POSITION                  0x0000000F
#define _ANSELA_ANSA15_MASK                      0x00008000
#define _ANSELA_ANSA15_LENGTH                    0x00000001

#define _ANSELA_w_POSITION                       0x00000000
#define _ANSELA_w_MASK                           0xFFFFFFFF
#define _ANSELA_w_LENGTH                         0x00000020

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

