Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CNENC_w_POSITION                        0x00000000
#define _CNENC_w_MASK                            0xFFFFFFFF
#define _CNENC_w_LENGTH                          0x00000020

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC4_POSITION               0x00000004
#define _CNSTATC_CNSTATC4_MASK                   0x00000010
#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC5_POSITION               0x00000005
#define _CNSTATC_CNSTATC5_MASK                   0x00000020
#define _CNSTATC_CNSTATC5_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC10_POSITION              0x0000000A
#define _CNSTATC_CNSTATC10_MASK                  0x00000400
#define _CNSTATC_CNSTATC10_LENGTH                0x00000001

#define _CNSTATC_CNSTATC11_POSITION              0x0000000B
#define _CNSTATC_CNSTATC11_MASK                  0x00000800
#define _CNSTATC_CNSTATC11_LENGTH                0x00000001

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_CNSTATC13_POSITION              0x0000000D
#define _CNSTATC_CNSTATC13_MASK                  0x00002000
#define _CNSTATC_CNSTATC13_LENGTH                0x00000001

#define _CNSTATC_CNSTATC14_POSITION              0x0000000E
#define _CNSTATC_CNSTATC14_MASK                  0x00004000
#define _CNSTATC_CNSTATC14_LENGTH                0x00000001

#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
#define _CNSTATC_CNSTATC15_MASK                  0x00008000
#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNNEC_CNNEC0_POSITION                   0x00000000
#define _CNNEC_CNNEC0_MASK                       0x00000001
#define _CNNEC_CNNEC0_LENGTH                     0x00000001

#define _CNNEC_CNNEC1_POSITION                   0x00000001
#define _CNNEC_CNNEC1_MASK                       0x00000002
#define _CNNEC_CNNEC1_LENGTH                     0x00000001

#define _CNNEC_CNNEC2_POSITION                   0x00000002
#define _CNNEC_CNNEC2_MASK                       0x00000004
#define _CNNEC_CNNEC2_LENGTH                     0x00000001

#define _CNNEC_CNNEC3_POSITION                   0x00000003
#define _CNNEC_CNNEC3_MASK                       0x00000008
#define _CNNEC_CNNEC3_LENGTH                     0x00000001

#define _CNNEC_CNNEC4_POSITION                   0x00000004
#define _CNNEC_CNNEC4_MASK                       0x00000010
#define _CNNEC_CNNEC4_LENGTH                     0x00000001

#define _CNNEC_CNNEC5_POSITION                   0x00000005
#define _CNNEC_CNNEC5_MASK                       0x00000020
#define _CNNEC_CNNEC5_LENGTH                     0x00000001

#define _CNNEC_CNNEC6_POSITION                   0x00000006
#define _CNNEC_CNNEC6_MASK                       0x00000040
#define _CNNEC_CNNEC6_LENGTH                     0x00000001

#define _CNNEC_CNNEC7_POSITION                   0x00000007
#define _CNNEC_CNNEC7_MASK                       0x00000080
#define _CNNEC_CNNEC7_LENGTH                     0x00000001

#define _CNNEC_CNNEC8_POSITION                   0x00000008
#define _CNNEC_CNNEC8_MASK                       0x00000100
#define _CNNEC_CNNEC8_LENGTH                     0x00000001

#define _CNNEC_CNNEC9_POSITION                   0x00000009
#define _CNNEC_CNNEC9_MASK                       0x00000200
#define _CNNEC_CNNEC9_LENGTH                     0x00000001

#define _CNNEC_CNNEC10_POSITION                  0x0000000A
#define _CNNEC_CNNEC10_MASK                      0x00000400
#define _CNNEC_CNNEC10_LENGTH                    0x00000001

#define _CNNEC_CNNEC11_POSITION                  0x0000000B
#define _CNNEC_CNNEC11_MASK                      0x00000800
#define _CNNEC_CNNEC11_LENGTH                    0x00000001

#define _CNNEC_CNNEC12_POSITION                  0x0000000C
#define _CNNEC_CNNEC12_MASK                      0x00001000
#define _CNNEC_CNNEC12_LENGTH                    0x00000001

#define _CNNEC_CNNEC13_POSITION                  0x0000000D
#define _CNNEC_CNNEC13_MASK                      0x00002000
#define _CNNEC_CNNEC13_LENGTH                    0x00000001

#define _CNNEC_CNNEC14_POSITION                  0x0000000E
#define _CNNEC_CNNEC14_MASK                      0x00004000
#define _CNNEC_CNNEC14_LENGTH                    0x00000001

#define _CNNEC_CNNEC15_POSITION                  0x0000000F
#define _CNNEC_CNNEC15_MASK                      0x00008000
#define _CNNEC_CNNEC15_LENGTH                    0x00000001

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

#define _CNFC_CNFC4_POSITION                     0x00000004
#define _CNFC_CNFC4_MASK                         0x00000010
#define _CNFC_CNFC4_LENGTH                       0x00000001

#define _CNFC_CNFC5_POSITION                     0x00000005
#define _CNFC_CNFC5_MASK                         0x00000020
#define _CNFC_CNFC5_LENGTH                       0x00000001

#define _CNFC_CNFC6_POSITION                     0x00000006
#define _CNFC_CNFC6_MASK                         0x00000040
#define _CNFC_CNFC6_LENGTH                       0x00000001

#define _CNFC_CNFC7_POSITION                     0x00000007
#define _CNFC_CNFC7_MASK                         0x00000080
#define _CNFC_CNFC7_LENGTH                       0x00000001

