Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CNFC_CNFC8_POSITION                     0x00000008
#define _CNFC_CNFC8_MASK                         0x00000100
#define _CNFC_CNFC8_LENGTH                       0x00000001

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_CNFC10_POSITION                    0x0000000A
#define _CNFC_CNFC10_MASK                        0x00000400
#define _CNFC_CNFC10_LENGTH                      0x00000001

#define _CNFC_CNFC11_POSITION                    0x0000000B
#define _CNFC_CNFC11_MASK                        0x00000800
#define _CNFC_CNFC11_LENGTH                      0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_CNFC13_POSITION                    0x0000000D
#define _CNFC_CNFC13_MASK                        0x00002000
#define _CNFC_CNFC13_LENGTH                      0x00000001

#define _CNFC_CNFC14_POSITION                    0x0000000E
#define _CNFC_CNFC14_MASK                        0x00004000
#define _CNFC_CNFC14_LENGTH                      0x00000001

#define _CNFC_CNFC15_POSITION                    0x0000000F
#define _CNFC_CNFC15_MASK                        0x00008000
#define _CNFC_CNFC15_LENGTH                      0x00000001

#define _SRCON0C_SR0C0_POSITION                  0x00000000
#define _SRCON0C_SR0C0_MASK                      0x00000001
#define _SRCON0C_SR0C0_LENGTH                    0x00000001

#define _SRCON0C_SR0C1_POSITION                  0x00000001
#define _SRCON0C_SR0C1_MASK                      0x00000002
#define _SRCON0C_SR0C1_LENGTH                    0x00000001

#define _SRCON0C_SR0C2_POSITION                  0x00000002
#define _SRCON0C_SR0C2_MASK                      0x00000004
#define _SRCON0C_SR0C2_LENGTH                    0x00000001

#define _SRCON0C_SR0C3_POSITION                  0x00000003
#define _SRCON0C_SR0C3_MASK                      0x00000008
#define _SRCON0C_SR0C3_LENGTH                    0x00000001

#define _SRCON0C_SR0C4_POSITION                  0x00000004
#define _SRCON0C_SR0C4_MASK                      0x00000010
#define _SRCON0C_SR0C4_LENGTH                    0x00000001

#define _SRCON0C_SR0C5_POSITION                  0x00000005
#define _SRCON0C_SR0C5_MASK                      0x00000020
#define _SRCON0C_SR0C5_LENGTH                    0x00000001

#define _SRCON0C_SR0C13_POSITION                 0x0000000D
#define _SRCON0C_SR0C13_MASK                     0x00002000
#define _SRCON0C_SR0C13_LENGTH                   0x00000001

#define _SRCON0C_SR0C14_POSITION                 0x0000000E
#define _SRCON0C_SR0C14_MASK                     0x00004000
#define _SRCON0C_SR0C14_LENGTH                   0x00000001

#define _SRCON0C_SR0C15_POSITION                 0x0000000F
#define _SRCON0C_SR0C15_MASK                     0x00008000
#define _SRCON0C_SR0C15_LENGTH                   0x00000001

#define _SRCON1C_SR1C0_POSITION                  0x00000000
#define _SRCON1C_SR1C0_MASK                      0x00000001
#define _SRCON1C_SR1C0_LENGTH                    0x00000001

#define _SRCON1C_SR1C1_POSITION                  0x00000001
#define _SRCON1C_SR1C1_MASK                      0x00000002
#define _SRCON1C_SR1C1_LENGTH                    0x00000001

#define _SRCON1C_SR1C2_POSITION                  0x00000002
#define _SRCON1C_SR1C2_MASK                      0x00000004
#define _SRCON1C_SR1C2_LENGTH                    0x00000001

#define _SRCON1C_SR1C3_POSITION                  0x00000003
#define _SRCON1C_SR1C3_MASK                      0x00000008
#define _SRCON1C_SR1C3_LENGTH                    0x00000001

#define _SRCON1C_SR1C4_POSITION                  0x00000004
#define _SRCON1C_SR1C4_MASK                      0x00000010
#define _SRCON1C_SR1C4_LENGTH                    0x00000001

#define _SRCON1C_SR1C5_POSITION                  0x00000005
#define _SRCON1C_SR1C5_MASK                      0x00000020
#define _SRCON1C_SR1C5_LENGTH                    0x00000001

#define _SRCON1C_SR1C13_POSITION                 0x0000000D
#define _SRCON1C_SR1C13_MASK                     0x00002000
#define _SRCON1C_SR1C13_LENGTH                   0x00000001

#define _SRCON1C_SR1C14_POSITION                 0x0000000E
#define _SRCON1C_SR1C14_MASK                     0x00004000
#define _SRCON1C_SR1C14_LENGTH                   0x00000001

#define _SRCON1C_SR1C15_POSITION                 0x0000000F
#define _SRCON1C_SR1C15_MASK                     0x00008000
#define _SRCON1C_SR1C15_LENGTH                   0x00000001

#define _ANSELK_ANSK2_POSITION                   0x00000002
#define _ANSELK_ANSK2_MASK                       0x00000004
#define _ANSELK_ANSK2_LENGTH                     0x00000001

#define _ANSELK_ANSK3_POSITION                   0x00000003
#define _ANSELK_ANSK3_MASK                       0x00000008
#define _ANSELK_ANSK3_LENGTH                     0x00000001

#define _ANSELK_w_POSITION                       0x00000000
#define _ANSELK_w_MASK                           0xFFFFFFFF
#define _ANSELK_w_LENGTH                         0x00000020

#define _TRISK_TRISK0_POSITION                   0x00000000
#define _TRISK_TRISK0_MASK                       0x00000001
#define _TRISK_TRISK0_LENGTH                     0x00000001

#define _TRISK_TRISK1_POSITION                   0x00000001
#define _TRISK_TRISK1_MASK                       0x00000002
#define _TRISK_TRISK1_LENGTH                     0x00000001

#define _TRISK_TRISK2_POSITION                   0x00000002
#define _TRISK_TRISK2_MASK                       0x00000004
#define _TRISK_TRISK2_LENGTH                     0x00000001

#define _TRISK_TRISK3_POSITION                   0x00000003
#define _TRISK_TRISK3_MASK                       0x00000008
#define _TRISK_TRISK3_LENGTH                     0x00000001

#define _TRISK_TRISK4_POSITION                   0x00000004
#define _TRISK_TRISK4_MASK                       0x00000010
#define _TRISK_TRISK4_LENGTH                     0x00000001

#define _TRISK_TRISK5_POSITION                   0x00000005
#define _TRISK_TRISK5_MASK                       0x00000020
#define _TRISK_TRISK5_LENGTH                     0x00000001

#define _TRISK_TRISK6_POSITION                   0x00000006
#define _TRISK_TRISK6_MASK                       0x00000040
#define _TRISK_TRISK6_LENGTH                     0x00000001

