Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _LATK_LATK9_POSITION                     0x00000009
#define _LATK_LATK9_MASK                         0x00000200
#define _LATK_LATK9_LENGTH                       0x00000001

#define _LATK_LATK10_POSITION                    0x0000000A
#define _LATK_LATK10_MASK                        0x00000400
#define _LATK_LATK10_LENGTH                      0x00000001

#define _LATK_LATK11_POSITION                    0x0000000B
#define _LATK_LATK11_MASK                        0x00000800
#define _LATK_LATK11_LENGTH                      0x00000001

#define _LATK_LATK12_POSITION                    0x0000000C
#define _LATK_LATK12_MASK                        0x00001000
#define _LATK_LATK12_LENGTH                      0x00000001

#define _LATK_LATK13_POSITION                    0x0000000D
#define _LATK_LATK13_MASK                        0x00002000
#define _LATK_LATK13_LENGTH                      0x00000001

#define _LATK_LATK14_POSITION                    0x0000000E
#define _LATK_LATK14_MASK                        0x00004000
#define _LATK_LATK14_LENGTH                      0x00000001

#define _LATK_w_POSITION                         0x00000000
#define _LATK_w_MASK                             0xFFFFFFFF
#define _LATK_w_LENGTH                           0x00000020

#define _ODCK_ODCK0_POSITION                     0x00000000
#define _ODCK_ODCK0_MASK                         0x00000001
#define _ODCK_ODCK0_LENGTH                       0x00000001

#define _ODCK_ODCK1_POSITION                     0x00000001
#define _ODCK_ODCK1_MASK                         0x00000002
#define _ODCK_ODCK1_LENGTH                       0x00000001

#define _ODCK_ODCK2_POSITION                     0x00000002
#define _ODCK_ODCK2_MASK                         0x00000004
#define _ODCK_ODCK2_LENGTH                       0x00000001

#define _ODCK_ODCK3_POSITION                     0x00000003
#define _ODCK_ODCK3_MASK                         0x00000008
#define _ODCK_ODCK3_LENGTH                       0x00000001

#define _ODCK_ODCK4_POSITION                     0x00000004
#define _ODCK_ODCK4_MASK                         0x00000010
#define _ODCK_ODCK4_LENGTH                       0x00000001

#define _ODCK_ODCK5_POSITION                     0x00000005
#define _ODCK_ODCK5_MASK                         0x00000020
#define _ODCK_ODCK5_LENGTH                       0x00000001

#define _ODCK_ODCK6_POSITION                     0x00000006
#define _ODCK_ODCK6_MASK                         0x00000040
#define _ODCK_ODCK6_LENGTH                       0x00000001

#define _ODCK_ODCK7_POSITION                     0x00000007
#define _ODCK_ODCK7_MASK                         0x00000080
#define _ODCK_ODCK7_LENGTH                       0x00000001

#define _ODCK_ODCK8_POSITION                     0x00000008
#define _ODCK_ODCK8_MASK                         0x00000100
#define _ODCK_ODCK8_LENGTH                       0x00000001

#define _ODCK_ODCK9_POSITION                     0x00000009
#define _ODCK_ODCK9_MASK                         0x00000200
#define _ODCK_ODCK9_LENGTH                       0x00000001

#define _ODCK_ODCK10_POSITION                    0x0000000A
#define _ODCK_ODCK10_MASK                        0x00000400
#define _ODCK_ODCK10_LENGTH                      0x00000001

#define _ODCK_ODCK11_POSITION                    0x0000000B
#define _ODCK_ODCK11_MASK                        0x00000800
#define _ODCK_ODCK11_LENGTH                      0x00000001

#define _ODCK_ODCK12_POSITION                    0x0000000C
#define _ODCK_ODCK12_MASK                        0x00001000
#define _ODCK_ODCK12_LENGTH                      0x00000001

#define _ODCK_ODCK13_POSITION                    0x0000000D
#define _ODCK_ODCK13_MASK                        0x00002000
#define _ODCK_ODCK13_LENGTH                      0x00000001

#define _ODCK_ODCK14_POSITION                    0x0000000E
#define _ODCK_ODCK14_MASK                        0x00004000
#define _ODCK_ODCK14_LENGTH                      0x00000001

#define _ODCK_w_POSITION                         0x00000000
#define _ODCK_w_MASK                             0xFFFFFFFF
#define _ODCK_w_LENGTH                           0x00000020

#define _CNPUK_CNPUK0_POSITION                   0x00000000
#define _CNPUK_CNPUK0_MASK                       0x00000001
#define _CNPUK_CNPUK0_LENGTH                     0x00000001

#define _CNPUK_CNPUK1_POSITION                   0x00000001
#define _CNPUK_CNPUK1_MASK                       0x00000002
#define _CNPUK_CNPUK1_LENGTH                     0x00000001

#define _CNPUK_CNPUK2_POSITION                   0x00000002
#define _CNPUK_CNPUK2_MASK                       0x00000004
#define _CNPUK_CNPUK2_LENGTH                     0x00000001

#define _CNPUK_CNPUK3_POSITION                   0x00000003
#define _CNPUK_CNPUK3_MASK                       0x00000008
#define _CNPUK_CNPUK3_LENGTH                     0x00000001

#define _CNPUK_CNPUK4_POSITION                   0x00000004
#define _CNPUK_CNPUK4_MASK                       0x00000010
#define _CNPUK_CNPUK4_LENGTH                     0x00000001

#define _CNPUK_CNPUK5_POSITION                   0x00000005
#define _CNPUK_CNPUK5_MASK                       0x00000020
#define _CNPUK_CNPUK5_LENGTH                     0x00000001

#define _CNPUK_CNPUK6_POSITION                   0x00000006
#define _CNPUK_CNPUK6_MASK                       0x00000040
#define _CNPUK_CNPUK6_LENGTH                     0x00000001

#define _CNPUK_CNPUK7_POSITION                   0x00000007
#define _CNPUK_CNPUK7_MASK                       0x00000080
#define _CNPUK_CNPUK7_LENGTH                     0x00000001

#define _CNPUK_CNPUK8_POSITION                   0x00000008
#define _CNPUK_CNPUK8_MASK                       0x00000100
#define _CNPUK_CNPUK8_LENGTH                     0x00000001

#define _CNPUK_CNPUK9_POSITION                   0x00000009
#define _CNPUK_CNPUK9_MASK                       0x00000200
#define _CNPUK_CNPUK9_LENGTH                     0x00000001

#define _CNPUK_CNPUK10_POSITION                  0x0000000A
#define _CNPUK_CNPUK10_MASK                      0x00000400
#define _CNPUK_CNPUK10_LENGTH                    0x00000001

#define _CNPUK_CNPUK11_POSITION                  0x0000000B
#define _CNPUK_CNPUK11_MASK                      0x00000800
#define _CNPUK_CNPUK11_LENGTH                    0x00000001

#define _CNPUK_CNPUK12_POSITION                  0x0000000C
#define _CNPUK_CNPUK12_MASK                      0x00001000
#define _CNPUK_CNPUK12_LENGTH                    0x00000001

#define _CNPUK_CNPUK13_POSITION                  0x0000000D
#define _CNPUK_CNPUK13_MASK                      0x00002000
#define _CNPUK_CNPUK13_LENGTH                    0x00000001

#define _CNPUK_CNPUK14_POSITION                  0x0000000E
#define _CNPUK_CNPUK14_MASK                      0x00004000
#define _CNPUK_CNPUK14_LENGTH                    0x00000001

