Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CNENK_CNIEK14_POSITION                  0x0000000E
#define _CNENK_CNIEK14_MASK                      0x00004000
#define _CNENK_CNIEK14_LENGTH                    0x00000001

#define _CNENK_w_POSITION                        0x00000000
#define _CNENK_w_MASK                            0xFFFFFFFF
#define _CNENK_w_LENGTH                          0x00000020

#define _CNSTATK_CNSTATK0_POSITION               0x00000000
#define _CNSTATK_CNSTATK0_MASK                   0x00000001
#define _CNSTATK_CNSTATK0_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK1_POSITION               0x00000001
#define _CNSTATK_CNSTATK1_MASK                   0x00000002
#define _CNSTATK_CNSTATK1_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK2_POSITION               0x00000002
#define _CNSTATK_CNSTATK2_MASK                   0x00000004
#define _CNSTATK_CNSTATK2_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK3_POSITION               0x00000003
#define _CNSTATK_CNSTATK3_MASK                   0x00000008
#define _CNSTATK_CNSTATK3_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK4_POSITION               0x00000004
#define _CNSTATK_CNSTATK4_MASK                   0x00000010
#define _CNSTATK_CNSTATK4_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK5_POSITION               0x00000005
#define _CNSTATK_CNSTATK5_MASK                   0x00000020
#define _CNSTATK_CNSTATK5_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK6_POSITION               0x00000006
#define _CNSTATK_CNSTATK6_MASK                   0x00000040
#define _CNSTATK_CNSTATK6_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK7_POSITION               0x00000007
#define _CNSTATK_CNSTATK7_MASK                   0x00000080
#define _CNSTATK_CNSTATK7_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK8_POSITION               0x00000008
#define _CNSTATK_CNSTATK8_MASK                   0x00000100
#define _CNSTATK_CNSTATK8_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK9_POSITION               0x00000009
#define _CNSTATK_CNSTATK9_MASK                   0x00000200
#define _CNSTATK_CNSTATK9_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK10_POSITION              0x0000000A
#define _CNSTATK_CNSTATK10_MASK                  0x00000400
#define _CNSTATK_CNSTATK10_LENGTH                0x00000001

#define _CNSTATK_CNSTATK11_POSITION              0x0000000B
#define _CNSTATK_CNSTATK11_MASK                  0x00000800
#define _CNSTATK_CNSTATK11_LENGTH                0x00000001

#define _CNSTATK_CNSTATK12_POSITION              0x0000000C
#define _CNSTATK_CNSTATK12_MASK                  0x00001000
#define _CNSTATK_CNSTATK12_LENGTH                0x00000001

#define _CNSTATK_CNSTATK13_POSITION              0x0000000D
#define _CNSTATK_CNSTATK13_MASK                  0x00002000
#define _CNSTATK_CNSTATK13_LENGTH                0x00000001

#define _CNSTATK_CNSTATK14_POSITION              0x0000000E
#define _CNSTATK_CNSTATK14_MASK                  0x00004000
#define _CNSTATK_CNSTATK14_LENGTH                0x00000001

#define _CNSTATK_w_POSITION                      0x00000000
#define _CNSTATK_w_MASK                          0xFFFFFFFF
#define _CNSTATK_w_LENGTH                        0x00000020

#define _CNNEK_CNNEK0_POSITION                   0x00000000
#define _CNNEK_CNNEK0_MASK                       0x00000001
#define _CNNEK_CNNEK0_LENGTH                     0x00000001

#define _CNNEK_CNNEK1_POSITION                   0x00000001
#define _CNNEK_CNNEK1_MASK                       0x00000002
#define _CNNEK_CNNEK1_LENGTH                     0x00000001

#define _CNNEK_CNNEK2_POSITION                   0x00000002
#define _CNNEK_CNNEK2_MASK                       0x00000004
#define _CNNEK_CNNEK2_LENGTH                     0x00000001

#define _CNNEK_CNNEK3_POSITION                   0x00000003
#define _CNNEK_CNNEK3_MASK                       0x00000008
#define _CNNEK_CNNEK3_LENGTH                     0x00000001

#define _CNNEK_CNNEK4_POSITION                   0x00000004
#define _CNNEK_CNNEK4_MASK                       0x00000010
#define _CNNEK_CNNEK4_LENGTH                     0x00000001

#define _CNNEK_CNNEK5_POSITION                   0x00000005
#define _CNNEK_CNNEK5_MASK                       0x00000020
#define _CNNEK_CNNEK5_LENGTH                     0x00000001

#define _CNNEK_CNNEK6_POSITION                   0x00000006
#define _CNNEK_CNNEK6_MASK                       0x00000040
#define _CNNEK_CNNEK6_LENGTH                     0x00000001

#define _CNNEK_CNNEK7_POSITION                   0x00000007
#define _CNNEK_CNNEK7_MASK                       0x00000080
#define _CNNEK_CNNEK7_LENGTH                     0x00000001

#define _CNNEK_CNNEK8_POSITION                   0x00000008
#define _CNNEK_CNNEK8_MASK                       0x00000100
#define _CNNEK_CNNEK8_LENGTH                     0x00000001

#define _CNNEK_CNNEK9_POSITION                   0x00000009
#define _CNNEK_CNNEK9_MASK                       0x00000200
#define _CNNEK_CNNEK9_LENGTH                     0x00000001

#define _CNNEK_CNNEK10_POSITION                  0x0000000A
#define _CNNEK_CNNEK10_MASK                      0x00000400
#define _CNNEK_CNNEK10_LENGTH                    0x00000001

#define _CNNEK_CNNEK11_POSITION                  0x0000000B
#define _CNNEK_CNNEK11_MASK                      0x00000800
#define _CNNEK_CNNEK11_LENGTH                    0x00000001

#define _CNNEK_CNNEK12_POSITION                  0x0000000C
#define _CNNEK_CNNEK12_MASK                      0x00001000
#define _CNNEK_CNNEK12_LENGTH                    0x00000001

#define _CNNEK_CNNEK13_POSITION                  0x0000000D
#define _CNNEK_CNNEK13_MASK                      0x00002000
#define _CNNEK_CNNEK13_LENGTH                    0x00000001

#define _CNNEK_CNNEK14_POSITION                  0x0000000E
#define _CNNEK_CNNEK14_MASK                      0x00004000
#define _CNNEK_CNNEK14_LENGTH                    0x00000001

#define _CNFK_CNFK0_POSITION                     0x00000000
#define _CNFK_CNFK0_MASK                         0x00000001
#define _CNFK_CNFK0_LENGTH                       0x00000001

