Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CNFK_CNFK1_POSITION                     0x00000001
#define _CNFK_CNFK1_MASK                         0x00000002
#define _CNFK_CNFK1_LENGTH                       0x00000001

#define _CNFK_CNFK2_POSITION                     0x00000002
#define _CNFK_CNFK2_MASK                         0x00000004
#define _CNFK_CNFK2_LENGTH                       0x00000001

#define _CNFK_CNFK3_POSITION                     0x00000003
#define _CNFK_CNFK3_MASK                         0x00000008
#define _CNFK_CNFK3_LENGTH                       0x00000001

#define _CNFK_CNFK4_POSITION                     0x00000004
#define _CNFK_CNFK4_MASK                         0x00000010
#define _CNFK_CNFK4_LENGTH                       0x00000001

#define _CNFK_CNFK5_POSITION                     0x00000005
#define _CNFK_CNFK5_MASK                         0x00000020
#define _CNFK_CNFK5_LENGTH                       0x00000001

#define _CNFK_CNFK6_POSITION                     0x00000006
#define _CNFK_CNFK6_MASK                         0x00000040
#define _CNFK_CNFK6_LENGTH                       0x00000001

#define _CNFK_CNFK7_POSITION                     0x00000007
#define _CNFK_CNFK7_MASK                         0x00000080
#define _CNFK_CNFK7_LENGTH                       0x00000001

#define _CNFK_CNFK8_POSITION                     0x00000008
#define _CNFK_CNFK8_MASK                         0x00000100
#define _CNFK_CNFK8_LENGTH                       0x00000001

#define _CNFK_CNFK9_POSITION                     0x00000009
#define _CNFK_CNFK9_MASK                         0x00000200
#define _CNFK_CNFK9_LENGTH                       0x00000001

#define _CNFK_CNFK10_POSITION                    0x0000000A
#define _CNFK_CNFK10_MASK                        0x00000400
#define _CNFK_CNFK10_LENGTH                      0x00000001

#define _CNFK_CNFK11_POSITION                    0x0000000B
#define _CNFK_CNFK11_MASK                        0x00000800
#define _CNFK_CNFK11_LENGTH                      0x00000001

#define _CNFK_CNFK12_POSITION                    0x0000000C
#define _CNFK_CNFK12_MASK                        0x00001000
#define _CNFK_CNFK12_LENGTH                      0x00000001

#define _CNFK_CNFK13_POSITION                    0x0000000D
#define _CNFK_CNFK13_MASK                        0x00002000
#define _CNFK_CNFK13_LENGTH                      0x00000001

#define _CNFK_CNFK14_POSITION                    0x0000000E
#define _CNFK_CNFK14_MASK                        0x00004000
#define _CNFK_CNFK14_LENGTH                      0x00000001

#define _SRCON0K_SR0K13_POSITION                 0x0000000D
#define _SRCON0K_SR0K13_MASK                     0x00002000
#define _SRCON0K_SR0K13_LENGTH                   0x00000001

#define _SRCON0K_SR0K14_POSITION                 0x0000000E
#define _SRCON0K_SR0K14_MASK                     0x00004000
#define _SRCON0K_SR0K14_LENGTH                   0x00000001

#define _SRCON1K_SR1K13_POSITION                 0x0000000D
#define _SRCON1K_SR1K13_MASK                     0x00002000
#define _SRCON1K_SR1K13_LENGTH                   0x00000001

#define _SRCON1K_SR1K14_POSITION                 0x0000000E
#define _SRCON1K_SR1K14_MASK                     0x00004000
#define _SRCON1K_SR1K14_LENGTH                   0x00000001

#define _I2C1CON_SEN_POSITION                    0x00000000
#define _I2C1CON_SEN_MASK                        0x00000001
#define _I2C1CON_SEN_LENGTH                      0x00000001

#define _I2C1CON_RSEN_POSITION                   0x00000001
#define _I2C1CON_RSEN_MASK                       0x00000002
#define _I2C1CON_RSEN_LENGTH                     0x00000001

#define _I2C1CON_PEN_POSITION                    0x00000002
#define _I2C1CON_PEN_MASK                        0x00000004
#define _I2C1CON_PEN_LENGTH                      0x00000001

#define _I2C1CON_RCEN_POSITION                   0x00000003
#define _I2C1CON_RCEN_MASK                       0x00000008
#define _I2C1CON_RCEN_LENGTH                     0x00000001

#define _I2C1CON_ACKEN_POSITION                  0x00000004
#define _I2C1CON_ACKEN_MASK                      0x00000010
#define _I2C1CON_ACKEN_LENGTH                    0x00000001

#define _I2C1CON_ACKDT_POSITION                  0x00000005
#define _I2C1CON_ACKDT_MASK                      0x00000020
#define _I2C1CON_ACKDT_LENGTH                    0x00000001

#define _I2C1CON_STREN_POSITION                  0x00000006
#define _I2C1CON_STREN_MASK                      0x00000040
#define _I2C1CON_STREN_LENGTH                    0x00000001

#define _I2C1CON_GCEN_POSITION                   0x00000007
#define _I2C1CON_GCEN_MASK                       0x00000080
#define _I2C1CON_GCEN_LENGTH                     0x00000001

#define _I2C1CON_SMEN_POSITION                   0x00000008
#define _I2C1CON_SMEN_MASK                       0x00000100
#define _I2C1CON_SMEN_LENGTH                     0x00000001

#define _I2C1CON_DISSLW_POSITION                 0x00000009
#define _I2C1CON_DISSLW_MASK                     0x00000200
#define _I2C1CON_DISSLW_LENGTH                   0x00000001

#define _I2C1CON_A10M_POSITION                   0x0000000A
#define _I2C1CON_A10M_MASK                       0x00000400
#define _I2C1CON_A10M_LENGTH                     0x00000001

#define _I2C1CON_STRICT_POSITION                 0x0000000B
#define _I2C1CON_STRICT_MASK                     0x00000800
#define _I2C1CON_STRICT_LENGTH                   0x00000001

#define _I2C1CON_SCLREL_POSITION                 0x0000000C
#define _I2C1CON_SCLREL_MASK                     0x00001000
#define _I2C1CON_SCLREL_LENGTH                   0x00000001

#define _I2C1CON_SIDL_POSITION                   0x0000000D
#define _I2C1CON_SIDL_MASK                       0x00002000
#define _I2C1CON_SIDL_LENGTH                     0x00000001

#define _I2C1CON_ON_POSITION                     0x0000000F
#define _I2C1CON_ON_MASK                         0x00008000
#define _I2C1CON_ON_LENGTH                       0x00000001

#define _I2C1CON_DHEN_POSITION                   0x00000010
#define _I2C1CON_DHEN_MASK                       0x00010000
#define _I2C1CON_DHEN_LENGTH                     0x00000001

#define _I2C1CON_AHEN_POSITION                   0x00000011
#define _I2C1CON_AHEN_MASK                       0x00020000
#define _I2C1CON_AHEN_LENGTH                     0x00000001

