Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _ADCCMPEN2_CMPE7_POSITION                0x00000007
#define _ADCCMPEN2_CMPE7_MASK                    0x00000080
#define _ADCCMPEN2_CMPE7_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE8_POSITION                0x00000008
#define _ADCCMPEN2_CMPE8_MASK                    0x00000100
#define _ADCCMPEN2_CMPE8_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE9_POSITION                0x00000009
#define _ADCCMPEN2_CMPE9_MASK                    0x00000200
#define _ADCCMPEN2_CMPE9_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE10_POSITION               0x0000000A
#define _ADCCMPEN2_CMPE10_MASK                   0x00000400
#define _ADCCMPEN2_CMPE10_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE11_POSITION               0x0000000B
#define _ADCCMPEN2_CMPE11_MASK                   0x00000800
#define _ADCCMPEN2_CMPE11_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE12_POSITION               0x0000000C
#define _ADCCMPEN2_CMPE12_MASK                   0x00001000
#define _ADCCMPEN2_CMPE12_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN2_CMPE13_MASK                   0x00002000
#define _ADCCMPEN2_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE14_POSITION               0x0000000E
#define _ADCCMPEN2_CMPE14_MASK                   0x00004000
#define _ADCCMPEN2_CMPE14_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN2_CMPE15_MASK                   0x00008000
#define _ADCCMPEN2_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE16_POSITION               0x00000010
#define _ADCCMPEN2_CMPE16_MASK                   0x00010000
#define _ADCCMPEN2_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE17_POSITION               0x00000011
#define _ADCCMPEN2_CMPE17_MASK                   0x00020000
#define _ADCCMPEN2_CMPE17_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE18_POSITION               0x00000012
#define _ADCCMPEN2_CMPE18_MASK                   0x00040000
#define _ADCCMPEN2_CMPE18_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE19_POSITION               0x00000013
#define _ADCCMPEN2_CMPE19_MASK                   0x00080000
#define _ADCCMPEN2_CMPE19_LENGTH                 0x00000001

#define _ADCCMP2_DCMPLO_POSITION                 0x00000000
#define _ADCCMP2_DCMPLO_MASK                     0x0000FFFF
#define _ADCCMP2_DCMPLO_LENGTH                   0x00000010

#define _ADCCMP2_DCMPHI_POSITION                 0x00000010
#define _ADCCMP2_DCMPHI_MASK                     0xFFFF0000
#define _ADCCMP2_DCMPHI_LENGTH                   0x00000010

#define _ADCFLTR1_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR1_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR1_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR1_CHNLID_POSITION                0x00000010
#define _ADCFLTR1_CHNLID_MASK                    0x001F0000
#define _ADCFLTR1_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR1_AFRDY_POSITION                 0x00000018
#define _ADCFLTR1_AFRDY_MASK                     0x01000000
#define _ADCFLTR1_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR1_AFGIEN_POSITION                0x00000019
#define _ADCFLTR1_AFGIEN_MASK                    0x02000000
#define _ADCFLTR1_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR1_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR1_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR1_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR1_DFMODE_POSITION                0x0000001D
#define _ADCFLTR1_DFMODE_MASK                    0x20000000
#define _ADCFLTR1_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR1_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR1_DATA16EN_MASK                  0x40000000
#define _ADCFLTR1_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR1_AFEN_POSITION                  0x0000001F
#define _ADCFLTR1_AFEN_MASK                      0x80000000
#define _ADCFLTR1_AFEN_LENGTH                    0x00000001

#define _ADCFLTR2_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR2_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR2_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR2_CHNLID_POSITION                0x00000010
#define _ADCFLTR2_CHNLID_MASK                    0x001F0000
#define _ADCFLTR2_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR2_AFRDY_POSITION                 0x00000018
#define _ADCFLTR2_AFRDY_MASK                     0x01000000
#define _ADCFLTR2_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR2_AFGIEN_POSITION                0x00000019
#define _ADCFLTR2_AFGIEN_MASK                    0x02000000
#define _ADCFLTR2_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR2_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR2_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR2_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR2_DFMODE_POSITION                0x0000001D
#define _ADCFLTR2_DFMODE_MASK                    0x20000000
#define _ADCFLTR2_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR2_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR2_DATA16EN_MASK                  0x40000000
#define _ADCFLTR2_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR2_AFEN_POSITION                  0x0000001F
#define _ADCFLTR2_AFEN_MASK                      0x80000000
#define _ADCFLTR2_AFEN_LENGTH                    0x00000001

#define _ADCTRG1_TRGSRC0_POSITION                0x00000000
#define _ADCTRG1_TRGSRC0_MASK                    0x0000001F
#define _ADCTRG1_TRGSRC0_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC1_POSITION                0x00000008
#define _ADCTRG1_TRGSRC1_MASK                    0x00001F00
#define _ADCTRG1_TRGSRC1_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC2_POSITION                0x00000010
#define _ADCTRG1_TRGSRC2_MASK                    0x001F0000
#define _ADCTRG1_TRGSRC2_LENGTH                  0x00000005

