Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CFD2FIFOSTA11_TFNRFNIF_POSITION         0x00000000
#define _CFD2FIFOSTA11_TFNRFNIF_MASK             0x00000001
#define _CFD2FIFOSTA11_TFNRFNIF_LENGTH           0x00000001

#define _CFD2FIFOSTA11_TFHRFHIF_POSITION         0x00000001
#define _CFD2FIFOSTA11_TFHRFHIF_MASK             0x00000002
#define _CFD2FIFOSTA11_TFHRFHIF_LENGTH           0x00000001

#define _CFD2FIFOSTA11_TFERFFIF_POSITION         0x00000002
#define _CFD2FIFOSTA11_TFERFFIF_MASK             0x00000004
#define _CFD2FIFOSTA11_TFERFFIF_LENGTH           0x00000001

#define _CFD2FIFOSTA11_RXOVIF_POSITION           0x00000003
#define _CFD2FIFOSTA11_RXOVIF_MASK               0x00000008
#define _CFD2FIFOSTA11_RXOVIF_LENGTH             0x00000001

#define _CFD2FIFOSTA11_TXATIF_POSITION           0x00000004
#define _CFD2FIFOSTA11_TXATIF_MASK               0x00000010
#define _CFD2FIFOSTA11_TXATIF_LENGTH             0x00000001

#define _CFD2FIFOSTA11_TXERR_POSITION            0x00000005
#define _CFD2FIFOSTA11_TXERR_MASK                0x00000020
#define _CFD2FIFOSTA11_TXERR_LENGTH              0x00000001

#define _CFD2FIFOSTA11_TXLARB_POSITION           0x00000006
#define _CFD2FIFOSTA11_TXLARB_MASK               0x00000040
#define _CFD2FIFOSTA11_TXLARB_LENGTH             0x00000001

#define _CFD2FIFOSTA11_TXABT_POSITION            0x00000007
#define _CFD2FIFOSTA11_TXABT_MASK                0x00000080
#define _CFD2FIFOSTA11_TXABT_LENGTH              0x00000001

#define _CFD2FIFOSTA11_FIFOCI_POSITION           0x00000008
#define _CFD2FIFOSTA11_FIFOCI_MASK               0x00001F00
#define _CFD2FIFOSTA11_FIFOCI_LENGTH             0x00000005

#define _CFD2FIFOUA11_FIFOUA_POSITION            0x00000000
#define _CFD2FIFOUA11_FIFOUA_MASK                0xFFFFFFFF
#define _CFD2FIFOUA11_FIFOUA_LENGTH              0x00000020

#define _CFD2FIFOCON12_TFNRFNIE_POSITION         0x00000000
#define _CFD2FIFOCON12_TFNRFNIE_MASK             0x00000001
#define _CFD2FIFOCON12_TFNRFNIE_LENGTH           0x00000001

#define _CFD2FIFOCON12_TFHRFHIE_POSITION         0x00000001
#define _CFD2FIFOCON12_TFHRFHIE_MASK             0x00000002
#define _CFD2FIFOCON12_TFHRFHIE_LENGTH           0x00000001

#define _CFD2FIFOCON12_TFERFFIE_POSITION         0x00000002
#define _CFD2FIFOCON12_TFERFFIE_MASK             0x00000004
#define _CFD2FIFOCON12_TFERFFIE_LENGTH           0x00000001

#define _CFD2FIFOCON12_RXOVIE_POSITION           0x00000003
#define _CFD2FIFOCON12_RXOVIE_MASK               0x00000008
#define _CFD2FIFOCON12_RXOVIE_LENGTH             0x00000001

#define _CFD2FIFOCON12_TXATIE_POSITION           0x00000004
#define _CFD2FIFOCON12_TXATIE_MASK               0x00000010
#define _CFD2FIFOCON12_TXATIE_LENGTH             0x00000001

#define _CFD2FIFOCON12_RXTSEN_POSITION           0x00000005
#define _CFD2FIFOCON12_RXTSEN_MASK               0x00000020
#define _CFD2FIFOCON12_RXTSEN_LENGTH             0x00000001

#define _CFD2FIFOCON12_RTREN_POSITION            0x00000006
#define _CFD2FIFOCON12_RTREN_MASK                0x00000040
#define _CFD2FIFOCON12_RTREN_LENGTH              0x00000001

#define _CFD2FIFOCON12_TXEN_POSITION             0x00000007
#define _CFD2FIFOCON12_TXEN_MASK                 0x00000080
#define _CFD2FIFOCON12_TXEN_LENGTH               0x00000001

#define _CFD2FIFOCON12_UINC_POSITION             0x00000008
#define _CFD2FIFOCON12_UINC_MASK                 0x00000100
#define _CFD2FIFOCON12_UINC_LENGTH               0x00000001

#define _CFD2FIFOCON12_TXREQ_POSITION            0x00000009
#define _CFD2FIFOCON12_TXREQ_MASK                0x00000200
#define _CFD2FIFOCON12_TXREQ_LENGTH              0x00000001

#define _CFD2FIFOCON12_FRESET_POSITION           0x0000000A
#define _CFD2FIFOCON12_FRESET_MASK               0x00000400
#define _CFD2FIFOCON12_FRESET_LENGTH             0x00000001

#define _CFD2FIFOCON12_TXPRI_POSITION            0x00000010
#define _CFD2FIFOCON12_TXPRI_MASK                0x001F0000
#define _CFD2FIFOCON12_TXPRI_LENGTH              0x00000005

#define _CFD2FIFOCON12_TXAT_POSITION             0x00000015
#define _CFD2FIFOCON12_TXAT_MASK                 0x00600000
#define _CFD2FIFOCON12_TXAT_LENGTH               0x00000002

#define _CFD2FIFOCON12_FSIZE_POSITION            0x00000018
#define _CFD2FIFOCON12_FSIZE_MASK                0x1F000000
#define _CFD2FIFOCON12_FSIZE_LENGTH              0x00000005

#define _CFD2FIFOCON12_PLSIZE_POSITION           0x0000001D
#define _CFD2FIFOCON12_PLSIZE_MASK               0xE0000000
#define _CFD2FIFOCON12_PLSIZE_LENGTH             0x00000003

#define _CFD2FIFOSTA12_TFNRFNIF_POSITION         0x00000000
#define _CFD2FIFOSTA12_TFNRFNIF_MASK             0x00000001
#define _CFD2FIFOSTA12_TFNRFNIF_LENGTH           0x00000001

#define _CFD2FIFOSTA12_TFHRFHIF_POSITION         0x00000001
#define _CFD2FIFOSTA12_TFHRFHIF_MASK             0x00000002
#define _CFD2FIFOSTA12_TFHRFHIF_LENGTH           0x00000001

#define _CFD2FIFOSTA12_TFERFFIF_POSITION         0x00000002
#define _CFD2FIFOSTA12_TFERFFIF_MASK             0x00000004
#define _CFD2FIFOSTA12_TFERFFIF_LENGTH           0x00000001

#define _CFD2FIFOSTA12_RXOVIF_POSITION           0x00000003
#define _CFD2FIFOSTA12_RXOVIF_MASK               0x00000008
#define _CFD2FIFOSTA12_RXOVIF_LENGTH             0x00000001

#define _CFD2FIFOSTA12_TXATIF_POSITION           0x00000004
#define _CFD2FIFOSTA12_TXATIF_MASK               0x00000010
#define _CFD2FIFOSTA12_TXATIF_LENGTH             0x00000001

#define _CFD2FIFOSTA12_TXERR_POSITION            0x00000005
#define _CFD2FIFOSTA12_TXERR_MASK                0x00000020
#define _CFD2FIFOSTA12_TXERR_LENGTH              0x00000001

#define _CFD2FIFOSTA12_TXLARB_POSITION           0x00000006
#define _CFD2FIFOSTA12_TXLARB_MASK               0x00000040
#define _CFD2FIFOSTA12_TXLARB_LENGTH             0x00000001

#define _CFD2FIFOSTA12_TXABT_POSITION            0x00000007
#define _CFD2FIFOSTA12_TXABT_MASK                0x00000080
#define _CFD2FIFOSTA12_TXABT_LENGTH              0x00000001

#define _CFD2FIFOSTA12_FIFOCI_POSITION           0x00000008
#define _CFD2FIFOSTA12_FIFOCI_MASK               0x00001F00
#define _CFD2FIFOSTA12_FIFOCI_LENGTH             0x00000005

#define _CFD2FIFOUA12_FIFOUA_POSITION            0x00000000
#define _CFD2FIFOUA12_FIFOUA_MASK                0xFFFFFFFF
#define _CFD2FIFOUA12_FIFOUA_LENGTH              0x00000020

#define _CFD2FIFOCON13_TFNRFNIE_POSITION         0x00000000
#define _CFD2FIFOCON13_TFNRFNIE_MASK             0x00000001
#define _CFD2FIFOCON13_TFNRFNIE_LENGTH           0x00000001

#define _CFD2FIFOCON13_TFHRFHIE_POSITION         0x00000001
#define _CFD2FIFOCON13_TFHRFHIE_MASK             0x00000002
#define _CFD2FIFOCON13_TFHRFHIE_LENGTH           0x00000001

#define _CFD2FIFOCON13_TFERFFIE_POSITION         0x00000002
#define _CFD2FIFOCON13_TFERFFIE_MASK             0x00000004
#define _CFD2FIFOCON13_TFERFFIE_LENGTH           0x00000001

