Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CVDSTAT_SD4BUSY_POSITION                0x0000000C
#define _CVDSTAT_SD4BUSY_MASK                    0x00001000
#define _CVDSTAT_SD4BUSY_LENGTH                  0x00000001

#define _CVDSTAT_SD4DONE_POSITION                0x0000000D
#define _CVDSTAT_SD4DONE_MASK                    0x00002000
#define _CVDSTAT_SD4DONE_LENGTH                  0x00000001

#define _CVDSTAT_SD4INT_POSITION                 0x0000000E
#define _CVDSTAT_SD4INT_MASK                     0x00004000
#define _CVDSTAT_SD4INT_LENGTH                   0x00000001

#define _CVDSTAT_FIFOCNT_POSITION                0x00000010
#define _CVDSTAT_FIFOCNT_MASK                    0x03FF0000
#define _CVDSTAT_FIFOCNT_LENGTH                  0x0000000A

#define _CVDSTAT_FIFOMT_POSITION                 0x0000001D
#define _CVDSTAT_FIFOMT_MASK                     0x20000000
#define _CVDSTAT_FIFOMT_LENGTH                   0x00000001

#define _CVDSTAT_FIFOWM_POSITION                 0x0000001E
#define _CVDSTAT_FIFOWM_MASK                     0x40000000
#define _CVDSTAT_FIFOWM_LENGTH                   0x00000001

#define _CVDSTAT_FIFOFULL_POSITION               0x0000001F
#define _CVDSTAT_FIFOFULL_MASK                   0x80000000
#define _CVDSTAT_FIFOFULL_LENGTH                 0x00000001

#define _CVDRES0H_POS_POSITION                   0x00000000
#define _CVDRES0H_POS_MASK                       0x00FFFFFF
#define _CVDRES0H_POS_LENGTH                     0x00000018

#define _CVDRES0L_NEG_POSITION                   0x00000000
#define _CVDRES0L_NEG_MASK                       0x00FFFFFF
#define _CVDRES0L_NEG_LENGTH                     0x00000018

#define _CVDRES0D_DELTA_POSITION                 0x00000000
#define _CVDRES0D_DELTA_MASK                     0x0003FFFF
#define _CVDRES0D_DELTA_LENGTH                   0x00000012

#define _CVDRES0D_RXINDEX_POSITION               0x00000013
#define _CVDRES0D_RXINDEX_MASK                   0x00F80000
#define _CVDRES0D_RXINDEX_LENGTH                 0x00000005

#define _CVDRES0D_SDNUM_POSITION                 0x00000018
#define _CVDRES0D_SDNUM_MASK                     0x03000000
#define _CVDRES0D_SDNUM_LENGTH                   0x00000002

#define _CVDRES0D_TXINDEX_POSITION               0x0000001B
#define _CVDRES0D_TXINDEX_MASK                   0xF8000000
#define _CVDRES0D_TXINDEX_LENGTH                 0x00000005

#define _CVDRX0_RXAN0_POSITION                   0x00000000
#define _CVDRX0_RXAN0_MASK                       0x0000003F
#define _CVDRX0_RXAN0_LENGTH                     0x00000006

#define _CVDRX0_RXAN1_POSITION                   0x00000008
#define _CVDRX0_RXAN1_MASK                       0x00003F00
#define _CVDRX0_RXAN1_LENGTH                     0x00000006

#define _CVDRX0_RXAN2_POSITION                   0x00000010
#define _CVDRX0_RXAN2_MASK                       0x003F0000
#define _CVDRX0_RXAN2_LENGTH                     0x00000006

#define _CVDRX0_RXAN3_POSITION                   0x00000018
#define _CVDRX0_RXAN3_MASK                       0x3F000000
#define _CVDRX0_RXAN3_LENGTH                     0x00000006

#define _CVDRX1_RXAN4_POSITION                   0x00000000
#define _CVDRX1_RXAN4_MASK                       0x0000003F
#define _CVDRX1_RXAN4_LENGTH                     0x00000006

#define _CVDRX1_RXAN5_POSITION                   0x00000008
#define _CVDRX1_RXAN5_MASK                       0x00003F00
#define _CVDRX1_RXAN5_LENGTH                     0x00000006

#define _CVDRX1_RXAN6_POSITION                   0x00000010
#define _CVDRX1_RXAN6_MASK                       0x003F0000
#define _CVDRX1_RXAN6_LENGTH                     0x00000006

#define _CVDRX1_RXAN7_POSITION                   0x00000018
#define _CVDRX1_RXAN7_MASK                       0x3F000000
#define _CVDRX1_RXAN7_LENGTH                     0x00000006

#define _CVDRX2_RXAN8_POSITION                   0x00000000
#define _CVDRX2_RXAN8_MASK                       0x0000003F
#define _CVDRX2_RXAN8_LENGTH                     0x00000006

#define _CVDRX2_RXAN9_POSITION                   0x00000008
#define _CVDRX2_RXAN9_MASK                       0x00003F00
#define _CVDRX2_RXAN9_LENGTH                     0x00000006

#define _CVDRX2_RXAN10_POSITION                  0x00000010
#define _CVDRX2_RXAN10_MASK                      0x003F0000
#define _CVDRX2_RXAN10_LENGTH                    0x00000006

#define _CVDRX2_RXAN11_POSITION                  0x00000018
#define _CVDRX2_RXAN11_MASK                      0x3F000000
#define _CVDRX2_RXAN11_LENGTH                    0x00000006

#define _CVDRX3_RXAN12_POSITION                  0x00000000
#define _CVDRX3_RXAN12_MASK                      0x0000003F
#define _CVDRX3_RXAN12_LENGTH                    0x00000006

#define _CVDRX3_RXAN13_POSITION                  0x00000008
#define _CVDRX3_RXAN13_MASK                      0x00003F00
#define _CVDRX3_RXAN13_LENGTH                    0x00000006

#define _CVDRX3_RXAN14_POSITION                  0x00000010
#define _CVDRX3_RXAN14_MASK                      0x003F0000
#define _CVDRX3_RXAN14_LENGTH                    0x00000006

#define _CVDRX3_RXAN15_POSITION                  0x00000018
#define _CVDRX3_RXAN15_MASK                      0x3F000000
#define _CVDRX3_RXAN15_LENGTH                    0x00000006

#define _CVDTX0_TXAN0_POSITION                   0x00000000
#define _CVDTX0_TXAN0_MASK                       0x0000003F
#define _CVDTX0_TXAN0_LENGTH                     0x00000006

#define _CVDTX0_TXAN1_POSITION                   0x00000008
#define _CVDTX0_TXAN1_MASK                       0x00003F00
#define _CVDTX0_TXAN1_LENGTH                     0x00000006

#define _CVDTX0_TXAN2_POSITION                   0x00000010
#define _CVDTX0_TXAN2_MASK                       0x003F0000
#define _CVDTX0_TXAN2_LENGTH                     0x00000006

#define _CVDTX0_TXAN3_POSITION                   0x00000018
#define _CVDTX0_TXAN3_MASK                       0x3F000000
#define _CVDTX0_TXAN3_LENGTH                     0x00000006

#define _CVDTX1_TXAN4_POSITION                   0x00000000
#define _CVDTX1_TXAN4_MASK                       0x0000003F
#define _CVDTX1_TXAN4_LENGTH                     0x00000006

