Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CVDTX1_TXAN5_POSITION                   0x00000008
#define _CVDTX1_TXAN5_MASK                       0x00003F00
#define _CVDTX1_TXAN5_LENGTH                     0x00000006

#define _CVDTX1_TXAN6_POSITION                   0x00000010
#define _CVDTX1_TXAN6_MASK                       0x003F0000
#define _CVDTX1_TXAN6_LENGTH                     0x00000006

#define _CVDTX1_TXAN7_POSITION                   0x00000018
#define _CVDTX1_TXAN7_MASK                       0x3F000000
#define _CVDTX1_TXAN7_LENGTH                     0x00000006

#define _CVDTX2_TXAN8_POSITION                   0x00000000
#define _CVDTX2_TXAN8_MASK                       0x0000003F
#define _CVDTX2_TXAN8_LENGTH                     0x00000006

#define _CVDTX2_TXAN9_POSITION                   0x00000008
#define _CVDTX2_TXAN9_MASK                       0x00003F00
#define _CVDTX2_TXAN9_LENGTH                     0x00000006

#define _CVDTX2_TXAN10_POSITION                  0x00000010
#define _CVDTX2_TXAN10_MASK                      0x003F0000
#define _CVDTX2_TXAN10_LENGTH                    0x00000006

#define _CVDTX2_TXAN11_POSITION                  0x00000018
#define _CVDTX2_TXAN11_MASK                      0x3F000000
#define _CVDTX2_TXAN11_LENGTH                    0x00000006

#define _CVDTX3_TXAN12_POSITION                  0x00000000
#define _CVDTX3_TXAN12_MASK                      0x0000003F
#define _CVDTX3_TXAN12_LENGTH                    0x00000006

#define _CVDTX3_TXAN13_POSITION                  0x00000008
#define _CVDTX3_TXAN13_MASK                      0x00003F00
#define _CVDTX3_TXAN13_LENGTH                    0x00000006

#define _CVDTX3_TXAN14_POSITION                  0x00000010
#define _CVDTX3_TXAN14_MASK                      0x003F0000
#define _CVDTX3_TXAN14_LENGTH                    0x00000006

#define _CVDTX3_TXAN15_POSITION                  0x00000018
#define _CVDTX3_TXAN15_MASK                      0x3F000000
#define _CVDTX3_TXAN15_LENGTH                    0x00000006

#define _CVDSD0C1_SD0OVRSAMP_POSITION            0x00000000
#define _CVDSD0C1_SD0OVRSAMP_MASK                0x000000FF
#define _CVDSD0C1_SD0OVRSAMP_LENGTH              0x00000008

#define _CVDSD0C1_SD0THRESH_POSITION             0x00000008
#define _CVDSD0C1_SD0THRESH_MASK                 0xFFFFFF00
#define _CVDSD0C1_SD0THRESH_LENGTH               0x00000018

#define _CVDSD0C2_SD0RXBEG_POSITION              0x00000000
#define _CVDSD0C2_SD0RXBEG_MASK                  0x0000003F
#define _CVDSD0C2_SD0RXBEG_LENGTH                0x00000006

#define _CVDSD0C2_SD0RXSTRIDE1_POSITION          0x00000006
#define _CVDSD0C2_SD0RXSTRIDE1_MASK              0x000000C0
#define _CVDSD0C2_SD0RXSTRIDE1_LENGTH            0x00000002

#define _CVDSD0C2_SD0RXEND_POSITION              0x00000008
#define _CVDSD0C2_SD0RXEND_MASK                  0x00003F00
#define _CVDSD0C2_SD0RXEND_LENGTH                0x00000006

#define _CVDSD0C2_SD0RXSTRIDE2_POSITION          0x0000000E
#define _CVDSD0C2_SD0RXSTRIDE2_MASK              0x0000C000
#define _CVDSD0C2_SD0RXSTRIDE2_LENGTH            0x00000002

#define _CVDSD0C2_SD0TXBEG_POSITION              0x00000010
#define _CVDSD0C2_SD0TXBEG_MASK                  0x003F0000
#define _CVDSD0C2_SD0TXBEG_LENGTH                0x00000006

#define _CVDSD0C2_SD0TXSTRIDE1_POSITION          0x00000016
#define _CVDSD0C2_SD0TXSTRIDE1_MASK              0x00C00000
#define _CVDSD0C2_SD0TXSTRIDE1_LENGTH            0x00000002

#define _CVDSD0C2_SD0TXEND_POSITION              0x00000018
#define _CVDSD0C2_SD0TXEND_MASK                  0x3F000000
#define _CVDSD0C2_SD0TXEND_LENGTH                0x00000006

#define _CVDSD0C2_SD0TXSTRIDE2_POSITION          0x0000001E
#define _CVDSD0C2_SD0TXSTRIDE2_MASK              0xC0000000
#define _CVDSD0C2_SD0TXSTRIDE2_LENGTH            0x00000002

#define _CVDSD0C3_SD0CHGTIME_POSITION            0x00000000
#define _CVDSD0C3_SD0CHGTIME_MASK                0x0000007F
#define _CVDSD0C3_SD0CHGTIME_LENGTH              0x00000007

#define _CVDSD0C3_SD0ACQTIME_POSITION            0x00000008
#define _CVDSD0C3_SD0ACQTIME_MASK                0x00007F00
#define _CVDSD0C3_SD0ACQTIME_LENGTH              0x00000007

#define _CVDSD0C3_CVDCPL_POSITION                0x00000010
#define _CVDSD0C3_CVDCPL_MASK                    0x00070000
#define _CVDSD0C3_CVDCPL_LENGTH                  0x00000003

#define _CVDSD0C3_CVDEN_POSITION                 0x00000013
#define _CVDSD0C3_CVDEN_MASK                     0x00080000
#define _CVDSD0C3_CVDEN_LENGTH                   0x00000001

#define _CVDSD0C3_SD0MUT_POSITION                0x00000018
#define _CVDSD0C3_SD0MUT_MASK                    0x01000000
#define _CVDSD0C3_SD0MUT_LENGTH                  0x00000001

#define _CVDSD0C3_SD0SELF_POSITION               0x00000019
#define _CVDSD0C3_SD0SELF_MASK                   0x02000000
#define _CVDSD0C3_SD0SELF_LENGTH                 0x00000001

#define _CVDSD0C3_SD0IEN_POSITION                0x0000001A
#define _CVDSD0C3_SD0IEN_MASK                    0x04000000
#define _CVDSD0C3_SD0IEN_LENGTH                  0x00000001

#define _CVDSD0C3_SD0BUF_POSITION                0x0000001B
#define _CVDSD0C3_SD0BUF_MASK                    0x08000000
#define _CVDSD0C3_SD0BUF_LENGTH                  0x00000001

#define _CVDSD0C3_SD0EN_POSITION                 0x0000001E
#define _CVDSD0C3_SD0EN_MASK                     0xC0000000
#define _CVDSD0C3_SD0EN_LENGTH                   0x00000002

#define _CVDSD0T2_SD0CONTIME_POSITION            0x00000000
#define _CVDSD0T2_SD0CONTIME_MASK                0x0000007F
#define _CVDSD0T2_SD0CONTIME_LENGTH              0x00000007

#define _CVDSD0T2_SD0POLTIME_POSITION            0x00000008
#define _CVDSD0T2_SD0POLTIME_MASK                0x00007F00
#define _CVDSD0T2_SD0POLTIME_LENGTH              0x00000007

#define _CVDSD0T2_SD0OVRTIME_POSITION            0x00000010
#define _CVDSD0T2_SD0OVRTIME_MASK                0x007F0000
#define _CVDSD0T2_SD0OVRTIME_LENGTH              0x00000007

#define _CVDSD0T2_SD0CHNTIME_POSITION            0x00000018
#define _CVDSD0T2_SD0CHNTIME_MASK                0x7F000000
#define _CVDSD0T2_SD0CHNTIME_LENGTH              0x00000007

#define _CVDSD1C1_SD1OVRSAMP_POSITION            0x00000000
#define _CVDSD1C1_SD1OVRSAMP_MASK                0x000000FF
#define _CVDSD1C1_SD1OVRSAMP_LENGTH              0x00000008

#define _CVDSD1C1_SD1THRESH_POSITION             0x00000008
#define _CVDSD1C1_SD1THRESH_MASK                 0xFFFFFF00
#define _CVDSD1C1_SD1THRESH_LENGTH               0x00000018

