Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _DSGPR6_DSGPR_POSITION                   0x00000000
#define _DSGPR6_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR6_DSGPR_LENGTH                     0x00000020

#define _DSGPR7_DSGPR_POSITION                   0x00000000
#define _DSGPR7_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR7_DSGPR_LENGTH                     0x00000020

#define _DSGPR8_DSGPR_POSITION                   0x00000000
#define _DSGPR8_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR8_DSGPR_LENGTH                     0x00000020

#define _DSGPR9_DSGPR_POSITION                   0x00000000
#define _DSGPR9_DSGPR_MASK                       0xFFFFFFFF
#define _DSGPR9_DSGPR_LENGTH                     0x00000020

#define _DSGPR10_DSGPR_POSITION                  0x00000000
#define _DSGPR10_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR10_DSGPR_LENGTH                    0x00000020

#define _DSGPR11_DSGPR_POSITION                  0x00000000
#define _DSGPR11_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR11_DSGPR_LENGTH                    0x00000020

#define _DSGPR12_DSGPR_POSITION                  0x00000000
#define _DSGPR12_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR12_DSGPR_LENGTH                    0x00000020

#define _DSGPR13_DSGPR_POSITION                  0x00000000
#define _DSGPR13_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR13_DSGPR_LENGTH                    0x00000020

#define _DSGPR14_DSGPR_POSITION                  0x00000000
#define _DSGPR14_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR14_DSGPR_LENGTH                    0x00000020

#define _DSGPR15_DSGPR_POSITION                  0x00000000
#define _DSGPR15_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR15_DSGPR_LENGTH                    0x00000020

#define _DSGPR16_DSGPR_POSITION                  0x00000000
#define _DSGPR16_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR16_DSGPR_LENGTH                    0x00000020

#define _DSGPR17_DSGPR_POSITION                  0x00000000
#define _DSGPR17_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR17_DSGPR_LENGTH                    0x00000020

#define _DSGPR18_DSGPR_POSITION                  0x00000000
#define _DSGPR18_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR18_DSGPR_LENGTH                    0x00000020

#define _DSGPR19_DSGPR_POSITION                  0x00000000
#define _DSGPR19_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR19_DSGPR_LENGTH                    0x00000020

#define _DSGPR20_DSGPR_POSITION                  0x00000000
#define _DSGPR20_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR20_DSGPR_LENGTH                    0x00000020

#define _DSGPR21_DSGPR_POSITION                  0x00000000
#define _DSGPR21_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR21_DSGPR_LENGTH                    0x00000020

#define _DSGPR22_DSGPR_POSITION                  0x00000000
#define _DSGPR22_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR22_DSGPR_LENGTH                    0x00000020

#define _DSGPR23_DSGPR_POSITION                  0x00000000
#define _DSGPR23_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR23_DSGPR_LENGTH                    0x00000020

#define _DSGPR24_DSGPR_POSITION                  0x00000000
#define _DSGPR24_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR24_DSGPR_LENGTH                    0x00000020

#define _DSGPR25_DSGPR_POSITION                  0x00000000
#define _DSGPR25_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR25_DSGPR_LENGTH                    0x00000020

#define _DSGPR26_DSGPR_POSITION                  0x00000000
#define _DSGPR26_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR26_DSGPR_LENGTH                    0x00000020

#define _DSGPR27_DSGPR_POSITION                  0x00000000
#define _DSGPR27_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR27_DSGPR_LENGTH                    0x00000020

#define _DSGPR28_DSGPR_POSITION                  0x00000000
#define _DSGPR28_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR28_DSGPR_LENGTH                    0x00000020

#define _DSGPR29_DSGPR_POSITION                  0x00000000
#define _DSGPR29_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR29_DSGPR_LENGTH                    0x00000020

#define _DSGPR30_DSGPR_POSITION                  0x00000000
#define _DSGPR30_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR30_DSGPR_LENGTH                    0x00000020

#define _DSGPR31_DSGPR_POSITION                  0x00000000
#define _DSGPR31_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR31_DSGPR_LENGTH                    0x00000020

#define _DSGPR32_DSGPR_POSITION                  0x00000000
#define _DSGPR32_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR32_DSGPR_LENGTH                    0x00000020

#define _SQI1XCON1_TYPECMD_POSITION              0x00000000
#define _SQI1XCON1_TYPECMD_MASK                  0x00000003
#define _SQI1XCON1_TYPECMD_LENGTH                0x00000002

#define _SQI1XCON1_TYPEADDR_POSITION             0x00000002
#define _SQI1XCON1_TYPEADDR_MASK                 0x0000000C
#define _SQI1XCON1_TYPEADDR_LENGTH               0x00000002

#define _SQI1XCON1_TYPEMODE_POSITION             0x00000004
#define _SQI1XCON1_TYPEMODE_MASK                 0x00000030
#define _SQI1XCON1_TYPEMODE_LENGTH               0x00000002

#define _SQI1XCON1_TYPEDUMMY_POSITION            0x00000006
#define _SQI1XCON1_TYPEDUMMY_MASK                0x000000C0
#define _SQI1XCON1_TYPEDUMMY_LENGTH              0x00000002

#define _SQI1XCON1_TYPEDATA_POSITION             0x00000008
#define _SQI1XCON1_TYPEDATA_MASK                 0x00000300
#define _SQI1XCON1_TYPEDATA_LENGTH               0x00000002

#define _SQI1XCON1_READOPCODE_POSITION           0x0000000A
#define _SQI1XCON1_READOPCODE_MASK               0x0003FC00
#define _SQI1XCON1_READOPCODE_LENGTH             0x00000008

#define _SQI1XCON1_ADDRBYTES_POSITION            0x00000012
#define _SQI1XCON1_ADDRBYTES_MASK                0x001C0000
#define _SQI1XCON1_ADDRBYTES_LENGTH              0x00000003

#define _SQI1XCON1_DUMMYBYTES_POSITION           0x00000015
#define _SQI1XCON1_DUMMYBYTES_MASK               0x00E00000
#define _SQI1XCON1_DUMMYBYTES_LENGTH             0x00000003

