Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _SQI1INTTHR_TXINTTHR_POSITION            0x00000008
#define _SQI1INTTHR_TXINTTHR_MASK                0x00003F00
#define _SQI1INTTHR_TXINTTHR_LENGTH              0x00000006

#define _SQI1INTEN_TXEMPTYIE_POSITION            0x00000000
#define _SQI1INTEN_TXEMPTYIE_MASK                0x00000001
#define _SQI1INTEN_TXEMPTYIE_LENGTH              0x00000001

#define _SQI1INTEN_TXFULLIE_POSITION             0x00000001
#define _SQI1INTEN_TXFULLIE_MASK                 0x00000002
#define _SQI1INTEN_TXFULLIE_LENGTH               0x00000001

#define _SQI1INTEN_TXTHRIE_POSITION              0x00000002
#define _SQI1INTEN_TXTHRIE_MASK                  0x00000004
#define _SQI1INTEN_TXTHRIE_LENGTH                0x00000001

#define _SQI1INTEN_RXEMPTYIE_POSITION            0x00000003
#define _SQI1INTEN_RXEMPTYIE_MASK                0x00000008
#define _SQI1INTEN_RXEMPTYIE_LENGTH              0x00000001

#define _SQI1INTEN_RXFULLIE_POSITION             0x00000004
#define _SQI1INTEN_RXFULLIE_MASK                 0x00000010
#define _SQI1INTEN_RXFULLIE_LENGTH               0x00000001

#define _SQI1INTEN_RXTHRIE_POSITION              0x00000005
#define _SQI1INTEN_RXTHRIE_MASK                  0x00000020
#define _SQI1INTEN_RXTHRIE_LENGTH                0x00000001

#define _SQI1INTEN_CONFULLIE_POSITION            0x00000006
#define _SQI1INTEN_CONFULLIE_MASK                0x00000040
#define _SQI1INTEN_CONFULLIE_LENGTH              0x00000001

#define _SQI1INTEN_CONEMPTYIE_POSITION           0x00000007
#define _SQI1INTEN_CONEMPTYIE_MASK               0x00000080
#define _SQI1INTEN_CONEMPTYIE_LENGTH             0x00000001

#define _SQI1INTEN_CONTHRIE_POSITION             0x00000008
#define _SQI1INTEN_CONTHRIE_MASK                 0x00000100
#define _SQI1INTEN_CONTHRIE_LENGTH               0x00000001

#define _SQI1INTEN_BDDONEIE_POSITION             0x00000009
#define _SQI1INTEN_BDDONEIE_MASK                 0x00000200
#define _SQI1INTEN_BDDONEIE_LENGTH               0x00000001

#define _SQI1INTEN_PKTCOMPIE_POSITION            0x0000000A
#define _SQI1INTEN_PKTCOMPIE_MASK                0x00000400
#define _SQI1INTEN_PKTCOMPIE_LENGTH              0x00000001

#define _SQI1INTEN_DMAEIE_POSITION               0x0000000B
#define _SQI1INTEN_DMAEIE_MASK                   0x00000800
#define _SQI1INTEN_DMAEIE_LENGTH                 0x00000001

#define _SQI1INTSTAT_TXEMPTYIF_POSITION          0x00000000
#define _SQI1INTSTAT_TXEMPTYIF_MASK              0x00000001
#define _SQI1INTSTAT_TXEMPTYIF_LENGTH            0x00000001

#define _SQI1INTSTAT_TXFULLIF_POSITION           0x00000001
#define _SQI1INTSTAT_TXFULLIF_MASK               0x00000002
#define _SQI1INTSTAT_TXFULLIF_LENGTH             0x00000001

#define _SQI1INTSTAT_TXTHRIF_POSITION            0x00000002
#define _SQI1INTSTAT_TXTHRIF_MASK                0x00000004
#define _SQI1INTSTAT_TXTHRIF_LENGTH              0x00000001

#define _SQI1INTSTAT_RXEMPTYIF_POSITION          0x00000003
#define _SQI1INTSTAT_RXEMPTYIF_MASK              0x00000008
#define _SQI1INTSTAT_RXEMPTYIF_LENGTH            0x00000001

#define _SQI1INTSTAT_RXFULLIF_POSITION           0x00000004
#define _SQI1INTSTAT_RXFULLIF_MASK               0x00000010
#define _SQI1INTSTAT_RXFULLIF_LENGTH             0x00000001

#define _SQI1INTSTAT_RXTHRIF_POSITION            0x00000005
#define _SQI1INTSTAT_RXTHRIF_MASK                0x00000020
#define _SQI1INTSTAT_RXTHRIF_LENGTH              0x00000001

#define _SQI1INTSTAT_CONFULLIF_POSITION          0x00000006
#define _SQI1INTSTAT_CONFULLIF_MASK              0x00000040
#define _SQI1INTSTAT_CONFULLIF_LENGTH            0x00000001

#define _SQI1INTSTAT_CONEMPTYIF_POSITION         0x00000007
#define _SQI1INTSTAT_CONEMPTYIF_MASK             0x00000080
#define _SQI1INTSTAT_CONEMPTYIF_LENGTH           0x00000001

#define _SQI1INTSTAT_CONTHRIF_POSITION           0x00000008
#define _SQI1INTSTAT_CONTHRIF_MASK               0x00000100
#define _SQI1INTSTAT_CONTHRIF_LENGTH             0x00000001

#define _SQI1INTSTAT_BDDONEIF_POSITION           0x00000009
#define _SQI1INTSTAT_BDDONEIF_MASK               0x00000200
#define _SQI1INTSTAT_BDDONEIF_LENGTH             0x00000001

#define _SQI1INTSTAT_PKTCOMPIF_POSITION          0x0000000A
#define _SQI1INTSTAT_PKTCOMPIF_MASK              0x00000400
#define _SQI1INTSTAT_PKTCOMPIF_LENGTH            0x00000001

#define _SQI1INTSTAT_DMAEIF_POSITION             0x0000000B
#define _SQI1INTSTAT_DMAEIF_MASK                 0x00000800
#define _SQI1INTSTAT_DMAEIF_LENGTH               0x00000001

#define _SQI1TXDATA_TXDATA_POSITION              0x00000000
#define _SQI1TXDATA_TXDATA_MASK                  0xFFFFFFFF
#define _SQI1TXDATA_TXDATA_LENGTH                0x00000020

#define _SQI1RXDATA_RXDATA_POSITION              0x00000000
#define _SQI1RXDATA_RXDATA_MASK                  0xFFFFFFFF
#define _SQI1RXDATA_RXDATA_LENGTH                0x00000020

#define _SQI1STAT1_RXBUFCNT_POSITION             0x00000000
#define _SQI1STAT1_RXBUFCNT_MASK                 0x0000003F
#define _SQI1STAT1_RXBUFCNT_LENGTH               0x00000006

#define _SQI1STAT1_TXBUFFREE_POSITION            0x00000010
#define _SQI1STAT1_TXBUFFREE_MASK                0x003F0000
#define _SQI1STAT1_TXBUFFREE_LENGTH              0x00000006

#define _SQI1STAT2_TXOV_POSITION                 0x00000000
#define _SQI1STAT2_TXOV_MASK                     0x00000001
#define _SQI1STAT2_TXOV_LENGTH                   0x00000001

#define _SQI1STAT2_RXUN_POSITION                 0x00000001
#define _SQI1STAT2_RXUN_MASK                     0x00000002
#define _SQI1STAT2_RXUN_LENGTH                   0x00000001

#define _SQI1STAT2_SQID0_POSITION                0x00000003
#define _SQI1STAT2_SQID0_MASK                    0x00000008
#define _SQI1STAT2_SQID0_LENGTH                  0x00000001

#define _SQI1STAT2_SQID1_POSITION                0x00000004
#define _SQI1STAT2_SQID1_MASK                    0x00000010
#define _SQI1STAT2_SQID1_LENGTH                  0x00000001

#define _SQI1STAT2_SQID2_POSITION                0x00000005
#define _SQI1STAT2_SQID2_MASK                    0x00000020
#define _SQI1STAT2_SQID2_LENGTH                  0x00000001

#define _SQI1STAT2_SQID3_POSITION                0x00000006
#define _SQI1STAT2_SQID3_MASK                    0x00000040
#define _SQI1STAT2_SQID3_LENGTH                  0x00000001

#define _SQI1STAT2_CONAVAIL_POSITION             0x00000007
#define _SQI1STAT2_CONAVAIL_MASK                 0x00000780
#define _SQI1STAT2_CONAVAIL_LENGTH               0x00000004

#define _SQI1STAT2_CMDSTAT_POSITION              0x00000010
#define _SQI1STAT2_CMDSTAT_MASK                  0x00030000
#define _SQI1STAT2_CMDSTAT_LENGTH                0x00000002

#define _SQI1BDCON_DMAEN_POSITION                0x00000000
#define _SQI1BDCON_DMAEN_MASK                    0x00000001
#define _SQI1BDCON_DMAEN_LENGTH                  0x00000001

#define _SQI1BDCON_POLLEN_POSITION               0x00000001
#define _SQI1BDCON_POLLEN_MASK                   0x00000002
#define _SQI1BDCON_POLLEN_LENGTH                 0x00000001

