Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _CEINTEN_PENDIE_POSITION                 0x00000000
#define _CEINTEN_PENDIE_MASK                     0x00000001
#define _CEINTEN_PENDIE_LENGTH                   0x00000001

#define _CEINTEN_CBDIE_POSITION                  0x00000001
#define _CEINTEN_CBDIE_MASK                      0x00000002
#define _CEINTEN_CBDIE_LENGTH                    0x00000001

#define _CEINTEN_PKTIE_POSITION                  0x00000002
#define _CEINTEN_PKTIE_MASK                      0x00000004
#define _CEINTEN_PKTIE_LENGTH                    0x00000001

#define _CEINTEN_AREIE_POSITION                  0x00000003
#define _CEINTEN_AREIE_MASK                      0x00000008
#define _CEINTEN_AREIE_LENGTH                    0x00000001

#define _CEPOLLCON_BDPPLCON_POSITION             0x00000000
#define _CEPOLLCON_BDPPLCON_MASK                 0x0000FFFF
#define _CEPOLLCON_BDPPLCON_LENGTH               0x00000010

#define _CEHDLEN_HDRLEN_POSITION                 0x00000000
#define _CEHDLEN_HDRLEN_MASK                     0x000000FF
#define _CEHDLEN_HDRLEN_LENGTH                   0x00000008

#define _CETRLLEN_TRLRLEN_POSITION               0x00000000
#define _CETRLLEN_TRLRLEN_MASK                   0x000000FF
#define _CETRLLEN_TRLRLEN_LENGTH                 0x00000008

#define _CEDTXSTAT_DTXSTATE_POSITION             0x00000000
#define _CEDTXSTAT_DTXSTATE_MASK                 0x0000000F
#define _CEDTXSTAT_DTXSTATE_LENGTH               0x00000004

#define _CEDTXSTAT_DTXBLEN_POSITION              0x00000004
#define _CEDTXSTAT_DTXBLEN_MASK                  0x000FFFF0
#define _CEDTXSTAT_DTXBLEN_LENGTH                0x00000010

#define _CEDRXSTAT_DRXSTATE_POSITION             0x00000000
#define _CEDRXSTAT_DRXSTATE_MASK                 0x0000000F
#define _CEDRXSTAT_DRXSTATE_LENGTH               0x00000004

#define _CEDRXSTAT_DRXBLEN_POSITION              0x00000004
#define _CEDRXSTAT_DRXBLEN_MASK                  0x000FFFF0
#define _CEDRXSTAT_DRXBLEN_LENGTH                0x00000010

#define _CEDCRYPTOADDR_CRYPTOADDR_POSITION       0x00000000
#define _CEDCRYPTOADDR_CRYPTOADDR_MASK           0x0000000F
#define _CEDCRYPTOADDR_CRYPTOADDR_LENGTH         0x00000004

#define _CEDHASHADDR_HASHADDR_POSITION           0x00000000
#define _CEDHASHADDR_HASHADDR_MASK               0x0000000F
#define _CEDHASHADDR_HASHADDR_LENGTH             0x00000004

#define _CEDTXADDR_TXDADDR_POSITION              0x00000000
#define _CEDTXADDR_TXDADDR_MASK                  0x00000003
#define _CEDTXADDR_TXDADDR_LENGTH                0x00000002

#define _CEDML0ADDR_ML0ADDR_POSITION             0x00000000
#define _CEDML0ADDR_ML0ADDR_MASK                 0xFFFFFFFF
#define _CEDML0ADDR_ML0ADDR_LENGTH               0x00000020

#define _CEDML1ADDR_ML1ADDR_POSITION             0x00000000
#define _CEDML1ADDR_ML1ADDR_MASK                 0xFFFFFFFF
#define _CEDML1ADDR_ML1ADDR_LENGTH               0x00000020

#define _CEDOL0ADDR_OL0ADDR_POSITION             0x00000000
#define _CEDOL0ADDR_OL0ADDR_MASK                 0xFFFFFFFF
#define _CEDOL0ADDR_OL0ADDR_LENGTH               0x00000020

#define _CEDCSTADDDR_CSTATEADDR_POSITION         0x00000000
#define _CEDCSTADDDR_CSTATEADDR_MASK             0x0000000F
#define _CEDCSTADDDR_CSTATEADDR_LENGTH           0x00000004

#define _CEDMTSKADDR_MTASKADDR_POSITION          0x00000000
#define _CEDMTSKADDR_MTASKADDR_MASK              0x00000003
#define _CEDMTSKADDR_MTASKADDR_LENGTH            0x00000002

#define _CEDSACON_SACON_POSITION                 0x00000000
#define _CEDSACON_SACON_MASK                     0xFFFFFFFF
#define _CEDSACON_SACON_LENGTH                   0x00000020

#define _CEDCSTATE_CSTATE_POSITION               0x00000000
#define _CEDCSTATE_CSTATE_MASK                   0x0000000F
#define _CEDCSTATE_CSTATE_LENGTH                 0x00000004

#define _CEDTXBCNT_CTXBCNT_POSITION              0x00000000
#define _CEDTXBCNT_CTXBCNT_MASK                  0x0000001F
#define _CEDTXBCNT_CTXBCNT_LENGTH                0x00000005

#define _CEDRXBCNT_DRXBCNT_POSITION              0x00000000
#define _CEDRXBCNT_DRXBCNT_MASK                  0x0000007F
#define _CEDRXBCNT_DRXBCNT_LENGTH                0x00000007

#define _CEREV_MAJOR_POSITION                    0x00000000
#define _CEREV_MAJOR_MASK                        0x000000FF
#define _CEREV_MAJOR_LENGTH                      0x00000008

#define _CEREV_MINOR_POSITION                    0x00000008
#define _CEREV_MINOR_MASK                        0x0000FF00
#define _CEREV_MINOR_LENGTH                      0x00000008

#define _CEREV_MAINTENANCE_POSITION              0x00000010
#define _CEREV_MAINTENANCE_MASK                  0x00FF0000
#define _CEREV_MAINTENANCE_LENGTH                0x00000008

#define _RNGVER_REVISION_POSITION                0x00000000
#define _RNGVER_REVISION_MASK                    0x0000007F
#define _RNGVER_REVISION_LENGTH                  0x00000007

#define _RNGVER_VERSION_POSITION                 0x00000007
#define _RNGVER_VERSION_MASK                     0x0000FF80
#define _RNGVER_VERSION_LENGTH                   0x00000009

#define _RNGVER_ID_POSITION                      0x00000010
#define _RNGVER_ID_MASK                          0xFFFF0000
#define _RNGVER_ID_LENGTH                        0x00000010

#define _RNGCON_PLEN_POSITION                    0x00000000
#define _RNGCON_PLEN_MASK                        0x000000FF
#define _RNGCON_PLEN_LENGTH                      0x00000008

#define _RNGCON_TRNGEN_POSITION                  0x00000008
#define _RNGCON_TRNGEN_MASK                      0x00000100
#define _RNGCON_TRNGEN_LENGTH                    0x00000001

#define _RNGCON_PRNGEN_POSITION                  0x00000009
#define _RNGCON_PRNGEN_MASK                      0x00000200
#define _RNGCON_PRNGEN_LENGTH                    0x00000001

#define _RNGCON_CONT_POSITION                    0x0000000A
#define _RNGCON_CONT_MASK                        0x00000400
#define _RNGCON_CONT_LENGTH                      0x00000001

#define _RNGCON_TRNGMODE_POSITION                0x0000000B
#define _RNGCON_TRNGMODE_MASK                    0x00000800
#define _RNGCON_TRNGMODE_LENGTH                  0x00000001

#define _RNGCON_LOAD_POSITION                    0x0000000C
#define _RNGCON_LOAD_MASK                        0x00001000
#define _RNGCON_LOAD_LENGTH                      0x00000001

#define _RNGPOLY1_POLY_POSITION                  0x00000000
#define _RNGPOLY1_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY1_POLY_LENGTH                    0x00000020

#define _RNGPOLY2_POLY_POSITION                  0x00000000
#define _RNGPOLY2_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY2_POLY_LENGTH                    0x00000020

