Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _DEVCFG0_USBSSEN_POSITION                0x00000008
#define _DEVCFG0_USBSSEN_MASK                    0x00000100
#define _DEVCFG0_USBSSEN_LENGTH                  0x00000001

#define _DEVCFG0_PMULOCK_POSITION                0x0000000A
#define _DEVCFG0_PMULOCK_MASK                    0x00000400
#define _DEVCFG0_PMULOCK_LENGTH                  0x00000001

#define _DEVCFG0_PGLOCK_POSITION                 0x0000000B
#define _DEVCFG0_PGLOCK_MASK                     0x00000800
#define _DEVCFG0_PGLOCK_LENGTH                   0x00000001

#define _DEVCFG0_PMDLOCK_POSITION                0x0000000C
#define _DEVCFG0_PMDLOCK_MASK                    0x00001000
#define _DEVCFG0_PMDLOCK_LENGTH                  0x00000001

#define _DEVCFG0_IOLOCK_POSITION                 0x0000000D
#define _DEVCFG0_IOLOCK_MASK                     0x00002000
#define _DEVCFG0_IOLOCK_LENGTH                   0x00000001

#define _DEVCFG0_CFGLOCK_POSITION                0x0000000E
#define _DEVCFG0_CFGLOCK_MASK                    0x0000C000
#define _DEVCFG0_CFGLOCK_LENGTH                  0x00000002

#define _DEVCFG0_OC_ACLK_POSITION                0x00000010
#define _DEVCFG0_OC_ACLK_MASK                    0x00010000
#define _DEVCFG0_OC_ACLK_LENGTH                  0x00000001

#define _DEVCFG0_IC_ACLK_POSITION                0x00000011
#define _DEVCFG0_IC_ACLK_MASK                    0x00020000
#define _DEVCFG0_IC_ACLK_LENGTH                  0x00000001

#define _DEVCFG0_CANFDDIV_POSITION               0x00000014
#define _DEVCFG0_CANFDDIV_MASK                   0x00300000
#define _DEVCFG0_CANFDDIV_LENGTH                 0x00000002

#define _DEVCFG0_PCM_POSITION                    0x00000017
#define _DEVCFG0_PCM_MASK                        0x00800000
#define _DEVCFG0_PCM_LENGTH                      0x00000001

#define _DEVCFG0_UPLLHWMD_POSITION               0x00000018
#define _DEVCFG0_UPLLHWMD_MASK                   0x01000000
#define _DEVCFG0_UPLLHWMD_LENGTH                 0x00000001

#define _DEVCFG0_SPLLHWMD_POSITION               0x00000019
#define _DEVCFG0_SPLLHWMD_MASK                   0x02000000
#define _DEVCFG0_SPLLHWMD_LENGTH                 0x00000001

#define _DEVCFG0_BTPLLHWMD_POSITION              0x0000001A
#define _DEVCFG0_BTPLLHWMD_MASK                  0x04000000
#define _DEVCFG0_BTPLLHWMD_LENGTH                0x00000001

#define _DEVCFG0_ETHPLLHWMD_POSITION             0x0000001B
#define _DEVCFG0_ETHPLLHWMD_MASK                 0x08000000
#define _DEVCFG0_ETHPLLHWMD_LENGTH               0x00000001

#define _DEVCFG0_FECCCON_POSITION                0x0000001C
#define _DEVCFG0_FECCCON_MASK                    0x30000000
#define _DEVCFG0_FECCCON_LENGTH                  0x00000002

#define _DEVCFG0_ETHTPSF_POSITION                0x0000001E
#define _DEVCFG0_ETHTPSF_MASK                    0x40000000
#define _DEVCFG0_ETHTPSF_LENGTH                  0x00000001

#define _DEVCFG0_EPGMCLK_POSITION                0x0000001F
#define _DEVCFG0_EPGMCLK_MASK                    0x80000000
#define _DEVCFG0_EPGMCLK_LENGTH                  0x00000001

#define _DEVCFG0_w_POSITION                      0x00000000
#define _DEVCFG0_w_MASK                          0xFFFFFFFF
#define _DEVCFG0_w_LENGTH                        0x00000020

#define _FBCFG0_BUHSWEN_POSITION                 0x00000000
#define _FBCFG0_BUHSWEN_MASK                     0x00000001
#define _FBCFG0_BUHSWEN_LENGTH                   0x00000001

#define _FBCFG0_PCSCMODE_POSITION                0x00000001
#define _FBCFG0_PCSCMODE_MASK                    0x00000002
#define _FBCFG0_PCSCMODE_LENGTH                  0x00000001

#define _FBCFG0_BOOTISA_POSITION                 0x00000003
#define _FBCFG0_BOOTISA_MASK                     0x00000008
#define _FBCFG0_BOOTISA_LENGTH                   0x00000001

#define _FBCFG0_w_POSITION                       0x00000000
#define _FBCFG0_w_MASK                           0xFFFFFFFF
#define _FBCFG0_w_LENGTH                         0x00000020

#define _FCPN0_CP_POSITION                       0x0000001C
#define _FCPN0_CP_MASK                           0x10000000
#define _FCPN0_CP_LENGTH                         0x00000001

#define _FCPN0_w_POSITION                        0x00000000
#define _FCPN0_w_MASK                            0xFFFFFFFF
#define _FCPN0_w_LENGTH                          0x00000020

#define _FSIGN0_SIGN_POSITION                    0x0000001F
#define _FSIGN0_SIGN_MASK                        0x80000000
#define _FSIGN0_SIGN_LENGTH                      0x00000001

#define _FSIGN0_w_POSITION                       0x00000000
#define _FSIGN0_w_MASK                           0xFFFFFFFF
#define _FSIGN0_w_LENGTH                         0x00000020

#define _AFUSERID_USERID_POSITION                0x00000000
#define _AFUSERID_USERID_MASK                    0x0000FFFF
#define _AFUSERID_USERID_LENGTH                  0x00000010

#define _AFUSERID_w_POSITION                     0x00000000
#define _AFUSERID_w_MASK                         0xFFFFFFFF
#define _AFUSERID_w_LENGTH                       0x00000020

#define _ADEVCFG4_SOSCCFG_POSITION               0x00000000
#define _ADEVCFG4_SOSCCFG_MASK                   0x000000FF
#define _ADEVCFG4_SOSCCFG_LENGTH                 0x00000008

#define _ADEVCFG4_VBZPBOREN_POSITION             0x00000013
#define _ADEVCFG4_VBZPBOREN_MASK                 0x00080000
#define _ADEVCFG4_VBZPBOREN_LENGTH               0x00000001

#define _ADEVCFG4_DSZPBOREN_POSITION             0x00000014
#define _ADEVCFG4_DSZPBOREN_MASK                 0x00100000
#define _ADEVCFG4_DSZPBOREN_LENGTH               0x00000001

#define _ADEVCFG4_DSWDTPS_POSITION               0x00000015
#define _ADEVCFG4_DSWDTPS_MASK                   0x03E00000
#define _ADEVCFG4_DSWDTPS_LENGTH                 0x00000005

#define _ADEVCFG4_DSWDTOSC_POSITION              0x0000001A
#define _ADEVCFG4_DSWDTOSC_MASK                  0x04000000
#define _ADEVCFG4_DSWDTOSC_LENGTH                0x00000001

#define _ADEVCFG4_DSWDTEN_POSITION               0x0000001B
#define _ADEVCFG4_DSWDTEN_MASK                   0x08000000
#define _ADEVCFG4_DSWDTEN_LENGTH                 0x00000001

#define _ADEVCFG4_DSEN_POSITION                  0x0000001C
#define _ADEVCFG4_DSEN_MASK                      0x10000000
#define _ADEVCFG4_DSEN_LENGTH                    0x00000001

