Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _ADEVCFG4_SOSCEN_POSITION                0x0000001E
#define _ADEVCFG4_SOSCEN_MASK                    0x40000000
#define _ADEVCFG4_SOSCEN_LENGTH                  0x00000001

#define _ADEVCFG4_w_POSITION                     0x00000000
#define _ADEVCFG4_w_MASK                         0xFFFFFFFF
#define _ADEVCFG4_w_LENGTH                       0x00000020

#define _ADEVCFG2_DMTINTV_POSITION               0x00000003
#define _ADEVCFG2_DMTINTV_MASK                   0x00000038
#define _ADEVCFG2_DMTINTV_LENGTH                 0x00000003

#define _ADEVCFG2_POSCMOD_POSITION               0x00000008
#define _ADEVCFG2_POSCMOD_MASK                   0x00000300
#define _ADEVCFG2_POSCMOD_LENGTH                 0x00000002

#define _ADEVCFG2_WDTRMCS_POSITION               0x0000000A
#define _ADEVCFG2_WDTRMCS_MASK                   0x00000C00
#define _ADEVCFG2_WDTRMCS_LENGTH                 0x00000002

#define _ADEVCFG2_SOSCSEL_POSITION               0x0000000C
#define _ADEVCFG2_SOSCSEL_MASK                   0x00001000
#define _ADEVCFG2_SOSCSEL_LENGTH                 0x00000001

#define _ADEVCFG2_WAKE2SPD_POSITION              0x0000000D
#define _ADEVCFG2_WAKE2SPD_MASK                  0x00002000
#define _ADEVCFG2_WAKE2SPD_LENGTH                0x00000001

#define _ADEVCFG2_CKSWEN_POSITION                0x0000000E
#define _ADEVCFG2_CKSWEN_MASK                    0x00004000
#define _ADEVCFG2_CKSWEN_LENGTH                  0x00000001

#define _ADEVCFG2_FSCMEN_POSITION                0x0000000F
#define _ADEVCFG2_FSCMEN_MASK                    0x00008000
#define _ADEVCFG2_FSCMEN_LENGTH                  0x00000001

#define _ADEVCFG2_WDTPS_POSITION                 0x00000010
#define _ADEVCFG2_WDTPS_MASK                     0x001F0000
#define _ADEVCFG2_WDTPS_LENGTH                   0x00000005

#define _ADEVCFG2_WDTSPGM_POSITION               0x00000015
#define _ADEVCFG2_WDTSPGM_MASK                   0x00200000
#define _ADEVCFG2_WDTSPGM_LENGTH                 0x00000001

#define _ADEVCFG2_WINDIS_POSITION                0x00000016
#define _ADEVCFG2_WINDIS_MASK                    0x00400000
#define _ADEVCFG2_WINDIS_LENGTH                  0x00000001

#define _ADEVCFG2_WDTEN_POSITION                 0x00000017
#define _ADEVCFG2_WDTEN_MASK                     0x00800000
#define _ADEVCFG2_WDTEN_LENGTH                   0x00000001

#define _ADEVCFG2_WDTWINSZ_POSITION              0x00000018
#define _ADEVCFG2_WDTWINSZ_MASK                  0x03000000
#define _ADEVCFG2_WDTWINSZ_LENGTH                0x00000002

#define _ADEVCFG2_DMTCNT_POSITION                0x0000001A
#define _ADEVCFG2_DMTCNT_MASK                    0x7C000000
#define _ADEVCFG2_DMTCNT_LENGTH                  0x00000005

#define _ADEVCFG2_DMTEN_POSITION                 0x0000001F
#define _ADEVCFG2_DMTEN_MASK                     0x80000000
#define _ADEVCFG2_DMTEN_LENGTH                   0x00000001

#define _ADEVCFG2_w_POSITION                     0x00000000
#define _ADEVCFG2_w_MASK                         0xFFFFFFFF
#define _ADEVCFG2_w_LENGTH                       0x00000020

#define _ADEVCFG1_DEBUG_POSITION                 0x00000000
#define _ADEVCFG1_DEBUG_MASK                     0x00000003
#define _ADEVCFG1_DEBUG_LENGTH                   0x00000002

#define _ADEVCFG1_ICESEL_POSITION                0x00000003
#define _ADEVCFG1_ICESEL_MASK                    0x00000018
#define _ADEVCFG1_ICESEL_LENGTH                  0x00000002

#define _ADEVCFG1_TRCEN_POSITION                 0x00000005
#define _ADEVCFG1_TRCEN_MASK                     0x00000020
#define _ADEVCFG1_TRCEN_LENGTH                   0x00000001

#define _ADEVCFG1_FMIIEN_POSITION                0x00000008
#define _ADEVCFG1_FMIIEN_MASK                    0x00000100
#define _ADEVCFG1_FMIIEN_LENGTH                  0x00000001

#define _ADEVCFG1_ETHEXEREF_POSITION             0x00000009
#define _ADEVCFG1_ETHEXEREF_MASK                 0x00000200
#define _ADEVCFG1_ETHEXEREF_LENGTH               0x00000001

#define _ADEVCFG1_CLASSBDIS_POSITION             0x0000000A
#define _ADEVCFG1_CLASSBDIS_MASK                 0x00000400
#define _ADEVCFG1_CLASSBDIS_LENGTH               0x00000001

#define _ADEVCFG1_USBIDIO_POSITION               0x0000000B
#define _ADEVCFG1_USBIDIO_MASK                   0x00000800
#define _ADEVCFG1_USBIDIO_LENGTH                 0x00000001

#define _ADEVCFG1_VBUSIO_POSITION                0x0000000C
#define _ADEVCFG1_VBUSIO_MASK                    0x00001000
#define _ADEVCFG1_VBUSIO_LENGTH                  0x00000001

#define _ADEVCFG1_HSSPIEN_POSITION               0x0000000D
#define _ADEVCFG1_HSSPIEN_MASK                   0x00002000
#define _ADEVCFG1_HSSPIEN_LENGTH                 0x00000001

#define _ADEVCFG1_SMCLR_POSITION                 0x0000000E
#define _ADEVCFG1_SMCLR_MASK                     0x00004000
#define _ADEVCFG1_SMCLR_LENGTH                   0x00000001

#define _ADEVCFG1_HSUARTEN_POSITION              0x0000000F
#define _ADEVCFG1_HSUARTEN_MASK                  0x00008000
#define _ADEVCFG1_HSUARTEN_LENGTH                0x00000001

#define _ADEVCFG1_USBDMTRIM_POSITION             0x00000010
#define _ADEVCFG1_USBDMTRIM_MASK                 0x000F0000
#define _ADEVCFG1_USBDMTRIM_LENGTH               0x00000004

#define _ADEVCFG1_USBDPTRIM_POSITION             0x00000014
#define _ADEVCFG1_USBDPTRIM_MASK                 0x00F00000
#define _ADEVCFG1_USBDPTRIM_LENGTH               0x00000004

#define _ADEVCFG1_WDTPSS_POSITION                0x00000018
#define _ADEVCFG1_WDTPSS_MASK                    0x1F000000
#define _ADEVCFG1_WDTPSS_LENGTH                  0x00000005

#define _ADEVCFG1_FDEBUG_POSITION                0x00000000
#define _ADEVCFG1_FDEBUG_MASK                    0x00000003
#define _ADEVCFG1_FDEBUG_LENGTH                  0x00000002

#define _ADEVCFG1_w_POSITION                     0x00000000
#define _ADEVCFG1_w_MASK                         0xFFFFFFFF
#define _ADEVCFG1_w_LENGTH                       0x00000020

#define _ADEVCFG0_TDOEN_POSITION                 0x00000000
#define _ADEVCFG0_TDOEN_MASK                     0x00000001
#define _ADEVCFG0_TDOEN_LENGTH                   0x00000001

#define _ADEVCFG0_TROEN_POSITION                 0x00000002
#define _ADEVCFG0_TROEN_MASK                     0x00000004
#define _ADEVCFG0_TROEN_LENGTH                   0x00000001

#define _ADEVCFG0_JTAGEN_POSITION                0x00000003
#define _ADEVCFG0_JTAGEN_MASK                    0x00000008
#define _ADEVCFG0_JTAGEN_LENGTH                  0x00000001

#define _ADEVCFG0_FCPRI_POSITION                 0x00000005
#define _ADEVCFG0_FCPRI_MASK                     0x00000020
#define _ADEVCFG0_FCPRI_LENGTH                   0x00000001

