Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.6.220/include/proc/p32mz1025w104132.h
#define _ADEVCFG0_DMAPRI_POSITION                0x00000006
#define _ADEVCFG0_DMAPRI_MASK                    0x00000040
#define _ADEVCFG0_DMAPRI_LENGTH                  0x00000001

#define _ADEVCFG0_EXLPRI_POSITION                0x00000007
#define _ADEVCFG0_EXLPRI_MASK                    0x00000080
#define _ADEVCFG0_EXLPRI_LENGTH                  0x00000001

#define _ADEVCFG0_USBSSEN_POSITION               0x00000008
#define _ADEVCFG0_USBSSEN_MASK                   0x00000100
#define _ADEVCFG0_USBSSEN_LENGTH                 0x00000001

#define _ADEVCFG0_PMULOCK_POSITION               0x0000000A
#define _ADEVCFG0_PMULOCK_MASK                   0x00000400
#define _ADEVCFG0_PMULOCK_LENGTH                 0x00000001

#define _ADEVCFG0_PGLOCK_POSITION                0x0000000B
#define _ADEVCFG0_PGLOCK_MASK                    0x00000800
#define _ADEVCFG0_PGLOCK_LENGTH                  0x00000001

#define _ADEVCFG0_PMDLOCK_POSITION               0x0000000C
#define _ADEVCFG0_PMDLOCK_MASK                   0x00001000
#define _ADEVCFG0_PMDLOCK_LENGTH                 0x00000001

#define _ADEVCFG0_IOLOCK_POSITION                0x0000000D
#define _ADEVCFG0_IOLOCK_MASK                    0x00002000
#define _ADEVCFG0_IOLOCK_LENGTH                  0x00000001

#define _ADEVCFG0_CFGLOCK_POSITION               0x0000000E
#define _ADEVCFG0_CFGLOCK_MASK                   0x0000C000
#define _ADEVCFG0_CFGLOCK_LENGTH                 0x00000002

#define _ADEVCFG0_OC_ACLK_POSITION               0x00000010
#define _ADEVCFG0_OC_ACLK_MASK                   0x00010000
#define _ADEVCFG0_OC_ACLK_LENGTH                 0x00000001

#define _ADEVCFG0_IC_ACLK_POSITION               0x00000011
#define _ADEVCFG0_IC_ACLK_MASK                   0x00020000
#define _ADEVCFG0_IC_ACLK_LENGTH                 0x00000001

#define _ADEVCFG0_CANFDDIV_POSITION              0x00000014
#define _ADEVCFG0_CANFDDIV_MASK                  0x00300000
#define _ADEVCFG0_CANFDDIV_LENGTH                0x00000002

#define _ADEVCFG0_PCM_POSITION                   0x00000017
#define _ADEVCFG0_PCM_MASK                       0x00800000
#define _ADEVCFG0_PCM_LENGTH                     0x00000001

#define _ADEVCFG0_UPLLHWMD_POSITION              0x00000018
#define _ADEVCFG0_UPLLHWMD_MASK                  0x01000000
#define _ADEVCFG0_UPLLHWMD_LENGTH                0x00000001

#define _ADEVCFG0_SPLLHWMD_POSITION              0x00000019
#define _ADEVCFG0_SPLLHWMD_MASK                  0x02000000
#define _ADEVCFG0_SPLLHWMD_LENGTH                0x00000001

#define _ADEVCFG0_BTPLLHWMD_POSITION             0x0000001A
#define _ADEVCFG0_BTPLLHWMD_MASK                 0x04000000
#define _ADEVCFG0_BTPLLHWMD_LENGTH               0x00000001

#define _ADEVCFG0_ETHPLLHWMD_POSITION            0x0000001B
#define _ADEVCFG0_ETHPLLHWMD_MASK                0x08000000
#define _ADEVCFG0_ETHPLLHWMD_LENGTH              0x00000001

#define _ADEVCFG0_FECCCON_POSITION               0x0000001C
#define _ADEVCFG0_FECCCON_MASK                   0x30000000
#define _ADEVCFG0_FECCCON_LENGTH                 0x00000002

#define _ADEVCFG0_ETHTPSF_POSITION               0x0000001E
#define _ADEVCFG0_ETHTPSF_MASK                   0x40000000
#define _ADEVCFG0_ETHTPSF_LENGTH                 0x00000001

#define _ADEVCFG0_EPGMCLK_POSITION               0x0000001F
#define _ADEVCFG0_EPGMCLK_MASK                   0x80000000
#define _ADEVCFG0_EPGMCLK_LENGTH                 0x00000001

#define _ADEVCFG0_w_POSITION                     0x00000000
#define _ADEVCFG0_w_MASK                         0xFFFFFFFF
#define _ADEVCFG0_w_LENGTH                       0x00000020

#define _AFBCFG0_BUHSWEN_POSITION                0x00000000
#define _AFBCFG0_BUHSWEN_MASK                    0x00000001
#define _AFBCFG0_BUHSWEN_LENGTH                  0x00000001

#define _AFBCFG0_PCSCMODE_POSITION               0x00000001
#define _AFBCFG0_PCSCMODE_MASK                   0x00000002
#define _AFBCFG0_PCSCMODE_LENGTH                 0x00000001

#define _AFBCFG0_BOOTISA_POSITION                0x00000003
#define _AFBCFG0_BOOTISA_MASK                    0x00000008
#define _AFBCFG0_BOOTISA_LENGTH                  0x00000001

#define _AFBCFG0_w_POSITION                      0x00000000
#define _AFBCFG0_w_MASK                          0xFFFFFFFF
#define _AFBCFG0_w_LENGTH                        0x00000020

#define _AFCPN0_CP_POSITION                      0x0000001C
#define _AFCPN0_CP_MASK                          0x10000000
#define _AFCPN0_CP_LENGTH                        0x00000001

#define _AFCPN0_w_POSITION                       0x00000000
#define _AFCPN0_w_MASK                           0xFFFFFFFF
#define _AFCPN0_w_LENGTH                         0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _TIMER_1_VECTOR                          4
#define _INPUT_CAPTURE_1_ERROR_VECTOR            5
#define _INPUT_CAPTURE_1_VECTOR                  6
#define _OUTPUT_COMPARE_1_VECTOR                 7
#define _EXTERNAL_1_VECTOR                       8
#define _TIMER_2_VECTOR                          9
#define _INPUT_CAPTURE_2_ERROR_VECTOR            10
#define _INPUT_CAPTURE_2_VECTOR                  11
#define _OUTPUT_COMPARE_2_VECTOR                 12
#define _EXTERNAL_2_VECTOR                       13
#define _TIMER_3_VECTOR                          14
#define _INPUT_CAPTURE_3_ERROR_VECTOR            15
#define _INPUT_CAPTURE_3_VECTOR                  16
#define _OUTPUT_COMPARE_3_VECTOR                 17
#define _EXTERNAL_3_VECTOR                       18
#define _TIMER_4_VECTOR                          19
#define _INPUT_CAPTURE_4_ERROR_VECTOR            20
#define _INPUT_CAPTURE_4_VECTOR                  21
#define _OUTPUT_COMPARE_4_VECTOR                 22
#define _EXTERNAL_4_VECTOR                       23
#define _TIMER_5_VECTOR                          24
#define _FLASH_CONTROL_VECTOR                    30
#define _PREFETCH_VECTOR                         31
#define _PFW_CRC_VECTOR                          32
#define _RTCC_VECTOR                             33
#define _USB_VECTOR                              34
#define _SPI1_FAULT_VECTOR                       35
#define _SPI1_RX_VECTOR                          36
#define _SPI1_TX_VECTOR                          37
#define _UART1_FAULT_VECTOR                      38
#define _UART1_RX_VECTOR                         39
#define _UART1_TX_VECTOR                         40
#define _I2C1_BUS_VECTOR                         41
#define _I2C1_SLAVE_VECTOR                       42
#define _I2C1_MASTER_VECTOR                      43
#define _CHANGE_NOTICE_A_VECTOR                  44
#define _CHANGE_NOTICE_B_VECTOR                  45
#define _CHANGE_NOTICE_C_VECTOR                  46
#define _CHANGE_NOTICE_K_VECTOR                  47
#define _SPI2_FAULT_VECTOR                       53
#define _SPI2_RX_VECTOR                          54
#define _SPI2_TX_VECTOR                          55
#define _UART2_FAULT_VECTOR                      56
#define _UART2_RX_VECTOR                         57
#define _UART2_TX_VECTOR                         58
#define _I2C2_BUS_VECTOR                         59
#define _I2C2_SLAVE_VECTOR                       60
#define _I2C2_MASTER_VECTOR                      61
#define _UART3_FAULT_VECTOR                      62
#define _UART3_RX_VECTOR                         63
#define _UART3_TX_VECTOR                         64
#define _DMA0_VECTOR                             68
#define _DMA1_VECTOR                             69
#define _DMA2_VECTOR                             70
#define _DMA3_VECTOR                             71
#define _DMA4_VECTOR                             72
#define _DMA5_VECTOR                             73
#define _DMA6_VECTOR                             74
#define _DMA7_VECTOR                             75
#define _TIMER_6_VECTOR                          76
#define _TIMER_7_VECTOR                          80
#define _RFSMC_VECTOR                            83
#define _RFMAC_VECTOR                            84
#define _CTR1_EVENT_VECTOR                       85
#define _RFTM0_VECTOR                            86
#define _RFTM1_VECTOR                            87
#define _RFTM2_VECTOR                            88
#define _RFTM3_VECTOR                            89
#define _CTR1_TRG_VECTOR                         90
#define _RFWCOE_VECTOR                           91
#define _ADC_VECTOR                              92
#define _ADC_DC1_VECTOR                          94
#define _ADC_DC2_VECTOR                          95
#define _ADC_DF1_VECTOR                          96
#define _ADC_DF2_VECTOR                          97
#define _ADC_FAULT_VECTOR                        100
#define _ADC_EOS_VECTOR                          101
#define _ADC_ARDY_VECTOR                         102
#define _ADC_URDY_VECTOR                         103
#define _ADC_DMA_VECTOR                          104
#define _ADC_DATA0_VECTOR                        106
#define _ADC_DATA1_VECTOR                        107
#define _ADC_DATA2_VECTOR                        108
#define _ADC_DATA3_VECTOR                        109
#define _ADC_DATA4_VECTOR                        110
#define _ADC_DATA5_VECTOR                        111
#define _ADC_DATA6_VECTOR                        112
#define _ADC_DATA7_VECTOR                        113
#define _ADC_DATA8_VECTOR                        114
#define _ADC_DATA9_VECTOR                        115
#define _ADC_DATA10_VECTOR                       116
#define _ADC_DATA11_VECTOR                       117
#define _ADC_DATA12_VECTOR                       118
#define _ADC_DATA13_VECTOR                       119
#define _ADC_DATA14_VECTOR                       120
#define _ADC_DATA15_VECTOR                       121
#define _ADC_DATA16_VECTOR                       122
#define _ADC_DATA17_VECTOR                       123
#define _ADC_DATA18_VECTOR                       124
#define _ADC_DATA19_VECTOR                       125
#define _ADC_DATA20_VECTOR                       126
#define _ADC_DATA21_VECTOR                       127
#define _ADC_DATA22_VECTOR                       128
#define _ADC_DATA23_VECTOR                       129
#define _CAN1_VECTOR                             142
#define _CAN2_RX_VECTOR                          143
#define _CAN2_TX_VECTOR                          144
#define _CAN2_MISC_VECTOR                        145
#define _SQI1_VECTOR                             150
#define _PTG0_STEP_VECTOR                        152
#define _PTG0_WDT_VECTOR                         153
#define _PTG0_TRG0_VECTOR                        154
#define _PTG0_TRG1_VECTOR                        155
#define _PTG0_TRG2_VECTOR                        156
#define _PTG0_TRG3_VECTOR                        157
#define _CORE_PERF_COUNT_VECTOR                  162
#define _CORE_FAST_DEBUG_CHAN_VECTOR             163
#define _CRYPTO_VECTOR                           164
#define _ETHERNET_VECTOR                         165
#define _CRYPTO1_VECTOR                          166
#define _CRYPTO1_FAULT_VECTOR                    167
#define _CVD_EVENT_VECTOR                        168

/* Device Peripherals */
#define _ADCHS1
#define _CAN1
#define _CANFD2
#define _CRU
#define _CRYPTO
#define _CVD
#define _DMAC
#define _DMT
#define _ETH
#define _I2C1
#define _I2C2
#define _ICAP1
#define _ICAP2
#define _ICAP3
#define _ICAP4
#define _INT
#define _NVM
#define _OCMP1
#define _OCMP2
#define _OCMP3
#define _OCMP4
#define _PCACHE
#define _PORTA
#define _PORTB
#define _PORTC
#define _PORTK
#define _PTG
#define _RNG
#define _RTCC
#define _SPI1
#define _SPI2
#define _SQI1
#define _TMR1
#define _TMR2
#define _TMR3
#define _TMR4
#define _TMR5
#define _TMR6
#define _TMR7
#define _UART1
#define _UART2
#define _UART3
#define _USB
#define _USB1
#define _WDT
#define __DDPSTAT

